{"title":"Faster_Pussycat!_Kill!_Kill! (h264-sickboy88)","uid":3432667,"size":733553384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:000bb0620488eb7d31accea7437121c68d612df9&amp;dn=Faster_Pussycat%21_Kill%21_Kill%21+%28h264-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sickboy88","files":2,"time":1137482416,"description":"Faster, Pussycat! Kill! Kill! (1965)\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0059170/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0059170/&lt;/a&gt;\n\n----\n\nThis is a must see movie.  It has been a favorite and an inspiration to many greats, such as John Waters and Quentin Tarantino.  It has been said, that if this movie had never existed, that &quot;Pulp Fiction&quot; would not have been made.\n\nThis is fucking rare.  I don't care if you post a link to a dvd for sale...it's fucking rare, and the recently released dvd will run you $40 USA...which is what I just paid. ;)\n\nThis is ripped from the DVD put out by Russ Meyers actual studio:\n &lt;a href=&quot;\nhttp://www.rmfilms.com/html/catalog/faster.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rmfilms.com/html/catalog/faster.shtml&lt;/a&gt;\n\nIt's good shit, and I feel that it is the best release that I've seen.\n\nThe Matroska container supports &quot;attachments&quot;, and I put a few scans of the DVD case, DVD, Movie posters, and some other shit into the container the movie is in.  Make sure you extract them and take a look. ;)\n\nTo extract the pictures from the torrent:\n\nDownload:\n\nmkvtoolnix:\n &lt;a href=&quot;\nhttp://www.bunkus.org/videotools/mkvtoolnix/win32/mkvtoolnix-unicode-1.6.5.rar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bunkus.org/videotools/mkvtoolnix/win32/mkvtoolnix-unicode-1.6.5.rar&lt;/a&gt;\n\nUnrar, and then download this:\n\nMkvExtractGUI:\n &lt;a href=&quot;\nhttp://corecodec.org/frs/?group_id=55&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://corecodec.org/frs/?group_id=55&lt;/a&gt;\n\nAnd unrar into the same directory as &quot;mkvtoolnix&quot;.\n\nClick on MKvExtractGUI, then when it runs, simply drag the .mkv onto the screen of MKVextractGUI.  Wait for info to be displayed on the screen.  Choose your output folder by clicking the &quot;other path&quot; button, then click the box on the shit you want.  You can extract the audio, video, everything..it's very cool.\n\n----\n\nTo watch this, you need only 3 things:\n\n1.  FFDSHOW 2005-12-21 SSE:\n &lt;a href=&quot;\nhttp://www.afterdawn.com/software/video_software/codecs_and_filters/ffdshow.cfm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.afterdawn.com/software/video_software/codecs_and_filters/ffdshow.cfm&lt;/a&gt;\n\n\n2.  Matroska Pack Lite v1.1.2 (2005-10-15)\n &lt;a href=&quot;\nhttp://packs.matroska.org/latest/Matroska_Pack_Lite.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://packs.matroska.org/latest/Matroska_Pack_Lite.exe&lt;/a&gt;\n\n\n3.  A &quot;DirectShow&quot; media player, such as &quot;Windows Media Player&quot; or better yet, \n\n&quot;Media Player Classic&quot;\n &lt;a href=&quot;\nhttp://sourceforge.net/project/showfiles.php?group_id=82303&amp;package_id=84358&amp;release_id=216658&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sourceforge.net/project/showfiles.php?group_id=82303&amp;package_id=84358&amp;release_id=216658&lt;/a&gt;\n\n\nVLC Works great too:\n &lt;a href=&quot;\nhttp://www.videolan.org/vlc/download-windows.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.videolan.org/vlc/download-windows.html&lt;/a&gt;\n\n----\n\nMini Plot:\n\nThree wild women in three fast cars take time off from stripping in clubs to go on a murder rampage. They kidnap and drug the girlfriend of one of their victims and hole up at a secluded ranch owned by a wheelchair-bound man and his two sons.\n\n----\n\nWhat others have said:\n\n\n1.  Think of Russ Meyer and you'll think of tits. Big, bouncy tits. Usually attached to a tough-as-hell chick.\n\nRM made stars of LA strippers and Playboy girls. He made sex fun, violence camp, and sleaze appealing. He was the ultimate Bizarre film-maker.\n\nTo this day, his aesthetic is admired and copied. Quentin Tarantino, John Waters, even The Spice Girls and Janet Jackson have more than nodded in Meyer's direction in their work.\n\nHis career started in a more sober fashion, as a World War II newsreel cameraman, but his first film, made in 1959, could be seen as the first real US porn film. The Immoral Mr Teas turned a profit of $1million - a vast sum in those days.\n\nRuss wrote, directed, edited, and often self-financed his own films. He turned in his finest work in the mid-60s, with his quartet of 'gothic' movies. Motor Psycho, Faster Pussycat Kill! Kill!, Lorna and Mudhoney were shot in black and white for economic reasons, but the stark crispness of the films means they still look iconic. They were racy, and classed as pornography at the time, but Meyer's sharp artistic eye elevated his work far above cheap skin flicks.\n\nHis venture into mainstream cinema came with Beyond The Valley Of The Dolls, and even that was an orgy of girl rock'n'roll, drugs, lesbian sex and cross-dressing. Meyer's very brief sidestep into serious cinema (The Seven Minutes) was swiftly followed in the 70s by a run of superbly trashy sex-and-violence flicks. His work in the 80s and 90s strayed into self-parody, and he became reclusive, although he was happy to answer his phone and chat to anyone who cared to call him.\n\nMeyer had taken the nudie stag films of the 50s, and stretched them into proper, full-length movies, complete with storylines, characters, and elaborate set-piece fights. Films which were shown in cinemas rather than at stag nights, and enjoyed by a young, hip crowd. He made porn funny, in a bouncing, jiggling, giggly way. But perhaps Meyer's greatest achievement was to make his films appeal to everyone but the most prudish. Accusations of screen sexism were stomped on by the strong female stars of the films, who initiated sex, were wilfully violent, and camply bitchy. And still, today, his films are loved by hipsters, freaks, geeks, and fans of really, really, really big tits worldwide.\n\nRuss Meyer died of complications of pneumonia on 18 September. He was 82.\n\n\n\n\n2.  Don't ask me about this film because I'll never shut up. It's my favorite movie of all time. Hands down. I saw it first at the Film Forum Theatre in NYC in 1984. Since then I've owned bootleg copies and watched them so many times that if I had a 40 inch chest, I could BE in this movie! I know every line by heart.\nWhat a kick (pardon the pun) to see Varla beating up... [a man]. Her nasty attitude rivals any screen villian ever. Darth Vader looks like Mickey Mouse compared to her....\n\nI have had the immense pleasure of meeting Tura Satana, Haji &amp; Laurie Williams &amp; Russ Meyer several times. Russ is a bit weird, but the women are sweet &amp; gracious. Although it's obvious that Tura truly is tough &amp; will kick ...[butt] if she's pushed hard enough! Check out her website! She's the greatest!\n\n... Judge for yourself. Either way, you'll never be the same.\n\n\n\n\n3.  Go-go dancers, 60's rock music, independent women, fast cars - one would think that this was a Tarantino flick. But it isn't. Forty years ago, this film journeyed out into a territory where it would not follow, only be followed. Like the California desert where the femme-fatales raced their cars, this film forces the individual to come forward.\n\nThere is a complexity in this film epitomized in the women. The antogonists are brash, violent, and selfish. They prey upon others and live for the moment. Yet there are no blameless victims here. Even the innocent girl, Linda, must bloody her hands before she can &quot;find herself&quot;. Yet, every woman is beautiful here. Thus, there is a tension between the beauty that society ascribes to form and the ugliness ascribed to actions.\n\nThe story stands the test of time. Sure, there have been female &quot;revenge&quot;/empowerment films through the years, but few display the genuine nature of woman's angst like this film. Only in recent years, with, perhaps, Tarantino's Kill Bill set, has the topic of the aggressive woman seen justice. Here, society can see &quot;the other side.&quot;\n\n\n\n4.  Hailed as &quot;the best movie ever made&quot; by director John Waters and invoked by Quentin Tarentino as one of his biggest influences, Pussycat features a trio of tough women who spend their leisure time outside the go-go cage driving through the California desert in tiny sports cars that look particularly ridiculous given the women's larger-then-life breasts. These thrillseekers are ballooned-up archetypes ? the Blonde (Lori Williams), tough but occasionally sensitive; the Ethnic (Meyer regular Haji) with masochistic, quasi-Lesbian impulses; and supremely, Varla (Tura Satana), a '60s summation of the scary-yet-desirable dominatrix with her black stretch jumpsuit, leather boots and accessories, and troweled-on mascara across evil slits for eyes. Sure, it's not exactly the sort of thing those of who came of age under the sign of the Spice channel would go in for, but what the movie's lost in sex appeal it's more than made up for in its undisputed status as a piece of deliciously campy nostalgo-trash. \n\n\n\n5.  I have watched and enjoyed most of Russ Meyer's output, and will quite happily defend his lesser works, but two of his movies have a life of their own and have managed to reach a larger audience than &quot;just&quot; card carrying Meyer nuts. They are 'Beyond The Valley Of The Dolls' and this one, 'Faster Pussycat! Kill! Kill!'. Both movies are trash classics and never fail to entertain no matter how many times you have seen them. 'Faster Pussycat!' really succeeds mainly because of the three strong leads, Tura Satana, Lori Williams and Haji. Any one of them would be enough for Meyer to plan a killer movie around, but all three together is dynamite! Satana, strangely enough, did very little movie work after this, mainly a couple of Ted Mikels turkeys. But it doesn't really matter because her screen immortality is assured. Her performance in this movie is more than enough! Williams also went on to very little, but she is very good here, and stylistically reminds me quite a bit of Erica Gavin in 'Vixen!'. In fact one could almost bet that if Meyer had been aware of Gavin when he made this movie she would have played the part of Billie. Haji appeared in a few more Meyer movies, including his masterpiece 'Supervixens', but this is probably her strongest role. All three women, who play go-go dancers by night, thrill seeking criminals by day, are simply wonderful and their chemistry and repartee are priceless. Meyer regular Stuart Lancaster is also in fine form as a dirty old man with more issues than a daily newspaper. There are so many unforgettable scenes in this movie it's difficult to single any out. The whole movie just rocks period. Many late 60s movies attempted to emulate a camp, comic book appeal ('Barbarella', 'Diabolik',etc.etc.) but in many ways Meyer beat them all, and did so without technicolor, large sets, multiple costumes, special effects and other gimmicks. Just crisp black and white photography and three chicks in the desert. Plus a brilliant theme song later immortalized by The Cramps. Russ Meyer divides most viewers. You either &quot;get it&quot; or you don't. If you aren't familiar with his work this is probably THE place to start. Watching this movie for many is a life changing experience! 'Faster Pussycat!' is one of the most original and entertaining movies made in the 1960s, and continues to amuse and inspire right into the 21st Century. Every time I watch this movie I am knocked out. This is a bona fide cult classic that gets better and better as the years go by. Absolutely essential viewing for anyone who loves exploitation movies, The Sixties, rock'n'roll and/or buxom babes!\n\n----\n\nEncoded by: sickboy88\nCodec: H.264 (x264 Revision 399)\nContainer: Matroska\nBitrate: 1000 kb/s AVG\nAspect: 640x480 = 4:3\nAudio: Audio: English, 128 kb/s VBR AVG Stereo MP3 @ 48K Hz\nSubtitles: None\nRuntime: 83 min\nFPS: 23.976\n\n----\n\nSome good reading:\n\n1.  Matroska FAQ:\n &lt;a href=&quot;\nhttp://www.matroska.org/technical/guides/faq/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.matroska.org/technical/guides/faq/index.html&lt;/a&gt;\n\n\n2.  MKV to DVD Conversion Guide, using DVD Santa 4.0:\n &lt;a href=&quot;\nhttp://www.matroska.org/technical/guides/dvd/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.matroska.org/technical/guides/dvd/index.html&lt;/a&gt;\n\n\n3.  H.264 Whitepaper:\n &lt;a href=&quot;\nhttp://www.ati.com/products/pdf/H264_Whitepaper.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ati.com/products/pdf/H264_Whitepaper.pdf&lt;/a&gt;\n\n\n4.  Doom9 2005 Codec Shootout:\n &lt;a href=&quot;\nhttp://www.doom9.org/index.html?/codecs-final-105-1.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.doom9.org/index.html?/codecs-final-105-1.htm&lt;/a&gt;\n\n\n5.  Wikipedia on H.264:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/H.264&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/H.264&lt;/a&gt;","torrent":{"xt":"urn:btih:000bb0620488eb7d31accea7437121c68d612df9","amp;dn":"Faster_Pussycat%21_Kill%21_Kill%21+%28h264-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"000bb0620488eb7d31accea7437121c68d612df9","infoHashBuffer":{"type":"Buffer","data":[0,11,176,98,4,136,235,125,49,172,206,167,67,113,33,198,141,97,45,249]},"announce":[],"urlList":[]}}