{"title":"Rising Sun Gold [1CD] [MDF] [ENG]","uid":3446357,"size":728520726,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:00d0dc9ad40b71a0500302b363d9c0d428efe529&amp;dn=Rising+Sun+Gold+%5B1CD%5D+%5BMDF%5D+%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"voodoo34","files":2,"time":1140281049,"description":"At the close of the year 1941, the Japanese Empire unveiled its imperialist plans to unite the western Pacific under the flag of the Rising Sun. The name for the new territory would be the &quot;Greater East Asia Co-Prosperity Sphere&quot;. Beginning with the unprovoked, devastating raid on Pearl Harbor, the Japanese military launched surprise attacks against key strategic targets in an all-out effort to secure victory. From Singapore to Manila to the tiny island of Guam, the nations of the western Pacific faced the most dangerous enemy ever...men who considered it an honor to die in service of the Empire of Rising Sun!\nNow you too, can take your stand at Okinawa with TalonSoft&amp;#039;s Rising Sun, the third installation in the award-winning Campaign Series. Storm the shores of the islands of the South and West Pacific or hunt your foes down through the snake-infested jungles of Burma. Do battle on the sandy beaches of Guadalcanal, Tarawa, Betio, and many others. TalonSoft&amp;#039;s Rising Sun puts platoon-level combat at your fingertips.\n\n\nSpecial Features:\n\n    *\n\n      30+ Exciting Scenarios: Relive historic ground battles between the Japanese and the forces of the United States, Britain and the Commonwealth from 1941 to 1945.\n    *\n\n      Four &quot;Linked Campaign&quot; Games: Lead a band of determined Japanese as they battle their way into Manila in 1942, or command your battle-hardened &quot;Leathernecks&quot; as they wade ashore and expand their beachhead at Guadalcanal.   Or, take your battalion of tough Aussies up and over New Guinea&amp;#039;s famed Owen Stanley mountain range along the jungle-choked Kokoda Trail.\n    *\n\n      New Terrain Types: Fight your way through new terrain including dry and flooded rice paddies, light and dense jungles, palm orchards, and coral reefs.\n    *\n\n      Complete Orders of Battle included for US Marines, US Army, Japanese, British and Commonwealth such as Australians, Indians, and New Zealanders. \n\nSystem Requirements:\n\n    *\n\n      Pentium 200 or higher\n    *\n\n      Windows 95/98\n    *\n\n      Computer 100% PC Compatible\n    *\n\n      Monitor capable of High Color (16 bit)\n    *\n\n      32 MB RAM minumum (32 MB Recommended)\n    *\n\n      4X CD-Rom or higher\n    *\n\n      Microsoft Compatible Mouse","torrent":{"xt":"urn:btih:00d0dc9ad40b71a0500302b363d9c0d428efe529","amp;dn":"Rising+Sun+Gold+%5B1CD%5D+%5BMDF%5D+%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d0dc9ad40b71a0500302b363d9c0d428efe529","infoHashBuffer":{"type":"Buffer","data":[0,208,220,154,212,11,113,160,80,3,2,179,99,217,192,212,40,239,229,41]},"announce":[],"urlList":[]}}