{"title":"UFO - Stanton T. Friedman IS Real!","uid":3381370,"size":823416562,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:010730531d6a211849f07f8c4827eef6efe5960b&amp;dn=UFO+-+Stanton+T.+Friedman+IS+Real%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BeOSDano0","files":2,"time":1126335778,"description":"Stanton Friedman\n\nBiography: \n\nStanton T. Friedman received BSc and MSc degrees in physics from the University of Chicago in 1955 and 1956. He was employed for 14 years as a nuclear physicist for such companies as GE, GM, Westinghouse, TRW Systems, Aerojet General Nucleonics, and McDonnell Douglas on such advanced, classified, eventually cancelled, projects as nuclear aircraft, fission and fusion rockets, and nuclear powerplants for space. \n\nSince 1967 he has lectured on the topic &quot;Flying Saucers ARE Real!&quot; at more than 600 colleges and over 100 professional groups in 50 states, 9 provinces, 13 other countries. He has published more than 80 UFO papers and appeared on hundreds of radio and TV programs. He is the original civilian investigator of the Roswell Incident and co-authored &quot;Crash at Corona: The Definitive Study of the Roswell Incident.&quot; TOP SECRET/MAJIC, his explosive book about the Majestic 12 group established in 1947 to deal with crashed saucers, was published in 1996 and is in its 6th printing. Stan was presented with a Lifetime Achievement Award in Leeds, England, in September, 2002, by UFO Magazine of the UK. A documentary &quot;Stanton T. Friedman IS Real&quot; was broadcast in Canada in 2002. \n\nHe has provided written testimony to Congressional Hearings, appeared twice at the UN, and been a pioneer in many aspects of Ufology including Roswell, Majestic 12, the Betty Hill-Marjorie Fish star map work; analysis of the Delphos, Kansas, physical trace case; crashed saucers, flying saucer technology and challenges to the S.E.T.I. (Silly Effort to Investigate) cultists. \n\nStanton Friedman takes a clear-cut unambiguous stand that SOME UFOs are alien spacecraft, that the subject of flying saucers represents a Cosmic Watergate, that none of the anti-UFO arguments made by a variety of noisy negativists stand up to careful scrutiny, and that we are dealing with the biggest story of the past millennium: visits to Planet Earth by alien spacecraft and the successful coverup by governments of the best data: alien wreckage and bodies recovered in New Mexico, for 56 years. He has spent many weeks at a total of 20 document archives. Stan has successfully taken on many critics of flying saucers, Roswell, Majestic 12, including winning a debate at Oxford University. \n\nStanton T. Friedman is a dual citizen of the USA and Canada and lives at 79 Pembroke Crescent, Fredericton, New Brunswick, Canada E3B 2V1. \n\n(From Stanton Friedman's homepage)\n \n\n \n","torrent":{"xt":"urn:btih:010730531d6a211849f07f8c4827eef6efe5960b","amp;dn":"UFO+-+Stanton+T.+Friedman+IS+Real%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010730531d6a211849f07f8c4827eef6efe5960b","infoHashBuffer":{"type":"Buffer","data":[1,7,48,83,29,106,33,24,73,240,127,140,72,39,238,246,239,229,150,11]},"announce":[],"urlList":[]}}