{"title":"Gengis Khan's Cook, &quot;Live with Honour&quot;","uid":3383591,"size":63783549,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:010d4a6be32850de26751d81521c6ac75fbd6530&amp;dn=Gengis+Khan%5C%27s+Cook%2C+%5C%22Live+with+Honour%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratinopiratino","files":11,"time":1126804568,"description":"A monster movie for your ears.\nGengis Khan's Cook.\n\nwww.gk-cook.com\n\n\n29.5.05\nLive with Honour (a monster movie for your ears) \nCapita, a volte, che il tempo faccia capire che quella che era sembrata una totale perdita di tempo, in realt&amp;agrave; era solo l?anticamera non troppo definita di uno ?work in progress? che doveva portare ad un risultato, magari bislacco, ma pur sempre degno di nota.\n\nLa definizione calza a pennello se applicata al contesto dei Gengis Khan?s Cook nei confronti di questo ?Live with Honour (a monsters movie for your ears)?.\nIl trio nasce verso la fine degli anni ?90 in Valle Seriana, in terra bergamasca. Dopo svariati cambi di formazione, si definisce verso il 2000 la line-up attuale: Davide ?Braska? Covelli alla chitarra, Alberto Bigoni al basso, Fausto Bellini alla batteria. Nessuna voce.\n\nRock strumentale, sempre e comunque.\nNiente di pi&amp;ugrave;, niente di meno.\n\nIl tempo passa, ma nulla prende forma, il risultato sembra lontano anni luce. Non si concretizza un bel niente, l?energia del trio non riesce ad incanalarsi in un ?qualcosa? di proponibile. Con il passare del tempo, l?idea di lasciar perdere si impone con prepotenza. Siamo verso la fine del 2002. I tre si perdono di vista, musicalmente parlando.\n\nMarzo 2005. L?astinenza &amp;egrave; durata anche troppo.\nUn giro di telefonate, ?si prova??. Pronti!\nDopo tre minuti del solito sound bislacco che sembrava non risentire assolutamente di due anni e passa di stop, la proposta: ?andiamo il prima possibile a registrare l?unica cosa che sappiamo fare, improvvisazioni modali su poliritmi rock?. Ci si organizza con un paio di soci fonici, Diego Bergamini e Marco Romelli (due amanti impareggiabili prima che professionisti del suono), si affitta una sala prove, si allestisce il tutto verso la fine di aprile. Un?oretta a preparare gli strumenti ed i microfoni, si tirano i cavi, si scaldano gli ampli. Il ?rec? &amp;egrave; premuto e si registra. Due sessioni, intervallate da una notte di pausa. Risultato finale, circa centocinquanta minuti di ?roba?. Gi&amp;agrave;, non si potrebbe definita diversamente. Improvvisazione pura, il trio non si ferma neanche per definire le progressioni di accordi, niente di niente. Approccio ?ad orecchio?, nella pi&amp;ugrave; becera delle accezioni possibili del termine. Si voleva suonare ?per istinto?, cos&amp;igrave; &amp;egrave; stato.\nLa settimana dopo, in studio, in un?ora si fa un missaggio, tanto per comprimere i suoni, una normalizzazione dei volumi. Fine.\nUn paio di settimane di ascolti. La scelta cade su nove riff per un totale di circa trentotto minuti, i nove brani che quindi andranno a comporre la scaletta del ?Live with Honour (a monsters movie for your ears). La citazione zappiana nel titolo non pu&amp;ograve; ingannare. Come diceva il Maestro, ?Music is the best? e tutto il resto non conta. ?Live? perch&amp;eacute; una presa diretta non la si pu&amp;ograve; definire diversamente, ?un film di mostri per le tue orecchie? perch&amp;eacute; i pezzi strumentali dovrebbero avere almeno l?ambizione di essere un commento sonoro per un?idea visiva.\nI titoli vanno a pescare nel profondo della tradizione orobica:\n\n1. When I was four I used to pick up butts and smoke them\n2. Welcome to my desert\n3. Does distortion belong to GK?\n4. Low impedance driving capability\n5. In mono-chord we trust!\n6. Nasty Dave!\n7. It?s only the summer hit but I like it\n8. Gengi Gengi Gengis\n9. Guru\n\nQuesto &amp;egrave; quanto. Anni di prove solo per affinare la simbiosi tra i tre musicisti. Tutto il resto non conta. Si voleva mettere su nastro il ?processo creativo?? Il risultato &amp;egrave; stato ottenuto. Il trio pu&amp;ograve; finalmente dormire sonni tranquilli, sapendo di aver fatto quello che poteva?","torrent":{"xt":"urn:btih:010d4a6be32850de26751d81521c6ac75fbd6530","amp;dn":"Gengis+Khan%5C%27s+Cook%2C+%5C%22Live+with+Honour%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010d4a6be32850de26751d81521c6ac75fbd6530","infoHashBuffer":{"type":"Buffer","data":[1,13,74,107,227,40,80,222,38,117,29,129,82,28,106,199,95,189,101,48]},"announce":[],"urlList":[]}}