{"title":"TRACES_OF_DEATH_1","uid":3421815,"size":3149031458,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:014e3c98e35ff3ac4bc7bff448670a3add88393b&amp;dn=TRACES_OF_DEATH_1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigorkrad","files":22,"time":1134839580,"description":"Traces of Death is a 1993 direct-to-video release of various footage similar to the style of Faces of Death. Unlike Faces of Death, Traces consists mostly of actual footage depicting death and torture of people and animals. It is banned in the United Kingdom by the BBFC for not having any &quot;journalistic, educational or other justifying context for the images shown&quot;. It has four sequels, all five have been released on VHS and DVD. Among the footage seen on Traces of Death is the R. Budd Dwyer press conference suicide, the Sarajevo market place bombing that killed almost 100 people, montages of dead children and babies, and a bicyclist flattened by a tipped over bus. Traces of Death features the use of music (often punk, hardcore or heavy metal) over the footage, occasionally giving it a surreal and bizarre feel. Traces of Death is distributed by Darrin Ramage of Brain Damage Films. Brain Damage Films specializes mostly in distributing low budget independent horror films like &quot;Strange Things Happen At Sundown&quot; and &quot;Terror Toons&quot;.\n\n","torrent":{"xt":"urn:btih:014e3c98e35ff3ac4bc7bff448670a3add88393b","amp;dn":"TRACES_OF_DEATH_1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"014e3c98e35ff3ac4bc7bff448670a3add88393b","infoHashBuffer":{"type":"Buffer","data":[1,78,60,152,227,95,243,172,75,199,191,244,72,103,10,58,221,136,57,59]},"announce":[],"urlList":[]}}