{"title":"The Shizit - Soundtrack for the Revolution (2001 / MP3 / 192vbr)","uid":3294205,"size":61818967,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:03e351bd8562dab08da823160e39d5e673216224&amp;dn=The+Shizit+-+Soundtrack+for+the+Revolution+%282001+%2F+MP3+%2F+192vbr%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fitlh","files":15,"time":1109187076,"description":"Atari Teenage Riot / Aphex Twin / Spineshank / Mad Capsule Markets, think of these artists when considering this download.\n\nThe Shizit - Soundtrack For The Revolution\n\n1. Pain Compliance\n2. Audio Jihad II\n3. Cold Naked Protest\n4. Spit AK\n5. Soundtrack For The Revolution\n6. AntiCulture\n7. Econobeing\n8. I Walk Through Walls\n9. Herdcore\n10. Dear Government\n11. Point Click Kill\n12. Firewall\n\nThe Shizit are a band who will unquestionably alienate half of those exposed to their music, while utterly enthrall the others. Flush with cutting edge electronic programming and grating guitars, the band attack their targets like a mescaline addled assassin, unleashing their acidic lyrical commentary on everything political and unjust in a fiercely thought provoking manner. Sounding much like an amalgamation of bands like Atari Teenage Riot, Pitchshifter and Aphex Twin, the band choose to complete their arsenal with an enraged modern metal edge akin to recent Spineshank, making this Seattle based duo one of the more innovative and enraged acts to spring forth from the underground in recent years.\n\nBand frontman J.P.'s vocals drip with seething rage and aggression, possessing a vehement conviction not seen often in recent times. Whether embarking on a political tinged rant, belting out a somewhat rap based flow or exploding into incinerating screams, the emotionally charged performance delivered, truly injects a fearsome amount of intensity into the music overall. Meanwhile the guitar work, which is quite treble heavy, is more than able to swath a sharp path through the groups near vertigo inducing electronic indulgence, by using a well honed arsenal of disorienting, yet piercingly distorted riffs and well placed breaks, strewn upon waves of riotously intense discordant electronic programming. The band then finalize their assault with cratering bass drops and spasms of over the top drum machine based percussion, causing nearly each track to dangerously to fall completely into the realm of sonic dissonance and yet somehow in the end it all works out with amazingly cognitive results.\n\nPacked with intelligently written lyrics that actually challenge the listener while providing a dissident standpoint against the failures of modern political practices and society in general, The Shizit have a lot to offer, especially when considering the creatively violent electronic packaging which they are able to present their ideas in. Their music stands out not only because its sound is unique in contrast to the bulk of what's out there, but also because the bold ideas are presented with such fervor and convulsing passion. That being said, the songs can at times lose their momentum due to structures that are a bit too radical, and the 2 piece nature of the group also seems to hamper a full bodied sound, with the mid range and low end suffering the worst. Still, on the other hand, the fact alone that such an effort was created by a band of two also deserves much praise and respect. In the end, &amp;quot;Soundtrack For The Revolution&amp;quot; owns up to its title, it may not have the most tactful implementation, but then again neither did the L.A. riots and they still got their message across.\n\nreview stolen from http://www.theprp.com/reviews/theshizit.shtml\n\n--\n\nCD Rip using EAC/LAME","torrent":{"xt":"urn:btih:03e351bd8562dab08da823160e39d5e673216224","amp;dn":"The+Shizit+-+Soundtrack+for+the+Revolution+%282001+%2F+MP3+%2F+192vbr%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e351bd8562dab08da823160e39d5e673216224","infoHashBuffer":{"type":"Buffer","data":[3,227,81,189,133,98,218,176,141,168,35,22,14,57,213,230,115,33,98,36]},"announce":[],"urlList":[]}}