{"title":"Adam Evil and the Outside Royalty","uid":3402947,"size":69620656,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:056c776de7ce277a964345e80b6115b1e4e7fdb1&amp;dn=Adam+Evil+and+the+Outside+Royalty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"madkow77","files":1,"time":1130621507,"description":"After nearly three years of existence, Adam Evil &amp; the Outside Royalty continue to refine their spectacle. They've been described as &quot;distortion-dosed rock with a glittery coat of glam&quot; and &quot;half Weimar cabaret and half T-Rex&quot;. The truth is - most critics don't know exactly where to place Adam Evil &amp; the Outside Royalty, but they do know that there's something happening here that is turning some heads. Incorporating a live string section, fuzzed-out analog synths, and a driving guitar/bass/drums core, the band creates a sound that while paying homage to a glimmering early 70's British vibe, is covering new ground undeniably its own.\n\nThe notion of looking to the future with one eye to the past lies at the heart of this band - the preservation of what came before, not merely for its own sake, but rather for the sake of improving that which is yet to come. The music is built on moods and melodies, and the lush retro sound is the product of knowing what works best for communicating the message at hand: real strings, real drums, real old amps and plenty of fuzz while not being afraid to break the mold. The self-titled debut CD was released on September 16, 2005 and features the entire 7-piece line-up as well as guest musician and producer Rick Nelson of the Polyphonic Spree.\n\nRead ahead for what some of the critics have had to say about Adam Evil &amp; the Outside Royalty over the last 3 years of their existence--\n\n&quot;Pittsburgh's Hottest Unsigned Rock Band&quot; -2004 Zippo Hot Tour\n\n&quot;With cello, violin, synth, guitars, bass, drums and some sound sampling thrown in at unexpected moments, each song is action-packed. They may start subtly, with little more than Evil's guitar and agile voice ambling through the verses, but they can explode at any minute with furious bursts from the whole band, change tempos and melodies in curious places and have a good number of hooks thrown in by the end... An orchestral ballad can quickly turn into a spiraling, guitar-driven number and then effortlessly switch back. The decadence carries glam rock connotations, but the sound is a lot more modern and sophisticated, and that tends to catch people off guard.&quot;\n-Pittsburgh Pulp 1/04\n\n&quot;Adam Evil takes his musical cues from the 1970s, specifically David Bowie and T. Rex. He doesn't merely imitate glam rock, but adds his own shaded nuances and textures to a sound that could, in lesser hands, sound dated. 'Heavy,' straight from 'All the Young Dudes,' songbook, is punctuated with horns and lovely, ethereal strings. &quot;Yesterday's Girl&quot; begins as a solemn dirge and lyrically references Lou Reed's 'Satellite of Love,' and is transformed into a John Cale-like meditation on lost love.\nOne more thing: Evil and the Outside Royalty are locals. It's still one of the best album releases of the year. Four stars.&quot;\n-Pittsburgh Tribune-Review, 10/4/05\n\n&quot;Evil's sound is a cross between a young, experimental David Bowie and elements of T. Rex and the Jam, circa 'All Mod Cons.'...the musicians never stay in a single place or settle for trite emotions. 'Liquid Leather Lover' is a straight-out rocker that does little to prepare a listener for the melancholic serenity of 'Yesterday's Girl.'&quot;\n-Pittsburgh Tribune Review 12/23/04\n\n&quot;It's amazing how you discover great music if you just seek it out. A few weeks ago I found myself at Club Cafe in Pittsburgh, PA... Adam Evil and the Outside Royalty took the stage and offered up a good 45-minute set of invigorating original music. With unique arrangements, a variety of delightful timbres and pretty passionate performances, you've got something that's easy to enjoy at first listen.&quot;\n-Drtune.net 9/04\n\n&quot;(In 2004) There also was a lot of good local music; particularly notable were efforts by Adam Evil &amp; The Outside Royalty ('Necessary Evil'), Tom Breiding ('Two Tone Chevrolet'), Good Brother Earl's self-titled release and The Breakup Society's 'James at 35.'&quot;\n-Pittsburgh Tribune Review 1/2/05\n\n&quot;...one of the most interesting out-of-town acts of this year, Adam Evil &amp; the Outside Royalty, moved the crowds upstairs. Evil has a girl in red patent leather go-go boots playing violin. Evil has a light show. Evil has killer hooks and hard-driving Rock tunes. Evil has new fans in the Queen City.&quot;\n-Cincinnati City Beat, 10/1/03","torrent":{"xt":"urn:btih:056c776de7ce277a964345e80b6115b1e4e7fdb1","amp;dn":"Adam+Evil+and+the+Outside+Royalty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056c776de7ce277a964345e80b6115b1e4e7fdb1","infoHashBuffer":{"type":"Buffer","data":[5,108,119,109,231,206,39,122,150,67,69,232,11,97,21,177,228,231,253,177]},"announce":[],"urlList":[]}}