{"title":"Ditto.DVDRip.DivX-MOJiS","uid":3459459,"size":1468933526,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05708be2fbcd703065acb0bcb174948c395dc07d&amp;dn=Ditto.DVDRip.DivX-MOJiS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"koreanmovies","files":4,"time":1142765297,"description":"Poster: http://cimg.163.com/movie/0212/11/ditto01.jpg\n\n\nPlot (may contain spoilers): \nThere are a man and a woman who look at the same thing at the same time in different years. A woman who lives in 1979 is So-eun, studying English literature at a university, and she is happy, enjoying one-sided secret love for someone. Her intimate friend, Seon-mi, always with her, sharing everything with her. One day, she accidently finds a used radio on the street. That night, when the moon is about to be eclipsed, she hears a strange man&amp;#039;s deem voice from the radio. His name is In, studying Creative Advertising at the same university with So-eun. She makes an appointment to meet him in front of the clock tower at the school. Ji-in, a man who lives in 2000 is crazy about amateur radio communications. He is a sophomore majoring in Creative Advertising. He doesn&amp;#039;t pay attention to his girl friend, Hyeon-ji, although her heart is fully occupied by him. One day he receives a message from a woman, So-eun, who is a student of the same university. He makes an appointment to meet her in front of the clock tower at the school. So-eun is waiting for him in the campus where the clear sky is filled with tear gas. She is still waiting for him, standing in front of the clock tower and watching the the demonstration led by students. The clock tower was under construction. But, he doesn&amp;#039;t show up until two hours are passed. And after a few hours later, he is waiting for So-eun in the rain in front of the clock tower. The clock tower is completed. What has happened to them? Both of them are very angry with the appointment. However, they later find out the reason why they could not meet each other then. They are living in 21 years of time difference. Same feeling - After then, mysterious contacts are continued between them through wireless communications. They talk to each other about their individual stories: secret love and friendships, the world they are belonged and people who always live enthusiastically with constant love in their hearts. By sharing these stories of life and love, they become one heart and their love blossoms. However, different destinies are waiting ahead of them. Can they conquer the time difference between 1979 and 2000 to meet each other?\n\n\n\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.","torrent":{"xt":"urn:btih:05708be2fbcd703065acb0bcb174948c395dc07d","amp;dn":"Ditto.DVDRip.DivX-MOJiS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05708be2fbcd703065acb0bcb174948c395dc07d","infoHashBuffer":{"type":"Buffer","data":[5,112,139,226,251,205,112,48,101,172,176,188,177,116,148,140,57,93,192,125]},"announce":[],"urlList":[]}}