{"title":"DVD2oneX 2.0 + SN","uid":3407181,"size":954215,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:0634a917b80a896cd26886cba28ecdcf8531d321&amp;dn=DVD2oneX+2.0+%2B+SN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Trane_","files":1,"time":1131511044,"description":"DVD2oneX 2.0\t\n\nby: Erwin van den Berg\n    Post your quick review of DVD2oneX. \n   Add DVD2oneX to your Watch List (member feature)\n   Email me when DVD2oneX is updated (member feature)\n\nDVD2oneX can make movie-only and full disk copies for personal use on a single DVD-Recordable. Features include:\n\nWorld's fastest video compression engine. Process a movie to fit on a single recordable in a matter of 15 to 30 minutes (depending on the speed of your computer).\nMakes movies-only copies. Why waste space and image quality on unnecessary intros, menus and language tracks?\nMakes also full disk copies. For those who want to keep those fancy menus and intros.\nWritten from scratch, it's not based on any old code, libraries or existing opensource projects.\nTime critical parts written in assembly, for the highest possible speed.\nBurn the movie with your favorite recording software.\nWhat's New:\nVersion 2.0:\n\nCompletely new user interface.\nBased on our own newly developed cross-platform GUI library.\nInterface and usage of DVD2one2 is the same on both PC and Mac OS-X.\nRelease of future updates will be synchronous for both platforms.\nEngine completely rewritten for multi-processor support.\nFuture ready for upcoming dual-processor cores.\nAdvanced grid processing possibility.\nCompression engine further improved.\nChoose 'best quality' mode for best possible image quality while retaining highest possible speed.\nChoose 'fast' mode for fastest possible processing.\nBuiltin imaging and burning support.\nNo need for expensive 3rd party burning tools.\nChoose between output as fileset, image file or burning to dvd-writer.\nBitrate and channel configuration of audiotracks is now read from the stream.\nSize of audiotrack is now calculated.\nSize and needed compression of video is now calculated.\nBonus: Audio Remaster functionality added to DVD2one2.\nImproved remaster engine: upto 3 times as fast and improved sound quality.\nSSE support on Intel and Alti-Vec support on PPC G4 and G5.\nNew licensing model.\nLicense valid for one user OR one computer.\nOne user: If you are the only user, you are allowed to use the license on all computers you own (both PC and Mac).\nOne computer: If more people are using the license, then you are only allowed to use it on 1 computer.\nRequirements:\nMac OS X 10.4 or later.","torrent":{"xt":"urn:btih:0634a917b80a896cd26886cba28ecdcf8531d321","amp;dn":"DVD2oneX+2.0+%2B+SN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0634a917b80a896cd26886cba28ecdcf8531d321","infoHashBuffer":{"type":"Buffer","data":[6,52,169,23,184,10,137,108,210,104,134,203,162,142,205,207,133,49,211,33]},"announce":[],"urlList":[]}}