{"title":"Headshot - Mr President","uid":3374769,"size":42996612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:07779318ecaf11f60b11f17771889d8eac039307&amp;dn=Headshot+-+Mr+President&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djchronic","files":1,"time":1125007369,"description":"Check out www.head-shot.biz for more information. Please donate \nor buy our music. Help get us spotted in the media. We have the \npotential to become very big as a band, but the music industry is to \nafraid to let us play any gigs any where anymore or be on the radio. \nWe have played for Amnesty International and are greatful to play \nat any protest rally or gig agianst Bush and his thugs and the \ncorporations, secret societies who are responsible for the current \nevil in this world!\n\nWe are the orginal Headshot band in Holland/The Netherlands. There are other bands called Headshot, but some have used our logos and ideas. We do need legal advise how we can stop them using our logos for themselves, we have not yert have the time to get around at finishing that job.\n\n We are being attacked by The Illuminati who wants us to shut up \nso that we will be unable to eduacate the youth about standing  up \nand fighting for their right! Power to the people!\n\nIf you have watched our videos, please send the video &quot;Mr \nPresident&quot; to George Bush. The song is for him, he should be very \npleased once the video will make it to the mainstream press.\n\nDj Chronic is the man who is writing a book called &quot;The \nGatekeepers&quot;. It will be released later this year. The book is an \nexperimental fact/fiction book. In the book there are true things \nwritten about his life e.g.: \n- his mother met Lee Oswald on a boat to America before he was \nfamous. Lee Oswald was innocent, he was a patsie! \n- his mother's friend and her son where neighbours with Bin Laden \nback in 1991 in Sudan.\n- he had many contacts with people in the intelligence, terrorists \nand mafia.\n- he knew 911 was going to happen through his instinct (Spiritual) \nand intelligence (Facts) \n- he has a planned meeting with the top of The Illuminati next year \nin 2006. (They want to offer him something that would be hard to \nrefuse. He knows he will not take the offer because he has taken \nthe side of The Divine Presence in The Universe. He believes \nsomething big is going to happen in 2012 just like many prophecies \npredict. www.mayanmajix.com\n- he has contact with many spirits and entities from other \ndimensions.\n\n-----------------------------------------------------------------------------\n\nInformation about torrent:\n\nTime: 4.58\nNumber of files: 1\nVideo codec: wmv\nAudio codec: wmv\nResolution: 480 x 360\nRipper/Encoder: Sorenson\nSource: DVD","torrent":{"xt":"urn:btih:07779318ecaf11f60b11f17771889d8eac039307","amp;dn":"Headshot+-+Mr+President","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07779318ecaf11f60b11f17771889d8eac039307","infoHashBuffer":{"type":"Buffer","data":[7,119,147,24,236,175,17,246,11,17,241,119,113,136,157,142,172,3,147,7]},"announce":[],"urlList":[]}}