{"title":"Finn Brothers - Everyone is Here","uid":3296550,"size":46567874,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:07db57bc8d4399e3b0c078dac963508e4a511e55&amp;dn=Finn+Brothers+-+Everyone+is+Here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KingStar","files":18,"time":1109676245,"description":"Ever since the demise of New Zealand popsmiths Crowded House back in the late '90s, brothers Neil and Tim Finn have been content to plough their furrow far from pop's bustling farmstead. Everyone Is Here, the pair's second full-lengther, lacks the full production and grand, Beatlesesque melodic ambitions that saw songs like &quot;Weather With You&quot; and &quot;Fall At Your Feet&quot; become transatlantic radio hits--but it replaces such scope with a smudged, intimate acoustic style that suits Neil and Tim's songwriting talents almost as neatly. The album's finest moments are mostly placed towards the top end: &quot;Luckiest Man Alive&quot; is the sort of conscious rock gospel that Stereophonics' Kelly Jones would kill to be able to write, while &quot;Anything Can Happen&quot;--a billowing, U2-style epic of scintillating guitar and cavernous drum-crashes is seemingly placed to prove that not all is trad chez Finn. As an album, it probably won't spawn any MTV-hogging video classics--certainly, that was never the intention--but Finn fans in search of a mellow listen should find Everyone Is Here hits all the right buttons. --Louis Pattison","torrent":{"xt":"urn:btih:07db57bc8d4399e3b0c078dac963508e4a511e55","amp;dn":"Finn+Brothers+-+Everyone+is+Here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07db57bc8d4399e3b0c078dac963508e4a511e55","infoHashBuffer":{"type":"Buffer","data":[7,219,87,188,141,67,153,227,176,192,120,218,201,99,80,142,74,81,30,85]},"announce":[],"urlList":[]}}