{"title":"Pearl Jam - 09.02.2005 - Vancouver","uid":3380010,"size":247649412,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0859d604aa1a7212ddca8ff9d4df153b24a28653&amp;dn=Pearl+Jam+-+09.02.2005+-+Vancouver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drunkcase","files":46,"time":1126052283,"description":"official bootleg #2\n\n09/02/05 - General Motors Place, Vancouver, B.C., Canada\nset:\n\n1 Release\n2 Go\n3 Animal\n4 Save You\n5 Given to Fly\n6 Corduroy\n7 Love Boat Captain\n8 Even Flow\n9 Better Man\n10 1/2 Full\n11 Daughter/(W.M.A.)\n12 Wishlist\n13 Lukin, Grievance\n14 Immortality\n15 Nothingman\n16 Down\n17 Do The Evolution\n18 Blood / (Atomic Dog)\n19 Footsteps\n20 Elderly Woman...\n21 U\n22 Alive\n23 Encore Break\n24 Bee Girl\n25 Black, Porch\n26 I Believe in Miracles\n27 Baba O'Riley\n28 Yellow Ledbetter\n\nTFT Notes: During the Supersuckers set, Ed came out in the silver Bushleaguer suit and a white wrestling mask with silver eyeholes and mouth (same used in Mexico '03) and performed X's &quot;Poor Girl&quot; with the band. The costumed Ed mundanely came out, sang the song, bowed with the band and exited the stage. Taking the stage at 8:52 PM, all the seats in the arena were filled in the side and rear stage of the venue (unlike Missoula and the Gorge show), no backdrop. In addition to Jeff's bass amps being painted in large letters spelling out &quot;BASS&quot;, he has an American flag painted with a large glow-in-the-dark skull in the area where the stars are. Ed broke out a mirror during &quot;1/2 Full&quot;, first panning slowly across the crowd then quickly flashing it in circles like a siren. &quot;Love Boat Captain&quot; now starts with a &quot;funkier&quot; guitar intro. &quot;Daughter&quot; included a &quot;W.M.A.&quot; tag followed by a shout out soon-to-be-born boy named Wolfgang, so that he could feel the &quot;vibrations&quot; through his mother attending the show. With the disco ball returning during the solo, &quot;Wishlist&quot; included a verse at the end:\n\n  &quot;I wish I came from a country that never went to war, I wish I came from a country that took care of its poor, Maybe someday that will change, In the place from where we came, In the meantime, thanks for the example&quot;\n\nDuring the &quot;Blood&quot; breakdown, Ed sang the &quot;Bow-wow-wow yippee-yo yippee-yay...&quot; from George Clinton's &quot;Atomic Dog&quot;. Ed had lyric sheets for both &quot;Blood&quot; and &quot;U&quot;, with &quot;U&quot;'s written as &quot;YOU&quot; across the top. &quot;Black&quot; included a vocal experiment where Ed asked the crowd to whistle the &quot;do-do-do-do&quot;s at the end instead of singing. When the whistling became piercing Ed said &quot;Not that loud, that's feedback!&quot;. &quot;Porch&quot;'s jam featured Ed and Mike standing on Matt's drum riser playing to the rear, Jeff in another corner. Ed prefaced &quot;I Believe in Miracles&quot; with &quot;This is a song by the greatest rock band in the world&quot;. Linda Ramone was in attendance at the show. Ed threw out six tambourines during Baba O'Riley, the last going to a fan in a Johnny Ramone T-Shirt. Jeff spun in circles, putting his index finger on the top of his head mimicking a spinning ballerina during the crescendo at the end of &quot;Baba O'Riley&quot;.\n\nenjoy!\n\nThese files were downloaded from oinks pink palace... enjoy!","torrent":{"xt":"urn:btih:0859d604aa1a7212ddca8ff9d4df153b24a28653","amp;dn":"Pearl+Jam+-+09.02.2005+-+Vancouver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0859d604aa1a7212ddca8ff9d4df153b24a28653","infoHashBuffer":{"type":"Buffer","data":[8,89,214,4,170,26,114,18,221,202,143,249,212,223,21,59,36,162,134,83]},"announce":[],"urlList":[]}}