{"title":"Chino, CA cop shooting mp airman KTLA-TV","uid":3438614,"size":51249360,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:091bd9e605325ab56697581669d2bf7483087883&amp;dn=Chino%2C+CA+cop+shooting+mp+airman+KTLA-TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oq242","files":3,"time":1138782031,"description":"two clips from KTLA-TV regarding the cop shooting an air force airman in Chino, CA\n\ni got these from a posting on broadband reports.\n\njudge for yourself\n\n\n---\n &lt;a href=&quot;\nhttp://www.newsday.com/news/nationworld/wire/sns-ap-airman-shooting,0,2202281.story?coll=sns-ap-nationworld-headlines&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.newsday.com/news/nationworld/wire/sns-ap-airman-shooting,0,2202281.story?coll=sns-ap-nationworld-headlines&lt;/a&gt;\n\nVideo Shows Officer Shooting Airman\n\nBy JEREMIAH MARQUEZ\nAssociated Press Writer\n\nJanuary 31, 2006, 10:24 PM EST\n\n\nCHINO, Calif. -- A videotape released Tuesday shows a sheriff&amp;#039;s deputy \nshooting an unarmed Air Force policeman who recently returned from Iraq as he \nappeared to obey an order to get up off the ground. \n\nKTLA-TV broadcast a 40-second clip it said came from a Chino resident who \nvideotaped Sunday night&amp;#039;s shooting, which followed a 100 mph car chase. \n\n \nSenior Airman Elio Carrion, 21, was listed in good condition at Arrowhead \nRegional Medical Center in Colton. He was shot three times in the chest, ribs \nand leg, his father-in-law, Ernesto Paz, told KTLA-TV. \n\nState and federal investigators are reviewing the case, officials said. \n\nCarrion was a passenger in a Corvette that crashed following a brief chase, \nauthorities said. \n\nAmateur photographer Jose Luis Valdez told The Associated Press that he made \nthe video after the car crashed into the wall in front of his home. KTLA aired \nthe videotape early Tuesday, then distributed it later in the day. \n\nThe dark, grainy picture shows Carrion lying on the ground next to the car, \ntalking to a silhouetted officer who is pointing a gun at him. Carrion supports\nhimself on one arm and his face is brightly lit by the officer&amp;#039;s flashlight. \n\nCarrion is heard telling the officer he is unarmed and is in the military. \n\nAt one point, a voice is heard saying several times: &quot;Get up.&quot; \n\nCarrion says: &quot;I&amp;#039;m gonna get up.&quot; As he rises, at least four shots are fired \nand Carrion collapses, crying out in pain. \n\n&quot;Shots fired! Shots fired!&quot; someone shouts. \n\nIn a telephone interview conducted in Spanish, Valdez said after the shooting, \nCarrion asks the deputy, &quot;Why did you shoot me if you told me to stand up?&quot; \nThat alleged exchange cannot be heard on the video. \n\nThe deputy, whose name was not released, was placed on paid administrative \nleave, a routine procedure in officer-involved shootings. \n\nCarrion was not charged with a crime, although the incident remained under \ninvestigation, according to sheriff&amp;#039;s spokeswoman Robin Haynal. \n\nThe driver of the Corvette, identified by authorities as Luis Fernando \nEscobedo, 21, was arrested for investigation of felony evading. \n\nCarrion and Escobedo had left a party at the home of Carrion&amp;#039;s parents to \ndrive to a store, said the airman&amp;#039;s wife, Mariela. \n\nA woman who answered the telephone at the Montclair home of Carrion&amp;#039;s parents \nsaid they were headed to the hospital and nobody at the residence wanted to \ntalk. \n\nAn Air Force spokesman, Lt. Frank Hartnett, said Carrion is a security officer \nat Barksdale Air Force Base in Shreveport, La. Carrion joined the Air Force in \nJanuary 2003 and recently returned from a six-month tour in Iraq, Hartnett \nsaid. \n\nChino is about 40 miles east of Los Angeles. \n\n* __ \n\nAssociated Press Writer Ian Gregor in Los Angeles contributed to this report.","torrent":{"xt":"urn:btih:091bd9e605325ab56697581669d2bf7483087883","amp;dn":"Chino%2C+CA+cop+shooting+mp+airman+KTLA-TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091bd9e605325ab56697581669d2bf7483087883","infoHashBuffer":{"type":"Buffer","data":[9,27,217,230,5,50,90,181,102,151,88,22,105,210,191,116,131,8,120,131]},"announce":[],"urlList":[]}}