{"title":"Charlie's Family [unreleased workprint] aka. The Manson Family","uid":3384180,"size":713425192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c515e7653be0388233e2556a8a11283b3ff8870&amp;dn=Charlie%5C%27s+Family+%5Bunreleased+workprint%5D+aka.+The+Manson+Family&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"d-pad","files":1,"time":1126928418,"description":"Charlie's Family [unreleased workprint] (1995)\ndirected by Jim van Bebber\n\nproduction on this film started back in the late 80's shortly after JVB's debut &quot;deadbeat at dawn&quot; was released. for years it seemed that all that had been shot was the 4 minutes or so that made up the trailer... then came a 10 minute showreel with 4 or 5 completed scenes... then, more than half a decade after production began, this workprint of the &quot;finished movie&quot; did a few festivals under the promise that it was being picked up by a distributor and was going to get a worldwide cinema release... almost a decade later it did! re-titled &quot;the manson family&quot; and slightly more polished than this version, the film had a limited theatrical release and was released on dvd earlier this year.\npersonally i prefer this version, not because there are any major differences as such, it's just that this is the version i'd been watching for the last 10 years, the cut i'm used to ...and i'm still a bit upset when i see the final cut missing the rolling stones track (due to licensing) over the hinman scene - it just works so much better with jumping jack flash playing while sadie is dancing and bobby is extorting hinman!\nso here it is, the quality isn't great (2nd-3rd gen vhs dupe ripped to avi), some of the edits are rough (well, it is a WORKPRINT!), there are moments where it looks like whole shots are missing... but somehow this all adds to the experience that is &quot;CHARLIE'S FAMILY&quot;, making it feel grittier, more realistic...\nthe best movie on manson to date.\n\nwhere were you in '69?","torrent":{"xt":"urn:btih:0c515e7653be0388233e2556a8a11283b3ff8870","amp;dn":"Charlie%5C%27s+Family+%5Bunreleased+workprint%5D+aka.+The+Manson+Family","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c515e7653be0388233e2556a8a11283b3ff8870","infoHashBuffer":{"type":"Buffer","data":[12,81,94,118,83,190,3,136,35,62,37,86,168,161,18,131,179,255,136,112]},"announce":[],"urlList":[]}}