{"title":"Do As I Say (Not As I Do) Profiles in Liberal Hypocrisy WMA form","uid":3440512,"size":133593576,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0d092ae6c33a432a39579fbb86c574c51b3d29e0&amp;dn=Do+As+I+Say+%28Not+As+I+Do%29+Profiles+in+Liberal+Hypocrisy+WMA+form&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spaminator","files":12,"time":1139152313,"description":"I ripped this into a high-quality but much smaller format.\n\n\nAudio Book. WMA Format Variable Bit Rate\n\nSplit into 12 segments\nRunning Time: 6hr 15min\n\nDo As I Say (Not As I Do) : Profiles in Liberal Hypocrisy\n\n&quot;Peter Schweizer&amp;#039;s Do As I Say (Not As I Do) is an entertaining exposure of the hypocrisy among some prominent liberals. In a series of 11 profiles on leftist icons from Noam Chomsky and Al Franken to Hillary Clinton and Ted Kennedy, Schweizer reveals that the most vocal liberals do not practice what they preach.&quot;\n\n\nMembers of the liberal/left exude an air of moral certitude. They pride themselves on being committed and selfless and seem particularly confident of the purity of their motives and the evil nature of their opponents. To correct economic and social injustice, liberals support a whole litany of policies and principles: progressive taxes, affirmative action, greater regulation of corporations, raising the inheritance tax, strict environmental regulations, children&amp;#039;s rights, consumer rights, and more. But do they actually live by these beliefs? Peter Schweizer decided to investigate in depth the private lives of prominent liberals. What he found was a long list of contradictions. Schweizer&amp;#039;s conclusion is simple: liberalism in the end forces its adherents to become hypocrites. They adopt one pose in public, but when it comes to what matters most in their own lives, they jettison their liberal principles and adopt conservative ones. Schweizer&amp;#039;s book thus exposes the contradiction at the core of liberalism: If these ideas don&amp;#039;t work for the very individuals who promote them, how can they work for the country?","torrent":{"xt":"urn:btih:0d092ae6c33a432a39579fbb86c574c51b3d29e0","amp;dn":"Do+As+I+Say+%28Not+As+I+Do%29+Profiles+in+Liberal+Hypocrisy+WMA+form","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d092ae6c33a432a39579fbb86c574c51b3d29e0","infoHashBuffer":{"type":"Buffer","data":[13,9,42,230,195,58,67,42,57,87,159,187,134,197,116,197,27,61,41,224]},"announce":[],"urlList":[]}}