{"title":"Kaspersky Antivirus Professional v5.0.388","uid":3379235,"size":13296317,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0dad9b42b6fa2793af3acdd6a37805adf099e923&amp;dn=Kaspersky+Antivirus+Professional+v5.0.388&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jorsantatino","files":1,"time":1125889421,"description":"Premium antivirus protection for professional individual users and home offices. The program includes a range of configuration options to optimise depth of scanning: \n\n\nmonitors all sources of potential virus infection \nintegrated OfficeGuard? technology protects MS Office applications \nsupports a broad range of mail programs \nrestoration of data in files infected by viruses \nimproved management tools and detailed notifications \nAntivirus database updates every hour, round-the-clock \n\nReliable protection against infection \nKaspersky&amp;reg; Anti-Virus Personal Pro constantly monitors all sources of possible virus infections: email, the Internet, CDs and more. Personal Pro also protects all parts of your PC: system memory, boot sector, files, mail databases and etc. It also contains unique technology for protecting your MS Office documents. \n\nScanning archived and compressed files \nViruses often hide in archived and compressed files, where most antivirus solutions have trouble finding them. Not Kaspersky Anti-Virus Personal Pro. This solution scans over 900 types of archived and compressed files and even disinfects ZIP files. \n\nReal-time protection \nKaspersky Anti-Virus provides real-time virus scans, checking files each time they are created, opened or copied. The antivirus monitor imbedded deeply into the operating system checks all file operations instantaneously. Kaspersky Personal Pro monitors all local drives automatically or according to user-defined rules. \n\nContinuous email filtration \nKaspersky Anti-Virus scans all emails for possible infection and detects all types of malware. The solution supports a broad range of mail databases: Microsoft Outlook, Microsoft Outlook Express, The Bat!, Netscape Messenger, Opera mail client and IncrediMail Kaspersky Anti-Virus successfully protects mail traffic and deletes viruses from MS Outlook and MS Outlook Express email databases. The virus scanner checks every layer, including all archived and compressed files, of every email, incoming and outgoing. \n\nPro-active protection from macro viruses \nKaspersky Anti-Virus ensures total control over macros in all MS Office documents and halts all suspicious activity. This means that you are guaranteed almost total protection from macro-viruses, including unknown ones. Your MS Office documents are safe! \n\nProductivity and reliability \nKaspersky Anti-Virus boasts state-of-the-art technology that increases program speed significantly. iChecker? technology makes Personal Pro appreciably more reliable and dependable than competing products. \n\nData integrity \nPersonal Pro also includes an Inspector module that traces all changes occurring on your PC, such as: altering, deleting or creating files. All of these activities can be signs of a virus infection. By checking only modified or new files, the solution increases both speed and effectiveness. If Personal Pro detects any viruses, you are able to restore the file to its original state and delete the infected object. \n\nProtection against new viruses \nExperts at Kaspersky Labs proudly present our second-generation heuristic virus analyzer that protects you from unknown viruses. This intricate and advanced technology detects almost 100% of previously undocumented viruses. \n\nQuarantine for infected objects \nKaspersky Anti-Virus isolates all infected and suspicious objects in a special folder, where you can safely examine them at your leisure. Your PC is safe, while you are free to continue your own work, instead of worrying about malicious code. \n\nStopping script viruses \nClassic antivirus solutions are incapable of stopping script viruses from infecting RAM. Kaspersky Anti-Virus can, due to the built-in Script Checker. Script Checker serves as a filter between scripts and the corresponding application, which means all scripts run on your PC are scanned before being executed \n\n\n\n\nEnhancements: \n\n1. Error that caused drive types to display incorrectly under Korean version of Microsoft Windows 98 has been eliminated \n\n2. Error that caused application to freeze under Korean version of Microsoft Windows 98 has been eliminated \n\n3. Error that caused the application (anti-virus database and application modules) update from the Kaspersky Lab's updates servers associated with a different geographic region has been eliminated \n\n4. Error that sometimes prevented deletion of messages on the mail server when using POP3 protocol has been eliminated \n","torrent":{"xt":"urn:btih:0dad9b42b6fa2793af3acdd6a37805adf099e923","amp;dn":"Kaspersky+Antivirus+Professional+v5.0.388","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dad9b42b6fa2793af3acdd6a37805adf099e923","infoHashBuffer":{"type":"Buffer","data":[13,173,155,66,182,250,39,147,175,58,205,214,163,120,5,173,240,153,233,35]},"announce":[],"urlList":[]}}