{"title":"CalliGrapher v7.5 rar for PocketPC- n00bs","uid":3310839,"size":6038309,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0e5549953e55fcd6a826370cb328d2dd5231e336&amp;dn=CalliGrapher+v7.5+rar+for+PocketPC-+n00bs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ultrasoul","files":1,"time":1112496565,"description":"CalliGrapher is an award winning (awards) natural handwriting recognition software that supports all handwriting styles - cursive, PRINT or MIXed. In addition to handwriting recognition, CalliGrapher offers PenCommander, an easy-to-use PC navigation tool; ink color selection and customizable ink width; and a &amp;quot;Quick Correct&amp;quot; window for fast correction as the user writes.\n\nCalliGrapher analyzes pen strokes written in any application window, converts the pen strokes into text and sends the recognized text to a target application. Employing advanced fuzzy logic and neural net techniques; CalliGrapher recognizes arbitrary alphanumeric strings as well as words from its integrated dictionary.\n\nCalliGrapher also offers a comprehensive spell checker for all applications on your mobile device. The new version also includes a new utility - PenCommander - that allows users to create and execute command scripts by simply writing a word command and drawing a circle around it. CalliGrapher gives you the freedom to enter information quickly and efficiently into your mobile device. You can find the detailed information about CalliGrapher in the User's Guide (PDF).","torrent":{"xt":"urn:btih:0e5549953e55fcd6a826370cb328d2dd5231e336","amp;dn":"CalliGrapher+v7.5+rar+for+PocketPC-+n00bs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e5549953e55fcd6a826370cb328d2dd5231e336","infoHashBuffer":{"type":"Buffer","data":[14,85,73,149,62,85,252,214,168,38,55,12,179,40,210,221,82,49,227,54]},"announce":[],"urlList":[]}}