{"title":"Steve Kuhn [composed and conducted by gary mcfarland] - The Octo","uid":3280201,"size":48585371,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e657c2d3ba936d7360ba2b6c0e4042f6b7df5e0&amp;dn=Steve+Kuhn+%5Bcomposed+and+conducted+by+gary+mcfarland%5D+-+The+Octo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"sirithanan","files":6,"time":1106376228,"description":"October Suite: Three Compositions of Gary McFarland\nRecording Date\nOct 14, 1966-Nov 1, 1966\nLabel\nImpulse!\nStyles\n    * Jazz\n    * Post-Bop\n\nMP3, LAME 3.93, VBR 190, 46 MB\nNumber 7 on the All About Jazz Best Reissues of 2003 list\n\nComposer and arranger Gary McFarland was well-known in the 1960s for his film-scoring abilities and his charting skills with mid-sized bands. McFarland was also, however, a jazz fan, and particularly one of scalar pianist Steve Kuhn. This project features Kuhn in the center of a program made up entirely of McFarland compositions, all but two of which were written specifically for the album. Recorded in 1966, it is an anomaly in the Impulse catalog of the time in that it did not pursue the free jazz realms with the vengeance that most of the label's other acts did during that year. It is also significant that it caught the attention of a young Manfred Eicher, who later signed Kuhn to his ECM label based on the strengths of this recording. Like Keith Jarrett, Kuhn is in the pointillist school of jazz pianists of the era. Unlike Jarrett, Kuhn does not consider force in his attack as necessary as his labelmate does. Instrumentally, Kuhn's customary trio situation -- which is dutifully performed with zeal by Ron Carter and drummer Marty Morell -- is augmented with a string quartet on half the record, and with a wind trio with harp on the other half. The tracks on Side One are, in some ways, less revolutionary yet more fulfilling, because Kuhn is clearly at home with the sonorities afforded by the strings. They don't swing, even on &amp;quot;One I Could Have Loved,&amp;quot; from the film 13, or &amp;quot;St. Tropez Shuttle,&amp;quot; a strangely metered bossa tune (in three/four instead of four/four). Kuhn's cautious, contemplative improvising concerns itself with scalar explorations of melody, color, and harmony, rather than rhythm or modal considerations. His touch is light and airy and therefore most pronouncedly visible against the strings. The interplay between Carter and Morell is almost instinctual; they couldn't have moved any closer together on this set if the charts had been written for them -- and they were not. With the wind trio and harp, Kuhn's approach is more physical, but nonetheless, he strives to create a palette for the very instruments that are trying to create one for him. There is some tension in this approach, but it works to the record's advantage. In sum, October Suite was an experiment that worked beautifully, even if it was not acknowledged as being one of the more subtly brilliant albums of its day, though it most certainly stands the test of time that way.\nTracks\n\t  \t1 \t\tRemember When \tMcFarland \t \n  \t  \t2 \t\tSt. Tropez Shuffle \t\t \n  \t  \t3 \t\tOne I Could Have Loved (Theme from the Motion Picture 13) \tMcFarland \t4:52\n  \t  \t4 \t\tTraffic Patterns \tMcFarland \t6:23\n  \t  \t5 \tChildhood Dreams \tMcFarland \t6:34\n  \t  \t6 \tOpen Highway \tMcFarland \t6:03\n\n\n\t\nDon Ashworth \tWoodwind\nJack Bradley \tPhotography\nAl Brown \tCello\nAlfred Brown \tCello\nRon Carter \tBass\nIsador Cohen \tViolin\nPaul Elmore \tDigital Transfers\nJoseph Firrantello \tWoodwind\nRobert Flynn \tCover Design\nSuha Gur \tMastering\nCorky Hale \tHarp\nNat Hentoff \tLiner Notes\nIrving Horowitz \tWoodwind\nHollis King \tArt Direction\nBryan Koniarz \tProducer\nSteve Kuhn \tPiano\nJoe Lebow \tLiner Design\nCharles McCracken \tViola\nGary McFarland \tArranger, Conductor, Orchestra\nMarty Morell \tDrums\nMatthew Raimondi \tViolin\nPhil Ramone \tEngineer\nGerald Sanfino \tWoodwind\nMark Smith \tProduction Assistant\nSherniece Smith \tArt Producer\nCharles Stewart \tCover Photo\nBob Thiele \tProducer","torrent":{"xt":"urn:btih:0e657c2d3ba936d7360ba2b6c0e4042f6b7df5e0","amp;dn":"Steve+Kuhn+%5Bcomposed+and+conducted+by+gary+mcfarland%5D+-+The+Octo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e657c2d3ba936d7360ba2b6c0e4042f6b7df5e0","infoHashBuffer":{"type":"Buffer","data":[14,101,124,45,59,169,54,215,54,11,162,182,192,228,4,47,107,125,245,224]},"announce":[],"urlList":[]}}