{"title":"Ultra Vixen 3D game","uid":3303911,"size":43210003,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0ee4efa186fa8e817b33d77cee0a3d913549b571&amp;dn=Ultra+Vixen+3D+game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"malikali","files":1,"time":1111278707,"description":"Ultra Vixen from Pixis\nAuthor: Hentai Helper\nUpdated: 1999-12-17\n\n\nThis is a hint/walkthrough file for the adult sort-of-anime game \n&amp;quot;Ultra Vixen&amp;quot; from Pixis. However you got it, under Windows 95 \nyou run UVIXEN.EXE or it starts automatically from the CD, and \nunder Windows 3.x you run UV31.EXE, and I guess you go hungry if \nyou are still using DOS.\n\nYou can usually immediately exit the game by pressing &amp;quot;Esc&amp;quot;. The \ngame reccomends that you use 256 colors instead of 16-bit or \nhigher video modes. I didn't notice any problems under 16-bit \nmode, but your mileage may vary. Sound and music support was \nautomatic. Most of the game's music is in a large AIF file. To \nexit the starting sequence, left click once on the left &amp;quot;margin&amp;quot;. \nYou will go to the main menu screen then, or if you wait.\n\nMain Menu Screen:\ntop right corner red button (green when mouse on it) - show \n   starting sequence, once again left click on left margin to \n   stop\nupper left red button - no effect!\nupper left green button below it - no effect!\nI'll skip all of the other buttons and tell you that the HELP \n   button is the middle one on the bottom (? inside it). That \n   will tell what almost all of the other buttons on the main \n   menu screen, and the game play screens, look like and what \n   they do.\n\nThe HIDE button pops up a boss screen, left click to resume game. \nOr press &amp;quot;Esc&amp;quot; to exit the game and the boss screen.\n\nIn the HELP screen, press the far left green left arrow to go \nback to the main menu screen. Press one of the red arrows to go \nforward or back a page - there are 4 pages to the help.\n\nThe Photo Gallery starts off with some pictures. Press the \nforward jump or exit arrows to leave.\n\nThe button at the bottom of the &amp;quot;console&amp;quot; that looks like a dot \nin a circle is the sound control. In the Photo Gallery it is \neither sound on or sound off - which should be obvious unless \nsomething outside the game is low or off. In the game it has 3 \nlevels: music and voice, music without voice, no music and no \nvoice. This one is a little tough to figure out until you \nrealize that the voice for the cartoon dialogue balloons is \nplayed only once when you first see the screen.\nIf you can't hear a click noise when you press the button, then \nyour sound is turned low or off outside the game.\n\nTo start playing the game, click on the girl face button at the \nmain menu screen. First time through, you get to see an \ninteresting intro that sets the stage. Sort of Project-Ako meets \nthe Overfiend! It's a little wrong though - looks like Heather \ngets pulled in with Ariel, but the game only talks about Zig, and \nnever shows him after the bit at the beginning with the fast car. \nNever mind... This is the first game I've ever seen that even \nattempts to explain the torture gear in the various sex scenes in \na realistic manner.\n\nFirst Scene (Belsen):\nStage One\nNotice the white circle up near the upper right corner? That's \nthe score, currently 0. Not figuring this out messed up my first \nfew minutes bigtime. Do good things, score goes up, and green bar \ngets bigger until it overflows yadda yadda. Do bad things, red \nbar below gets bigger, when it overflows you lose and get sent \nback to start.\nTo enter a zoom-in view with tools to play with, click when the \nmouse pointer turns into a pointing finger rather than a hand. I \nknow, it does that down in the lower right corner so you can see \nwhat you're clicking on too. To exit a zoomed-in view, click on \nthe right side button on the console.\nIn the following instructions, if #1 turns on red things, go try \n#2, and if all else fails try #3 if there is one. Also, stop \nmoving the mouse when you hear a giggle noise or the green bar \noverflows. If you keep doing that, the score will go down, and \neventually red things appear.\n\n1. You'll find you can't do much if you go after her butt. Ignore \nthat view for now. Make sure she's right side up, and click on \nthe pincer things near her tits, either one. Drag the right one \nup and down until the giggle. Ignore the mouth plugger for now. \nNotice how her nipples are connected to her eyelids?\n2. The other thing that gets you points on this stage is the \nblowtorch. Drag the mouse pointer back and forth on the flame to \nraise and lower it. Again, stop when you hear a giggle.\n3. Use the hypodermic once if both the pincers and blowtorch \nlower the score or turn on red things.\n\nStage 2\n#1 is blowtorch again\n2. Click on the mouth plug to get to the vibrating tit covers \nscreen.\nThe covers are optional this time, but the pincers are right out! \nDrag the mouth plug in and out.\n\nStage 3\n1. Click on silver rod thing near bottom center of screen to get \nview of powered pussy pounder and anal probe. Turn on the \npounder, then drag the anal probe in and out (with pounder is 20 \npoints each, but without is only 10 points).\n2. Mouth plug again, but this time use pincers for double points!\n\nScene 2 (Shinjuku Subway)\nStage 1\nJust play with the toys here, although I couldn't do anything \nwith the green circle. Notice that the white feather usually gets \na very short giggle when you use it, not the regular one. The \nonly bad one at this point is the blue dildo, either in pussy or \nmouth. Notice that the hand by itself is a tool. The wand is the \nbest choice usually.\n\nStage 2\nHand alone is good, and not just on tits and pussy. Try the \nelbows.\n\nStage 3\nEither my copy is messed up, or the icons just stopped working \nthe way they used to. Just noticed you can turn her around and \ntry to use a butt plug, but that doesn't work for me. The green \ncircle is a gag for the mouth. The hand on the butt or the butt \nplug is also good at some point in this. I'm starting to think \nthis game doesn't like me using Notepad while I'm playing...\n\nScene 3 (Far Future)\nStage 1\nThe green bar on the left side represents how much time you have \nleft. \n1. Lots of toys all around, the mouth plug is a silver thing just \nto the right of her head. \n2. The pincers are the other thing to try. If they stop working, \ntry something else once, then come back.\n\nStage 2\n1. pincers with hat\n2. tit pans without mouth plug\n\nStage 3\n1. mouth plug without pincers\n2. turn her around, click on power dildo on bottom, slide it in \nand out of mouth.\n\nActually, some of these may differ in your play of the game. \nDon't be afraid to experiment, the worst you can lose is 10 or 20 \npoints and get some red things. I haven't seen a different ending \ndepending on your score. There is probably a cheat in there, but \nI haven't figured it out yet.\n\nIf you let time run out in the last scene, you get a few pictures \nof the Earth blowing up.\n","torrent":{"xt":"urn:btih:0ee4efa186fa8e817b33d77cee0a3d913549b571","amp;dn":"Ultra+Vixen+3D+game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ee4efa186fa8e817b33d77cee0a3d913549b571","infoHashBuffer":{"type":"Buffer","data":[14,228,239,161,134,250,142,129,123,51,215,124,238,10,61,145,53,73,181,113]},"announce":[],"urlList":[]}}