{"title":"XP_PRO_SP2_MAC.iso","uid":3458877,"size":612884480,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f2a52357a0a2f879fdfb88f1868109bc001ad21&amp;dn=XP_PRO_SP2_MAC.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Basketb926","files":1,"time":1142639641,"description":"it&amp;#039;s XP that will run on a mac.  it&amp;#039;s not easy to install, here are the instructions. \n\nThe installation\n====================\n\nThe iMac needs to be repartitioned in order to do this.\nThis procedure requires reformatting the HD. I have not tried\npartition managers but if you&amp;#039;re feeling adventurous you may\ntry one. I do not guarantee results in those cases, though.\n\nBe forewarned: This procedure WILL WIPE YOUR iMAC DISK CLEAN.\n               Backup any files you don&amp;#039;t want to lose.\n\nWhat you&amp;#039;ll need\n----------------\n1. An intel iMac (iiMac henceforth)\n2. The XP CD prepared above.\n\nQuick instructions for those knowing what they&amp;#039;re doing\n-------------------------------------------------------\n1. Partition the disk in two using the OSX CD: FAT and HFS+\n2. Install OSX on the HFS+ partition.\n3. Copy xom.efi (from xom.zip) into the hard disk\n4. cd to the directory where you put xom.efi and type\n   sudo bless --folder . --file xom.efi --setBoot\n5. Reboot, insert the XP CD, select windows using the arrows\n   and wait about 3 minutes\n6. Choose the FAT partition you previously created.\n   (choose, not create! it should prompt for filesystem)\n7. Install. Make sure to remove the CD on subsequent boots,\n   otherwise you&amp;#039;ll start the process over again.\n   Note: The &quot;press any key to boot from CD&quot; prompt doesn&amp;#039;t work yet\n8. Done!\n\nStep-by-step instructions\n-------------------------\n1. Boot iiMac with OSX Install CD\n   - Insert the OSX Installation CD\n   - Turn on the iiMac while pressing the C key.\n   - Don&amp;#039;t release the C key until you see the grey apple logo.\n\n2. Run Disk Utility\n   - Hit Enter on the Language selection dialog\n   - Select from the menu: Utilities-&gt;Disk Utility\n\n3. Create two partitions, preferably of equal size:\n   Partition #1 - Name: xp. Type: MS-DOS\n   Partition #2 - Name: osx. Type: Mac OS extended Journal\n\n   - On the left pane click on the internal hard disk (The first\n     entry usually). Click on the disk entry, not on any subentries\n     it may have.\n   - On the right pane click on the partition button at the top.\n   - From the &quot;Volume Scheme&quot; drop-down select &quot;2 partitions&quot;\n   - Select the first partition on the partition map under the\n     Volume Scheme drop-down:\n     - Enter &quot;xp&quot; on the Name field\n     - Select &quot;MS-DOS File System&quot; from the Format drop-down.\n   - Select the second partition\n     - Enter &quot;osx&quot; on the Name field\n     - Select &quot;Mac OS Extended (Journaled)&quot; from the Format drop-down\n   - Click on the Partition button at the bottom right.\n   - Click &quot;Partition&quot; on the pop-up warning dialog.\n   - You should now see under the disk entry on the left two subentries:\n     &quot;XP&quot; and &quot;osx&quot;\n   - Quit the disk utility by clicking on the Red button at the dialog top left.\n\n4. Proceed to install OSX on the newly created OS X partition.\n\n   - Click Continue on the bottom left of the install dialog.\n   - Click Continue again\n   - Click Agree on the pop-up dialog\n   - Select the osx partition you just created. This partition should have\n     a green arrow.\n   - Click Continue\n   - Click Continue\n   - After a while, the computer reboots\n\n5. Let the computer reboot into OS X and launch a shell window.\n\n   - Once the computer reboots, wait for the movie to end and get through\n     the registration process.\n   - Once you get to the desktop go to &quot;Go -&gt; Utilities -&gt; Terminal&quot;\n\n6. Copy the xom.efi bootloader to the hard disk and bless it.\n\n   - Copy the xom.efi file into your home directory.\n   - In the terminal type:\n     sudo cp xom.efi /System/Library/CoreServices  &lt;-- you will have to enter\n                                                       your password here\n     cd /System/Library/CoreServices\n     sudo bless --folder . --file xom.efi --setBoot\n\n7. Insert the slipstreamed XP CD you built into the iiMac and reboot.\n\n   - To eject any disk inside press the eject key on the top left corner of\n     your keyboard. You can also eject any disk while rebooting by pressing\n     without releasing the F12 key.\n   - Select the Apple menu (top left) and choose &quot;Restart&quot;\n   - Click &quot;Restart&quot;\n\n8. After rebooting, you should see a crystal Apple logo at the center of the\n   screen. Use the arrow keys (up/down) to switch between OS X and Windows.\n   Make sure the slipstreamed Windows XP CD is inside, select Windows and\n   hit Enter.\n\n   - If you forgot to insert the XP CD, you may insert it _before_\n     hitting Enter.\n   - If you left a different CD inside, do the following:\n     - Turn off the computer\n     - Turn it back on _while_pressing_ the F12 key.\n     - Don&amp;#039;t let go of the F12 key until the CD is out.\n     - Insert the XP CD.\n   - Now select Windows and hit Enter if you haven&amp;#039;t done so yet.\n\n   IMPORTANT NOTE: This will launch the XP setup. for about 2 minutes\n                   and a half there will be NO FEEDBACK WHATSOEVER.\n\n9. After about 3 minutes, you will get the partition disk screen.\n   Select the XP partition. This partition should read:\n\n   E: Partition1 (EFI) [FAT32]          200 MB (   196 MB free)\n   C: Partition2  [Unknown]           78160 MB ( 78159 MB free)\n   F: Partition3  [Unknown]           77839 MB ( 77839 MB free)\n\n   Sizes may differ. The important thing is you MUST choose Partition 2.\n\n   ! LEAVE THE FIRST AND THIRD PARTIONS ALONE!!!\n   ! DO NOT REPARTITION THE DISK USING THE WINDOWS INSTALLER!!!!\n\n\n10. The install prompts you for the format type to use: NTFS/FAT Quick/Slow\n    If the partition is too large, only the NTFS Quick/Slow options will be shown.\n    It is VERY IMPORTANT that you get prompted with this step. If you are\n    not prompted for a filesystem to install SOMETHING WENT TERRIBLY WRONG!!!\n    YOUR INSTALL WILL NOT WORK in that case.\n\n11. After rebooting, do the following:\n    - Press F2 to disable CD booting (there&amp;#039;s no feedback, but you can\n      press F2 many times, it doesn&amp;#039;t hurt). Alternatively, eject the XP CD\n      as per step 8.\n    - Choose XP by using the down arrow\n    - Hit enter.\n\n    NOTE: This time the wait is not that long... just sit tight and wait\n          for about 30 secs.\n\n12. The second phase of the XP installer starts. Complete it.\n    After finishing this phase, the installer seems to hang. Simply\n    wait enough to be sure the system is frozen and cycle power.\n    To do this, just keep the power button depressed for about 5 seconds.\n\n13. Restart Windows and finish the installation. Make sure to remove\n    all CDs before choosing Windows.\n\n14. Done.\n","torrent":{"xt":"urn:btih:0f2a52357a0a2f879fdfb88f1868109bc001ad21","amp;dn":"XP_PRO_SP2_MAC.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f2a52357a0a2f879fdfb88f1868109bc001ad21","infoHashBuffer":{"type":"Buffer","data":[15,42,82,53,122,10,47,135,159,223,184,143,24,104,16,155,192,1,173,33]},"announce":[],"urlList":[]}}