{"title":"SHOPAHOLICS_DVDR_LSF","uid":3463366,"size":4259889953,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:110254df50a27a9d70fc246ca99b58f0bc616897&amp;dn=SHOPAHOLICS_DVDR_LSF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yiuloan","files":23,"time":1143576222,"description":"Plot:\n\nWai Ka Fai amuses movie fans with one hilarious Chinese New Year movie every year. After Fantasia and Himmalaya Singh, his latest comedy The Shopaholics, released during Chinese New Year 2006, now comes to DVD. Lau Ching Wan and Cecilia Cheung star as an apparently perfect couple - Fong (Cecilia Cheung) is obsessed with shopping to an extent of carrying heavy debt loads, whereas psychiatrist Dr. Choosey Lau cannot even buy himself a lunch box because of his phobia to make choices. But the presence of two other characters, played by Hong Kong singer Jordon Chan and sexy actress Ella Koon, seems to mess up this perfect balance, and the four together promise an entertaining movie with non-stop jokes for nearly 100 minutes!\n\nWhile Fong and Lau are going out fine, she comes across a penny-pinching tycoon (Jordon Chan) who occasionally switches to a spendthrift. Meanwhile, Lau also meets his ex-girlfriend (Ella Koon) who never gets over her breaking up with him. Their relationships develop into a four-way engagement, and even a joint wedding! With help of a psychologist-cum-shopaholic, played by veteran singer Paula Tsui who hasn&amp;#039;t appeared in movies for years, can they resolve such messy relationships in the end? The Shopaholics is no doubt an extremely entertaining title, but it also invites viewers to rethink romance and materialism - after all it&amp;#039;s shopping that connects and disconnects people in The Shopaholics.\n\n\n IMDB-link......: http://www.imdb.com/title/tt0491002/\n\n Genre............: Comedy\n Source...........: Retail\n DVD Format.......: NTSC\n DVD Size.........: DVD5\n Screen format....: 16:9\n Audio Language...: Cantonese DD5.1/Mandarin DD5.1\n Audio Format.....: DD5.1\n Subtitles......: English and Chinese\n Video..........: [X ] Untouched, intact.                                      \n                                                         \n                 \n","torrent":{"xt":"urn:btih:110254df50a27a9d70fc246ca99b58f0bc616897","amp;dn":"SHOPAHOLICS_DVDR_LSF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"110254df50a27a9d70fc246ca99b58f0bc616897","infoHashBuffer":{"type":"Buffer","data":[17,2,84,223,80,162,122,157,112,252,36,108,169,155,88,240,188,97,104,151]},"announce":[],"urlList":[]}}