{"title":"SmartMovie 2.76 full all series","uid":3395702,"size":4141319,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:11475e43bfb78202a3f5fd36342a794e55bcfc5d&amp;dn=SmartMovie+2.76+full+all+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xisio","files":1,"time":1129155862,"description":"SmartMovie is a video player for your mobile device, with counterpart PC converter utility. With the converter, you may prepare any video clip for playback on your mobile device.\n\nhttp://www.lonelycatgames.com/index.php?chapter=smartmovie\n\nFeatures:\n\n    * Standard AVI format, allowing you to preview converted files on your PC.\n    * Uses downloadable video codecs, allowing you to compress and play back videos in your favorite format.\n    * Player uses the phone screen in portrait or landscape mode, utilizing the full screen size of the device.\n    * Rescaling of video to utilize full-screen area.\n    * PC converter allows you to split video file into multiple segments, so that it fits onto your memory card, if not entire, then cut to more parts - you may watch your favorite video in parts, e.g. while traveling to work/school.\n    * First mobile player which supports subtitles - allowing you to watch movies in different languages.\n    * Friendly PC converter - preview videos on PC, select parts you want to convert, alter quality.\n    * Supports DirectShow codecs, so you may use video codecs downloadable from the internet.\n    * Very fast conversion; on standard PC conversion is 5x faster than video clip playback time. You'll convert entire movie in just a few minutes\n    * Bicubic rescale algorithm shrinks video to small screen size in best possible quality.\n    * Adjustable quality parameters for video and audio streams, allowing tuning target video to your needs.\n    * Customizable video Player (brightness, audio sync, volume, and more).","torrent":{"xt":"urn:btih:11475e43bfb78202a3f5fd36342a794e55bcfc5d","amp;dn":"SmartMovie+2.76+full+all+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11475e43bfb78202a3f5fd36342a794e55bcfc5d","infoHashBuffer":{"type":"Buffer","data":[17,71,94,67,191,183,130,2,163,245,253,54,52,42,121,78,85,188,252,93]},"announce":[],"urlList":[]}}