{"title":"Lost_Highway (xvid110-sickboy88)","uid":3410506,"size":734326818,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11786bf4e725a95c20deec6a24d9cd1e0d153357&amp;dn=Lost_Highway+%28xvid110-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sickboy88","files":2,"time":1132253169,"description":"Lost Highway (1997)\n\nIMDB Link:\n\nhttp://www.imdb.com/title/tt0116922/\n\n----\n\nA David Lynch film...\n\nCan't find anything but a VHS rip? Fear not...here is a DVD rip.\n\nThis was a BITCH to get on DVD.  All I could get my hands on was the canadian version, which is fullscreen, and has a low video bitrate.\n\nI cleaned up the audio, and used a lower bitrate on the video to keep the size down.  The movie is quite lengthy, however it would have been a waste to use a higher bitrate, as the DVD didn't look that great to begin with.  Thus being said, at 600kb/s bitrate, it looks just like the DVD.  Don't believe me?  Go buy the fucker and compare the two.\n\nNo subs on this DVD. :(\n\n----\n\nMini Plot:\n\nFred Madison, a saxophonist, is accused under mysterious circumstances of murdering his wife Renee. On death row, he inexplicably morphs into a young man named Pete Dayton, leading a completely different life. When Pete is released, his and Fred's paths begin to cross in a surreal, suspenseful web of intrigue, orchestrated by a shady gangster boss named Dick Laurent.\n\nor\n\nWhen Fred Madison finds a video tape on his doorstep that shows the interior of his house, he's convinced that someone has broken in and calls the police. Things get really complicated when he finds another videotape showing him killing his wife, and the police arrest him because his wife really was murdered! Then he disappears from the prison and we start watching the life of a young man who works in a garage...\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 597 kb/s AVG\nAspect: 640x480 = 1.33:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: None\nRuntime: 02:14:02\nFPS: 23.976\n\n----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nNow at Beta 2!\n\nhttp://www.koepi.org/XviD-1.1.0-Beta2-04042005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn\non (Y) and (UV) deblocking, and the new feature of\nXviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, please turn off pre-processing. I don't want\nanother stupid motherfucker telling me that my movies are out of sync\nbecause they are totally computer illiterate.","torrent":{"xt":"urn:btih:11786bf4e725a95c20deec6a24d9cd1e0d153357","amp;dn":"Lost_Highway+%28xvid110-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11786bf4e725a95c20deec6a24d9cd1e0d153357","infoHashBuffer":{"type":"Buffer","data":[17,120,107,244,231,37,169,92,32,222,236,106,36,217,205,30,13,21,51,87]},"announce":[],"urlList":[]}}