{"title":"Redwing - Take Me Home (1973/VBR) vinyl-rip","uid":3399324,"size":60378103,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11b142eb5ef62c43d42acb183d5e8f7fc04d6432&amp;dn=Redwing+-+Take+Me+Home+%281973%2FVBR%29+vinyl-rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reride","files":12,"time":1129850411,"description":"Redwing were a band from Sacramento, California. The band evolved out of the New Breed and later Glad which included Timothy B. Schmit (Poco, the Eagles) in the line-up. After Schmit left in 1970 to join Poco, his replacement in the band was Andrew Samuals. The other members of Redwing were Tom Phillips, Ron Floegal and George Hullin. \n\nIn early 1970 the band cut their first album Redwing for United Artists. Their second album What This Country Needs included Timothy B. Schmit again as bassist (since Andrew Samuals had switched back to guitar and the band couldn't settle on a permanent bass player). During this period the band went through five more bass players before finding Dale Lyberger. \n\nAt that time Tom Phillips had been influenced by Rusty Young's steel guitar playing in Poco and started playing the steel guitar himself with Redwing. The band's third album, 1973's Take Me Home, was a country-flavored effort mixed with rock and bluegrass. Their forth album Dead or Alive was more rock-oriented which the band hoped would be their breakthrough album. Around this time the band added fifth member John Myers as a permanent bass player replacing Lyberger. ~ Mike Edmunds, All Music Guide","torrent":{"xt":"urn:btih:11b142eb5ef62c43d42acb183d5e8f7fc04d6432","amp;dn":"Redwing+-+Take+Me+Home+%281973%2FVBR%29+vinyl-rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11b142eb5ef62c43d42acb183d5e8f7fc04d6432","infoHashBuffer":{"type":"Buffer","data":[17,177,66,235,94,246,44,67,212,42,203,24,61,94,143,127,192,77,100,50]},"announce":[],"urlList":[]}}