{"title":"Depeche Mode - Random Access Memory [DivX-DVDRip]","uid":3400791,"size":743932984,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1391b034318360d8936bbce6ef3b217bb41a0c78&amp;dn=Depeche+Mode+-+Random+Access+Memory+%5BDivX-DVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"devotee","files":3,"time":1130173024,"description":"Depeche Mode - Random Access Memory\n\nOut via the UK firm Chrome Dreams on October 17th is the Depeche Mode\ndocumentary DVD &quot;Random Access Memory&quot;.\n\nMelanie Breen, Marketing Coordinator at Chrome Dreams, explains: &quot;This film\ndocuments the band's life in music over the past three decades, from their\nrise in the late 1970s to the present day. With the aid of rare band\nfootage, exclusive interviews, previously unpublished photographs - many\nfrom private collections - numerous contributors and a host of other\nfeatures, this programme, the first of its kind on this legendary group,\nwill delight their millions of dedicated fans.&quot;\n\nThis first complete and unauthorised DVD biography of Depeche Mode includes\npreviously unseen film footage of the band and exclusive in-depth interviews\nwith those who worked closely with them during their career, including;\nBrian Griffin (photographer and film maker who shot several of Depeche's\nsleeves), Jonathan Miller (author of &quot;Stripped: Depeche Mode&quot;), musician and\nclose friend Phil Burdett who played with Martin Gore in previous bands, Deb\nMann (former girlfriend of Vince Clarke and involved with running the DM fan\nclub), Gareth Jones (producer of several DM albums), Lisa Davenport (head of\nthe official DM website and fanclub &quot;Musings for the Masses&quot;), Steve Heath\nand Jeff Hitchings from the DM tribute band 'Black Celebration' among many\nothers.\n\nThe DVD also includes special features such as interactive trivia quiz and\nan extensive digital discography. A DVD that will please many, that's sure.\n\n-----------------\n\nObviously, the DVD interactive parts have been lost on this divx release (a\nproper release of the complete DVD is on the works). The DVD inlay and disc\nare included. Enjoy!\n","torrent":{"xt":"urn:btih:1391b034318360d8936bbce6ef3b217bb41a0c78","amp;dn":"Depeche+Mode+-+Random+Access+Memory+%5BDivX-DVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1391b034318360d8936bbce6ef3b217bb41a0c78","infoHashBuffer":{"type":"Buffer","data":[19,145,176,52,49,131,96,216,147,107,188,230,239,59,33,123,180,26,12,120]},"announce":[],"urlList":[]}}