{"title":"Curved Air - Air Cut (UK Progrock 1973 @224kbs)","uid":3376599,"size":73563235,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14a835bd29d61fe3c7102570a8a13dc56aa14262&amp;dn=Curved+Air+-+Air+Cut+%28UK+Progrock+1973+%40224kbs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"test78","files":9,"time":1125384246,"description":"Search for test78 to find my other uploads.\n\nUK progressive rock from 1973. \n\nCURVED AIR were formed in 1970 by Sonja Kristina (vocals), Darryl Way (violin), Francis Monkman (keyboards), Florian Pilkington-Miksa (drums). The group decided the name using a shortened version of Terry Riley?s composition ?A rainbow in curved air?. In their first album ?Air Conditioning?, a prominent role was given to vocals and violin; the album reached number 8 in the British charts. Then, in 1971, they released ?Second Album?, highly recommended example of CURVED AIR sound (a mix of acoustic folk and progressive rock). \n\n1972 was the year of ?Phantasmagoria?, with Mike Wedgwood as bass guitarist. After a long tourney the band fell apart and Way formed the WOLF, while CURVED AIR showed a new line-up with Eddy Jobson as violinist, but they will never reach the performance level of the early two albums. In 1973, after ?Air Cut? (with a sound hard oriented), Wedgwood joined with CARAVAN and Jobson with ROXY MUSIC. The four members of the original project made the first reunion in 1975 for a tourney (album ?Curved Air Live?). Afterwards Kristina and Way carried on with drummer Stewart Copeland, bassist Tony Reeves, guitarist Mick Jacques and released ?Midnight Wire?. Their last album was ?Airborne?, published in 1976. The second reunion of the four former members was in 1990 for a concert in London (album ?Alive 1990?). In the same year was released an album of previously unissued tracks recorded in 1973 (?Lovechild?). Finally, in 1995, an album of BBC sessions, called ?Live at BBC?.\n\nReview:\nBob McBeath, progrockarchives.com\n\n  ?  A real hidden gem this one which is generally much more progressive than their previous albums. \n\nWith Daryl Way and Francis Monkman no longer in the band, Sonja Kristina, whose distinctive voice was one of the band?s trademarks, was the only original member left. She continued however to surround herself with highly competent musicians, including the multi-talented Eddie Jobson. The other Curved Air trademark, the violin of Way was mainly replaced by keyboards, with Jobson only reverting to violin on a couple of tracks. \n\n?Purple speed queen? is a storming opener, with a great synthesiser solo in the Rick Wakeman vein. ?Elfin Boy? follows on much more softly, Kristina?s voice never sounded more haunting than it does here. The track is a real weepy, with beautifully sympathetic violin accompaniment. ?Graceful his fingers, they waltz on the strings, gentle the song that he sings?, as the lyrics go.\n\nThe third track ?Metamorphosis?, is in my opinion Curved Air?s best ever track. Starting with almost classical piano, the track builds and softens, quickens and slows. Sonja?s vocals vary from the almost child like, to seductive temptress. They combine with some really infectious themes and great instrumental work for over 10 minutes, to make for a real prog classic. \n\nKristina takes something of a back seat on side 2, with an instrumental track, and a rare (for Curved Air) male vocal lead on ?Two three two?. The feature track on side 2 is however the longer final song, ?Easy?. For want of a better description, this is a prog power ballad. Once again, the track has superb keyboards including an excellent instrumental break, and Kristina on top form vocally. \n\nIf all Curved Air means to you is the full frontal nudity of the cover of their first album, plus variations on ?Vivaldi?, this album will open up a whole new dimension for you. \n\nUndoubtedly their best, but criminally very difficult to track down on CD. Nice painting of the then current line up on the rear cover too.\n224kbs\n\nTracklist:\n\n1. The Purple Speed Queen (3:32) \n2. Elfin Boy (4:13) \n3. Metamorphosis (10:38) \n4. World (1:43) \n5. Armin (3:42) \n6. U.H.F. (5:07) \n7. Two-Three-Two (4:10) \n8. Easy (6:40)\n\nEnjoy!","torrent":{"xt":"urn:btih:14a835bd29d61fe3c7102570a8a13dc56aa14262","amp;dn":"Curved+Air+-+Air+Cut+%28UK+Progrock+1973+%40224kbs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14a835bd29d61fe3c7102570a8a13dc56aa14262","infoHashBuffer":{"type":"Buffer","data":[20,168,53,189,41,214,31,227,199,16,37,112,168,161,61,197,106,161,66,98]},"announce":[],"urlList":[]}}