{"title":"Unsolved History: Killing Hitler","uid":3433977,"size":673296222,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:16d6bfdbedccad64cf25ec443fd99aa8684d4d43&amp;dn=Unsolved+History%3A+Killing+Hitler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wwefan","files":2,"time":1137873950,"description":"Unsolved History: Killing Hitler DVD &lt;a href=&quot;\nhttp://shopping.discovery.com/product-55321.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shopping.discovery.com/product-55321.html&lt;/a&gt;\n\nDiscovery Channel Documentary\n\nProduct Detail:\n\nUnsolved History is history the way it was! Through detailed examination of archaeological and forensic evidence, existing photographs, authentic artifacts, and carefully selected interviews from eyewitnesses and experts ? events are reconstructed and historical questions are finally answered.\n\nOn July 20, 1944 ? one year before the fall of Nazi Germany ? members of Hitler's General Staff detonated a bomb in a briefing hut in an attempt to kill their leader. The bombing was meant to lead to the overthrow of the Third Reich and bring about a glorious, early end to the war. But despite careful plotting and precise execution, the plan was a failure.\n\nLearn what went wrong with the scheme to assassinate Hitler, who was standing just a few feet away from the explosion. Explore the bomb-resistant construction of the briefing hut and learn why the conference was moved from Hitler's bunker ? a more typical location. See how the unusually warm weather played a crucial role in minimizing damage from the explosion ? windows that would've been shut remained open, alleviating pressure from the explosion. And, hear the story of how a simple oak dining table may have been Hitler's savior that day. It's an examination of how a series of seemingly unimportant events conspired to preserve the life of one of history's most despised individuals.\n\nKeywords: World War 2, WWII, WW2, Hitler, Allies, Germany, Nazi\n\nSource: DVD-5 (NTSC)\nLanguage: English\nXviD: 1851 kbps\nMP3: 160 kbps\nFramerate: 29.976 FPS\nRuntime: 44:28\nResolution: 640x464\n\nThis is pretty good quality but the original DVD itself wasn't the best crystal-clear source like you would find with other DVD's.  The Encoding didn't lose anything, I know that much and if it did, it was negligible.  Thanks to Warmonger for the source!","torrent":{"xt":"urn:btih:16d6bfdbedccad64cf25ec443fd99aa8684d4d43","amp;dn":"Unsolved+History%3A+Killing+Hitler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d6bfdbedccad64cf25ec443fd99aa8684d4d43","infoHashBuffer":{"type":"Buffer","data":[22,214,191,219,237,204,173,100,207,37,236,68,63,217,154,168,104,77,77,67]},"announce":[],"urlList":[]}}