{"title":"Dil Chahta Hai - Bollywood Hindi - 2000 - 2cd Rip","uid":3421445,"size":1460322304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1743a2e6a4a811df1ac22c853a295122f6e70b19&amp;dn=Dil+Chahta+Hai+-+Bollywood+Hindi+-+2000+-+2cd+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kanedaguy2","files":2,"time":1134723785,"description":"The film is about three distinct characters, Akash (Aamir Khan), Sameer (Saif Ali Khan) and Siddharth (Akshaye Khanna), their individual relationships and the effect that these relationships have on them. Love. One term that can hold different meanings even for close friends like Akash, Sameer and Siddharth. Welcome to a summer of their lives. So you have Akash who does not believe in the concept of love. Two weeks is all that he is willing to give a perfectly healthy relationship. Incidentally, he feels even two weeks is a bit too much! Sameer, like a lot of us, is in love with the idea of being in love. He wants to be in love. But Sameer has not quite understood the concept yet and tends to wear his heart on his sleeve. So this young man is looking for the perfect woman in his life... The most mature, sensitive and understanding of these three is Siddharth. Sid, as he is fondly called, seems to know the true meaning of life. According to his friends, neighbours and even the dogs, Siddharth knows it all. The women who come and change their lives are Shalini (Preity Zinta) and Tara Jaiswal (Dimple Kapadia). Sonali Kulkarni also plays an important role in Dil Chahta Hai. Her character is looking for marriage but not without &quot;love&quot;.","torrent":{"xt":"urn:btih:1743a2e6a4a811df1ac22c853a295122f6e70b19","amp;dn":"Dil+Chahta+Hai+-+Bollywood+Hindi+-+2000+-+2cd+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1743a2e6a4a811df1ac22c853a295122f6e70b19","infoHashBuffer":{"type":"Buffer","data":[23,67,162,230,164,168,17,223,26,194,44,133,58,41,81,34,246,231,11,25]},"announce":[],"urlList":[]}}