{"title":"Gayniggers","uid":3411993,"size":134175446,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:18264886fd64dfd9193483a65334f38ddd685d03&amp;dn=Gayniggers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fredland","files":2,"time":1132588313,"description":"A danish cult short movie\n\nSponsored by Carlsberg Pilsner \nProduced by GayJack Movies \nDistributed by WorldWide GayMovies \nDino De Laurentus &amp; Raymond Hansen Present\nA Lindberg &amp; Kaistensen Production\n\n&quot;The Universe. Its mighty power. Its evolutionary force, not to be stopped by anyone. In its beauty, this, this is a happy place to stay, filled with harmony and cosmic joy. A free place, where men can express themselves, and be as when they were born. All of this is, because someone cares. Because someone looks after us. When we sleep, when we play. When we act natural. This is a movie about those who risk life, and partners, to guarantee living in a wonderful and free universe. This is a movie about the Gayniggers From Outer Space. The Gayniggers come from the planet Anus, in the 8th Sun System, far far away from here. They are much, much more intelligent than any other creature in the Universe. The most fascinating thing about them is that they, with the help of their super intelligence, and their highly developed telepathic system, Braintapping, will be able to create a world, a society, a perfect world to live in without the presence of women. A MALE ONLY WORLD.&quot;\n\nSEED AT LEAST AS MUCH AS YOU HAVE DOWNLOADED\n\n \nDo you like really fucked-up, weird flicks? Cool! Do 'symbolic metaphors' give you a tingle? Does the Name David Lynch mean anything to you? Do you watch movies *just* because you can't pronounce the director's name? Join the CLUB! \n\nBut, are you worthy of the title 'uploader of a*really* far-out movie!'\n\nIf you are, then come and join in! simply paste this section into your post, and other weirdos, like us, can find all the deranged and intangible imagery we need! \n\njust search for freakyflicks \n\n\n****************************************\n************** FREAKYFLICKS ************* \n****************************************\n","torrent":{"xt":"urn:btih:18264886fd64dfd9193483a65334f38ddd685d03","amp;dn":"Gayniggers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18264886fd64dfd9193483a65334f38ddd685d03","infoHashBuffer":{"type":"Buffer","data":[24,38,72,134,253,100,223,217,25,52,131,166,83,52,243,141,221,104,93,3]},"announce":[],"urlList":[]}}