{"title":"Drivers Utilities 2005 by DryKillLogic","uid":3381148,"size":13322067,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1aff9a4d98483b42a36a606ea5ff86dddb6869f0&amp;dn=Drivers+Utilities+2005+by+DryKillLogic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"exeemarg","files":1,"time":1126285590,"description":"Drivers Utilities 2005 by DryKillLogic\n\n-Driver Genius Pro v5.1.915 (English &amp; Deutch)\n-DriverGuide Tool Kit v1.1 (english)\n-DriveSwap v1.0 (english)\n-My Drivers v3.11 (english &amp; Spanish)\n-Driver Cleaner PE v1.2 (multilanguage)\n\nDescription in Spanish and English.\n\n\nSpanish\n_______\n\nCreador: DryKillLogic\nPagina: www.exeemarg.com.ar\nFecha: 9 de Septiembre de 2005\nS.O soportados: windows XP/2000/2003/NT/ME/98/95\nTama&amp;ntilde;o: 13MB\n\nContenido:\n\n-Driver Genius Pro v5.1.915\n\nDriver Genius 2005 es una herramienta muy sencilla de utilizar para hacer backup de nuestros drivers. Detecta de manera muy veloz todos los dispositivos instalados en nuestra PC y realiza un backup de los drivers en un archivo comprimido auto-extra&amp;iacute;ble o en un paquete auto instalable. Una vez que reinstalamos el sistema operativo en nuestra PC, con un par de clicks ya tenemos todos los dispositivos instalados nuevamente.\n\n-DriverGuide Tool Kit v1.1\n\nDriverGuide Toolkit es un programa que puede ayudarte a hacer esta tarea m&amp;aacute;s ligera; esta aplicaci&amp;oacute;n realiza una copia de seguridad de todos tus controladores de Windows, para as&amp;iacute; tenerlos a mano en esos momentos de necesidad. \nPuedes agruparlos por controladores de Microsoft o de otras empresas, y guardar la copia de seguridad en una carpeta de tu elecci&amp;oacute;n, incluso en unidades extra&amp;iacute;bles o en otro ordenador a trav&amp;eacute;s de red local. \nDriverGuide Toolkit es r&amp;aacute;pido y muy f&amp;aacute;cil de usar. S&amp;eacute; un poco previsor y guarda todos tus controladores a salvo en un par de clics; seguro que llega un momento en que agradecer&amp;aacute;s haberlo hecho.\n\n-DriveSwap v1.0 \n\nEste programa te permite desconectar en caliente disco duros, cintas, zips, y otros dispositivos sin tener que reiniciar tu computadora, usa dispositivos usb externos o scsi.\n\n-My Drivers v3.11\n\nMy Drivers puede ayudarte  permiti&amp;eacute;ndote detectar r&amp;aacute;pidamente todos los controladores instalados en tu sistema, para realizar una copia de seguridad de los mismos que puedes restaurar sin problemas cuando necesites, recuperando todos tus controladores con un solo clic. Tambi&amp;eacute;n tiene una opci&amp;oacute;n para comprobar si existen versiones m&amp;aacute;s recientes de tus controladores.\nPuedes seleccionar los controladores individuales de los que quieres hacer copia, y decidir si quieres guardarlo como fichero comprimido, fichero ejecutable o simplemente en una carpeta determinada del sistema. \n\n\n-Driver Cleaner PE v1.2\n\nEste programa, adem&amp;aacute;s de ayudarte con la eliminaci&amp;oacute;n de archivos o programas no deseados, te hace m&amp;aacute;s sencilla la sustituci&amp;oacute;n de un driver por otro. Sirve para ATI, nVidia, Creative, Realtek, SIS, 3Dfx y S3. Permite usos m&amp;aacute;s avanzados como la limpieza de los cab, que quita los archivos ATI y nVidia desde &amp;eacute;stos. Con &amp;eacute;l, tambi&amp;eacute;n puedes seleccionar aplicaciones espec&amp;iacute;ficas para el tipo de archivo que desees eliminar: archivos de programas, de limpieza u otros archivos.\n\nCon Driver Cleaner Proffesional, puedes mantener tu ordenador sin archivos deseados de una manera precisa.\n\n\n\nEnglish\n_______\n\nCreater: DryKillLogic\nWebpage: www.exeemarg.com.ar\nDate: 9 de Septiembre de 2005\nSupported S.O: windows XP/2000/2003/NT/ME/98/95\nSize: 13MB\n\nContain:\n\n-Driver Genius Pro v5.1.915\n\nDriver Genius is a professional tool for backing up or restoring the drivers, it can fast detect all the devices in computer and backup the drivers, and it can make the drivers into the zip-compressed format or self-extractor format files. \n\nWhen you reinstall the operation system, you can use restore-drivers function to restore all the drivers. You need only click the mouse, and then the drivers will be installed into your system automatically. \n\n-DriverGuide Tool Kit v1.1\n\nDriverGuide Toolkit identifies and lists drivers installed on your computer and, when connected to the Internet, allows you to search DriverGuide.com (and other sources) for driver updates and manufacturer sites. In addition, it allows you to backup your currently installed drivers for safe keeping. Backing up your Windows driver files means that they will be available to you the next time you need to reinstall the driver or the whole operating system. DriverGuide Toolkit places the driver files in one organized location of your choosing. \n\nDriverGuide Toolkit is especially helpful in situations where you have a computer in your possession and the internal hardware is unknown. DriverGuide Toolkit can identify the hardware on the system and the associated drivers, back them up to a specified location, and find the latest driver updates for them. DriverGude Toolkit is even network compatible - you can just as easily connect to a remote computer on your network, backup drivers, and find updates\n\n-DriveSwap v1.2 \n\nThis program allows you to hot-swap hard drives, tape drives, ZIP drives and other devices without having to reboot your computer, use external USB drives or SCSI SCA hardware\n\n-My Drivers v3.11\n\nMy Drivers enables easy and fast detection, backup and restore of all hardware device drivers currently on your system. \nAlso, you can even find the latest drivers for your hardware and install them onto your computer. With just one or two mouse button clicks, you will have all your hardware devices extracted and backed-up to any folder you want. \nWhen you reinstall or upgrade your system, you can restore all drivers them by clicking a button. Once after a reboot, and all drivers will be re-installed and will function well. \nYou may also choose to backup a particular driver or all the drivers with an EXE automatic installer. If you have a particular item of hardware that is troublesome, just remove the driver with this software.\nIt is especially useful to those who have lost their Driver Disk or Driver CD. My Drivers is able to clone the original driver installation.\n\n-Driver Cleaner PE v1.2\n\nDriver Cleaner Professional Editon is a program which helps you to remove parts of drivers that are left after uninstalling the old drivers. The program is for ATI, nVidia, Creative, Realtek, SIS, 3Dfx, S3 and more drivers. First you need to uninstall the drivers from the control panel, then reboot. After rebooting, run the program. If you really want a good description of what steps you should take, then you really need to read the readme file included in the zip file and installation as it contains a detailed step by step description. The program also fully supports windows themes and other kind of themes.\n","torrent":{"xt":"urn:btih:1aff9a4d98483b42a36a606ea5ff86dddb6869f0","amp;dn":"Drivers+Utilities+2005+by+DryKillLogic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aff9a4d98483b42a36a606ea5ff86dddb6869f0","infoHashBuffer":{"type":"Buffer","data":[26,255,154,77,152,72,59,66,163,106,96,110,165,255,134,221,219,104,105,240]},"announce":[],"urlList":[]}}