{"title":"Evil Dead Regeneration [4CDs]","uid":3388500,"size":2573193268,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c892c4fa2b68a2c18f21cf20c90c6b4fc66af71&amp;dn=Evil+Dead+Regeneration+%5B4CDs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":182,"time":1127767269,"description":"&amp;iexcl;Vuelve Ash! El protagonista de Evil Dead regresa con un una nueva entrega jugable que parece que por fin har&amp;aacute; justicia a la gran saga de Sam Raimi. Enfr&amp;eacute;ntate a las malvadas criaturas del Necronomicom con tu motosierra. Hail to the king, baby!\n\nA este nuevo juego de la saga Evil Dead se le ha dotado de acci&amp;oacute;n desde el principio, siguiendo fielmente la esencia de la saga cinematogr&amp;aacute;fica. Es conocido ya el hecho de que el personaje de Ash (el protagonista de la historia, interpretado por el anteriormente mencionado Bruce Campbell) vive atormentado desde el d&amp;iacute;a que encontr&amp;oacute; el Necronomicom (el libro de los muertos) en una caba&amp;ntilde;a en el bosque.\n\n\n \nEvil Dead: Regeneration \nLa pesadilla que se desencaden&amp;oacute; le provoc&amp;oacute; la p&amp;eacute;rdida de una de sus manos, que supli&amp;oacute; poniendo en su lugar una motosierra. Armado con su nuevo miembro y una escopeta, decidi&amp;oacute; acabar con las malvadas criaturas que el mal&amp;eacute;fico libro liber&amp;oacute;. As&amp;iacute;, en esta nueva entrega de la saga, Ash comenzar&amp;aacute; equipado con ambas armas, ambas de uso ilimitado, y se abrir&amp;aacute; camino a trav&amp;eacute;s de las hordas de seres demon&amp;iacute;acos gracias a ellas.\n\nComo es l&amp;oacute;gico, se podr&amp;aacute;n realizar combos variados con las distintas opciones de ataque de cada arma, pero adem&amp;aacute;s habr&amp;aacute; movimientos finales al m&amp;aacute;s puro estilo de los fatalities de Mortal Kombat para acabar con las criaturas cuando su barra de energ&amp;iacute;a ha bajado lo suficiente. Todo ello bajo un toque sangriento algo gore que se mantiene dentro de lo que se espera de un t&amp;iacute;tulo de esta saga realmente fiel a las pel&amp;iacute;culas.\n\n \nEvil Dead: Regeneration \nLa variedad de estos ataques promete ser elevada, con cientos de animaciones de Ash para atacar a los enemigos y m&amp;aacute;s de una docena de ataques finales. Estos ataques son de lo m&amp;aacute;s atractivos para los aficionados a la saga, ya que se mantiene toda la chuler&amp;iacute;a y la gracia del personaje, ya sea bien dispar&amp;aacute;ndoles a la cabeza directamente o incluso acabando con ellos sin mirar, en pleno alarde de aires de grandeza.\n\nEstos ataques depender&amp;aacute;n de la situaci&amp;oacute;n en la que se encuentre Ash respecto a los enemigos y de otros diversos factores que har&amp;aacute;n que el personaje realice un movimiento u otro. Todo ello sin olvidar la presencia de una barra que indicar&amp;aacute; la aparici&amp;oacute;n de la versi&amp;oacute;n maligna de Ash, con quien avanzar entre los enemigos ser&amp;aacute; todav&amp;iacute;a m&amp;aacute;s sencillo y todo un ba&amp;ntilde;o de sangre, todo muy dentro de lo visto en las pel&amp;iacute;culas.\n\n","torrent":{"xt":"urn:btih:1c892c4fa2b68a2c18f21cf20c90c6b4fc66af71","amp;dn":"Evil+Dead+Regeneration+%5B4CDs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c892c4fa2b68a2c18f21cf20c90c6b4fc66af71","infoHashBuffer":{"type":"Buffer","data":[28,137,44,79,162,182,138,44,24,242,28,242,12,144,198,180,252,102,175,113]},"announce":[],"urlList":[]}}