{"title":"Resident Evil - Code Veronica X - PS2 - PAL - RAR","uid":3428681,"size":2928816781,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:1d3291b1b6da8096902b5fca97f7c1779b5bcfa4&amp;dn=Resident+Evil+-+Code+Veronica+X+-+PS2+-+PAL+-+RAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maniek0001","files":2,"time":1136614161,"description":"Resident Evil Code Veronixa X for PS2\n\nPAL, MULTI4, and compressed using RAR\n\nttp://www.capcom.com/recvx/\n\ndeveloper: Capcom\npublisher: Capcom\ngenre: action / TPP / survival-horror\nrelease date:\n- Europe (PAL): 13 September 2001\n- USA (NTSC): 21 August 2001\n\nother platforms: Dreamcast, GCN\nplay modes: single player\nage requirements: 16+\n\nGame Story:\n\nIn an effort to find her missing brother, Claire Redfield tracks him down to the Paris Umbrella Facility. Umbrella agents capture her there and she is transferred to the Umbrella Rockfort Island Prison Facility. Under strange circumstances, the prison is attacked and she is released by a sympathetic Umbrella agent. Once again, she must escape the horrors unleashed by the dreaded T-Virus in order to get off of the island and find her brother. She will face new and more powerful bio-weapons. Aided by her new ally, Steve Burnside, they will face the monsters together and in the process, learn some of Umbrella's darkest secrets.\n\nGame Play:\n\nIn the tradition of classic Capcom survival horror games, Resident Evil: Code Veronica X puts the player in the middle of all the heart pounding action. Using a 3rd person camera system as the other Resident Evil games, Code Veronica X takes a different twist by not using pre-rendered backgrounds. The backgrounds rendered in real time allow the camera perspective to automatically move around slightly for a better view of the action. Along with the computer graphic movies and 10 new minutes of added cut scenes, this makes Code Veronica X the best looking Resident Evil ever.\n\nPlaying as Claire Redfield, Chris Redfield, or Steve Burnside, you must survive and escape all of the horrors that confront you. You will find notes and files that help you piece together the mystery of what's going on. Along the way, you will encounter puzzles with no obvious answer. Read the notes carefully to find clues to the answers. All of the answers are in the game.\n\nAs your character progresses through the game, you will undoubtedly run into a variety of monsters created by the T-Virus. You must learn the best and most ammo efficient way to kill each one. They all have certain weaknesses. Unlike other games, you cannot go on a killing rampage. You must conserve your ammo, selectively killing the zombies in your way and avoiding the ones that you can. If you do not follow this advice, you will find yourself facing an enemy with no health.","torrent":{"xt":"urn:btih:1d3291b1b6da8096902b5fca97f7c1779b5bcfa4","amp;dn":"Resident+Evil+-+Code+Veronica+X+-+PS2+-+PAL+-+RAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d3291b1b6da8096902b5fca97f7c1779b5bcfa4","infoHashBuffer":{"type":"Buffer","data":[29,50,145,177,182,218,128,150,144,43,95,202,151,247,193,119,155,91,207,164]},"announce":[],"urlList":[]}}