{"title":"Lego_Star_Wars_WORKING_USA_XBOXDVD-GAMERZ","uid":3435100,"size":755817742,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:1dc72ce13ce7bca4164902034839ea4fba9a61dc&amp;dn=Lego_Star_Wars_WORKING_USA_XBOXDVD-GAMERZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hrndg","files":18,"time":1138087208,"description":"The world's most successful film series meets one of the world's favorite toys in the epic video game LEGO Star Wars. This brilliantly conceived alliance blends the unique world and designs of LEGO play materials with the unforgettable characters, stories, and vehicles of the prequel era of the Star Wars universe.\n\n? Play the movies: Battle your way through Episodes I, II, and III.\n\n? Play the characters: From Anakin and Yoda to Darth Maul and even General Grievous, control over 30 of your favorite characters with the ability to switch between characters.\n\n? &quot;Drop in, drop out&quot; two player cooperative mode: A second player can enter or leave the action whenever they want!\n\n? Use the Force: Move and transform LEGO objects, overcome obstacles, and defeat your enemies.\n\n? Accessorize: Wield a lightsaber as your main weapon or tap into each character's unique weapons and special abilities.\n\n? Massive array of vehicles: Pilot Naboo fighters, Podracers, and yet-to-be-unveiled vehicles from Episode III!\n\n? Authentic music and sounds: Skywalker Sound brings the Star Wars experience to life.\n\n? Free Play mode: Unlocked characters can play in different scenarios from the films.\n\n","torrent":{"xt":"urn:btih:1dc72ce13ce7bca4164902034839ea4fba9a61dc","amp;dn":"Lego_Star_Wars_WORKING_USA_XBOXDVD-GAMERZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc72ce13ce7bca4164902034839ea4fba9a61dc","infoHashBuffer":{"type":"Buffer","data":[29,199,44,225,60,231,188,164,22,73,2,3,72,57,234,79,186,154,97,220]},"announce":[],"urlList":[]}}