{"title":"Richard Youngs &amp; Simon Wickham-Smith - Ceaucescu","uid":3392280,"size":97998980,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1deb070859a483cdfac29abcab1b7a8371ae2763&amp;dn=Richard+Youngs+%26+Simon+Wickham-Smith+-+Ceaucescu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"krakow81","files":12,"time":1128470359,"description":"browbeat:\n\n SIMON WICKHAM-SMITH &amp; RICHARD YOUNGS   Ceaucescu   LP (1992, FE-029)\nWonderful washes of guitar feedback and reed organ with dreamy echo-laden vocals. Like listening to Metal Machine Music on headphones during a Catholic mass held in a large cathedral. On the one fast-paced song, &quot;Just Imagine,&quot; an appalachian dulcimer adds a middle eastern flavor to the rhythmic noise. Simply one of the best records I've bought in a long time. One that I keep going back to and playing.\n\nscaruffi:\n\nCeaucescu (Forced Exposure, 1992) is perhaps the most accomplished of the series: orchestrated for dulcimer, keyboards, guitars, psychedelia and cacophony, it emits an almost religious feeling. In their quirky musical excursions the duo manage to fuse the majestic and the amateurish (I Live In A Big City, Goat, At Home). \n\nWIRE:\nCeaucescu remains one of the heaviest independent albums ever made in the UK, and the closest he has ever come to making a full-blown psychedelic rock record. Jacking fuzz guitar straight into a four track and bolstering heavy barre chords with stumpy rhythm presets and huge gobs of FX, it made for a classic slice of DIY art damage, with lyrics lifted from Spanish Republican songs, children's stories and business circulars. But the inspired psychedelic hymnal &quot;Goat&quot; still dominates the record, floating drugged, wordless chants in a huge bowl of reverb.","torrent":{"xt":"urn:btih:1deb070859a483cdfac29abcab1b7a8371ae2763","amp;dn":"Richard+Youngs+%26+Simon+Wickham-Smith+-+Ceaucescu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1deb070859a483cdfac29abcab1b7a8371ae2763","infoHashBuffer":{"type":"Buffer","data":[29,235,7,8,89,164,131,205,250,194,154,188,171,27,122,131,113,174,39,99]},"announce":[],"urlList":[]}}