{"title":"Cirkus Krigen","uid":3440505,"size":693225472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f715fb50e575b35b93bb39d45ceb5ff1ca8f8af&amp;dn=Cirkus+Krigen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"madnessster","files":1,"time":1139151488,"description":"Cirkus Krigen (the Circus War)\n41 min.\n\nXviD version.\n\nSkr?mmende dansk dokumentar film om politi chikane og vold mod beboere og almindlige mennesker der f?rdes p? fristaden Christiania(www.christiania.org). Filmen indeholder flere st?rke scener og bÂ°r nok ikke ses af sm? bÂ°rn eller dansker der gerne vil beholde en illusion om ikke at leve i en politistat. Download og vis den til din for?ldre/k?rste/nabo/kat og for at i verden seed! ForsÂ°g p? at subbe filmen s? vores engelsk/svensk/tysk talende venner ogs? kan fÂ°lge med vil v?re meget v?rtsat!\n\nEnglish:\n\nChocking danish Documentary about police violence against the citizens and ordinary people in the free state of Christiania(www.christiania.org). The film contains several strong scenes and should not be viewed by young children. Spread it far and wide. The film, unfortuantly does not come with english subtitles. Pehaps someone with experince and language skill could help out?\n\nFra 24timeravis.dk:\n\nNy film dokumenterer politivold\n\nDa JÂ°rn Balther Nielsen efter flere ?r i udlandet vendte tilbage til Danmark, begyndte han at komme p? Christiania. Ligesom de fleste andre kÂ°benhavnere brugte han bydelen til at stresse af og hygge sig p? cafeerne. Han begyndte at holde mere og mere af stedet og M?nefiskeren blev snart JÂ°rn Balthers stamcaf?. Men noget undrede ham og spolerede hyggen for ham. Oftere og oftere kom politiet p? besÂ°g og undersÂ°gte ham for besiddelse af hash. 10-15 gange om dagen kom ordensmagten p? besÂ°g og JÂ°rn Balther noterede sig, at de blev mere og mere p?g?ende og ubehagelige. En dag bad de JÂ°rn Balther smide alt tÂ°jet midt og cafeen, og fra da af besluttede han, at dokumenterer politiets arbejde med videofilm. Det har han gjort i mere end et ?r, og det er der netop kommet en film ud af. Og lad det v?re sagt med det samme ? subjektiv eller ej ? den er ikke for sarte sj?le.\n\nIdeen har v?ret at lade Christianitter fort?lle deres egen historie gennem billeder, og resultatet er noget af det mest objektive og samtidig mest ubehagelige stykke dokumentar, der er set l?nge om Christiania. Scene efter scene ses ualmindelig voldsomme episoder mellem politi og civile, og filmens genialitet er, at den viser HELE forlÂ°bet. Ikke blot den egentlige konfrontation mellem de to parter, men ogs? hvordan politiet gang p? gang tilsyneladende mister overblikket og lader situation lÂ°be ud af kontrol. \n\nFilmen koncentrere sig om forlÂ°bet omkring rydningen af cirkus Christiania fra i sommer, men fÂ°lger op med episoder helt ind til den 23. december 2005. S?rlig ubehagelig er en af filmens slutscener, hvor en ung kvinde p? M?nefiskeren helt ?benlyst uden grund bliver sl?et med adskillige knippelslag af en betjent. Kvinden forsÂ°ger at slippe v?k fra betjenten, der jagten hende med kniplen gennem cafeen. En ?ldre mand forsÂ°ger at s?tte sig imellem ved at stille sig ind foran kvinden, men da det sker f?r han blot knippelslag. En voldsom scene i en voldsom film, som ganske givet vil ?ndre publikums syn p? forholdende p? Christiania ? en vigtig film.\t\t","torrent":{"xt":"urn:btih:1f715fb50e575b35b93bb39d45ceb5ff1ca8f8af","amp;dn":"Cirkus+Krigen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f715fb50e575b35b93bb39d45ceb5ff1ca8f8af","infoHashBuffer":{"type":"Buffer","data":[31,113,95,181,14,87,91,53,185,59,179,157,69,206,181,255,28,168,248,175]},"announce":[],"urlList":[]}}