{"title":"DJ MENTZIK - MIXAMIX_20060609","uid":3498905,"size":109269748,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:204b2facc491b709d424ca236f70372ff1c99713&amp;dn=DJ+MENTZIK+-+MIXAMIX_20060609&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mentzik","files":35,"time":1151431686,"description":"DEAR MUSIC LOVERS,\n\nThis mixed music cd is one of my MIXAMIX series.\nThis cds are made mainly as road music but some of them can be easily used for parties.\nI make this cds to accompany me and my friends at car or excursions.\n\nThe motive for making these cds was the fact that I could not find a radio station \nplaying the music I like without interuptions. So I started making my 1hour and a half music experience.\nI like various kinds of music and like to hear them intermixed. That is a risk no radio station takes and also not \nmany djs in the world. Till now only Paul Oakenfold has managed to marry many kinds and ages of music together.\n\nAnyways, hope you enjoy this mixed disks as much as I do.\nRemember that I am not professional, I do this as a hobby.\nThe date after MIXAMIX is the date I have started creating each of this cds. \nThe creation may take from just one day to many months.\n\nA few words about this MIXAMIX_20060609:\nThis cd is made by the selection of tracks I did for playing music at a friends party.\nAfter that I had clear on my mind how I should mix the best tracks of that selection to accompany me at my rides.\nIt was also this cd that made me decide that I should share this cds with more people around , because maybe there\nare more with musical taste like mine around.\n","torrent":{"xt":"urn:btih:204b2facc491b709d424ca236f70372ff1c99713","amp;dn":"DJ+MENTZIK+-+MIXAMIX_20060609","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"204b2facc491b709d424ca236f70372ff1c99713","infoHashBuffer":{"type":"Buffer","data":[32,75,47,172,196,145,183,9,212,36,202,35,111,112,55,47,241,201,151,19]},"announce":[],"urlList":[]}}