{"title":"Coast to Coast 09-26-2005","uid":3389067,"size":55275593,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:22ceea4d504502091269d42357b409ea301e5053&amp;dn=Coast+to+Coast+09-26-2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ConspiratorBuff","files":4,"time":1127866561,"description":"George Noory\n\nClimate Change &amp; Ice Ages\nResearcher Robert Felix returned to discuss recent climate changes and his theory that we could be headed into a potential new ice age. Global warming is not brought about by man-made factors, he contended, but rather undersea volcanic activity which brings about ocean warming. It's estimated there are as many as one million underwater volcanoes, but scientists know more about the moon than these features, Felix pointed out. \n\nDuring a period about 120,000 years ago, sea levels rose 20 ft. above today's levels and then plunged 50 ft. all within the space of a century. Massive snowstorms accumulating on land caused the dramatic drop in sea level, he said. While many assume icy areas of the world are warming up, Felix noted that glaciers are actually growing on a number of continents, including North America.\n\nHe believes that the recent super hurricanes that have been hitting the United States are similar to a cycle that occurred during the 1940's through the 1960's and could potentially get worse. The warming of the ocean water is fueling these intense storms, which could be around for another decade, he noted.","torrent":{"xt":"urn:btih:22ceea4d504502091269d42357b409ea301e5053","amp;dn":"Coast+to+Coast+09-26-2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22ceea4d504502091269d42357b409ea301e5053","infoHashBuffer":{"type":"Buffer","data":[34,206,234,77,80,69,2,9,18,105,212,35,87,180,9,234,48,30,80,83]},"announce":[],"urlList":[]}}