{"title":"Super Utilities 4 86","uid":3304309,"size":4568203,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24406a32d7ef14dd1ef95a5047e168bd8e762a85&amp;dn=Super+Utilities+4+86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Torrents_","files":3,"time":1111361730,"description":"Super Utilities makes your computer run faster, safer, with greater privacy and security. With only a few minutes of tweaking, Super Utilities will optimize the performance of your computer, corrects problems and helps you to customize your system to suit your needs.\nSuper Utilities is a collection of tools to fix, speed up, and maintain your PC! These utilities include Disk Cleaner, Registry Cleaner, Uninstall Plus, StartUp Manager, Folder Guard, Tracks Washer, Driver Backup, Auto Shutdown, Windows Manager and Process Manager. With a cool and user-friendly interface makes it easy for anyone to use Super Utilities. \n\n-Disk Cleaner: Seeks out and removes unnecessary files and data garbage on your hard drivers. This frees up valuable space on your drivers and streamlines your system.\n \n-Registry Cleaner: Clean and fix your registry &amp;amp; improve your PC's performance. \n\n-Uninstaller Plus: Offers an easier and better way to uninstall programs you no longer want on your computer. \n\n-StartUp Manager: You can inspect, edit, and/or temporary disable the programs that are automatically started when you turn on your computer. \n\n-Memmory Turbo: increases your system performance by making more RAM available for your applications and the operating system. \n\n-Folder Guard: Hide your private files and folders from other users of your computer, to restrict access to important system files and protect them from damage.\n \n-Tracks Washer: Cleans up all your tracks left by Windows,your browser and many other programs.Protect your privac,save storage space and improve performance of your computer. \n\n-StartMenu Guard: Easily hide/display any items in Windows Programs menu folder (Start Menu). \n\n-IE Favorites Guard: Easily hide/display any items in Internet Explorer Favorites folder.\n\n-Windows Manager: Lists all windows on the taskbar and provide with four utility functions: close, top of most, visble/hide, hotkey configuration for the all show/hide or all close operations. \n\n-Process Manager: Displays the detailed information about the processes running under your Windows OS and shows a list of running processes with information about process Id, priority and full path to the process module, and provides with the function to forbid special process to run. \n\n-IE Protecrot: A powerful tool to repair IE Browser, including homepage, IE title, context menu and toolbar button. \n\n-Auto Shutdown: You can perform your action by the following optional ways: time, exact time, counting down, processor usage. If you select time, exact time, you can confirm the running date. Then you can select actions as logging off, restarting, shutting down, executing. \n\n-Driver Backup: A useful utility to backup your driver files. It can collect all of your installed driver files and save them to specified location. Backing up your driver files means they will be available to you the next time you need to reinstall the driver, or whole operating system. It also can package driver files to a compressed and executable file. \n\n-Folder Analyzer: A powerful tool to help you see how much space takes a folder on your system. The space taken by a folder consists of all the space taken by the files and folders within this folder.\n\n\nRead ReadMe.txt for registration info!\n\n\nP.S If any of my torrents is out of seeders,start download anyway so i can see it,then i start to seed again =)","torrent":{"xt":"urn:btih:24406a32d7ef14dd1ef95a5047e168bd8e762a85","amp;dn":"Super+Utilities+4+86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24406a32d7ef14dd1ef95a5047e168bd8e762a85","infoHashBuffer":{"type":"Buffer","data":[36,64,106,50,215,239,20,221,30,249,90,80,71,225,104,189,142,118,42,133]},"announce":[],"urlList":[]}}