{"title":"Rapoon-The Fires Of The Borderlands","uid":3382238,"size":91961100,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:245c149543aff924440f09a3f9210fbeaca418b5&amp;dn=Rapoon-The+Fires+Of+The+Borderlands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MALAI","files":12,"time":1126523700,"description":"The Fires of the Borderlands\n\nPress Release (Release)\n\n&quot;Some have it, and some don't. Robin Storey, both a founding member of the legendary :zoviet*france: and the mastermind behind Rapoon, clearly 'has it'. Everything I've heard from him is distinguished by its striking consistency and clarity of purpose... Superficially, you could label Rapoon's music 'ambient industrial' with an occasional touch of ethnic (eg. tabla and oud samples). But all these ingredients are in common use today; it's the choices Storey makes that set him apart.&quot; - Bill Tilland / Alternative Press\n\nRobin Storey has released six Rapoon albums on Staalplaat / Soleilmoon since his departure from :zoviet*france:. Release Entertainment is proud to release his seventh, The Fires of the Borderlands. Awe-inspiring ambience melds with ethnic percussive loops and dark, undulating industrial sensibilities to form an eleven-piece composition evoking spiritual musical stimulation.\n\nWords cannot possibly do this music justice.\n\nFounded in 1992, Rapoon is the solo project of :zoviet*france: member, Robin Storey. Fires of the Borderlands is his seventh release under this monicker to date. Following a more mellow approach to his previous works, Rapoon offers ambience in its rawest sense. Storey uses minimal percussion, combined with dark, droning synths and loops, to create extremely rich soundscapes. Most of the tracks on Fires of the Borderlands follow a similar direction: moody, atmospheric compositions worthy of any film noir soundtrack. Fans of Storey's previous work with :zoviet*france:, as well that bands other spin-offs such as Mark Spybey's Dead Voices on Air, and Dan Ponten's Horizon 222 will find this record to be a great example of their talent for experimental ambience.\n\nreviewed by Ben Schingel\nThe Industrial Bible May 1998\n\nEver since Robin Storey left :zoviet*france:, he has been quite busy, putting seven albums under his belt in the past three years. Despite all his musical expedience not a single release is boring or stagnant. The music seems to flow continuously from Robin's fingertips and &quot;The Fires of the Borderlands&quot; is no exception to this rule. This time around, Robin works with much thicker ambient tones than previous albums. The richness of the bass and depth of layering is evident on 'Hollow Flights' and 'Snake of Earth' bringing to mind other Dark Ambient masters like Brian Lustmord and Robert Rich. Robin treats these deep tones as if they are malleable as clay, reworking and reinterpreting the sounds with only minor molding. As with all Rapoon releases, this album is best experienced with a pair of expensive speakers, a massive stereo system, and a broadband equalizer to rein the abundant frequencies into something the human ear can truly appreciate.\n\nRapoon is: Robin Storey\nSonic-Boom","torrent":{"xt":"urn:btih:245c149543aff924440f09a3f9210fbeaca418b5","amp;dn":"Rapoon-The+Fires+Of+The+Borderlands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245c149543aff924440f09a3f9210fbeaca418b5","infoHashBuffer":{"type":"Buffer","data":[36,92,20,149,67,175,249,36,68,15,9,163,249,33,15,190,172,164,24,181]},"announce":[],"urlList":[]}}