{"title":"Anonymous Bittorrent !","uid":3296135,"size":7108962,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24716252437dabe40684ecf2ada9743fc858d4ce&amp;dn=Anonymous+Bittorrent+%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"fredrike","files":1,"time":1109550508,"description":"The client works with the i2Pexternal link (cache) anonymous network, which means that you can now run bit torrent with nary a worry. Seeds, trackers, bit torrent search engines, clients, you name it. Read on for more information about how to install it and get up and running. \n\n\n- HOWTO!\n\nConfigure your firewall\n\ni2p requires that if you have a firewall (And who doesn't?) that you configure it to allow TCP traffic on port 8887 in through your firewall to the host running the i2p software. It will not work correctly without it. So, double check your stand alone firewall, and if you're running a client firewall make sure that is also configured to allow traffic in on TCP port 8887. You can also configure I2P to run on another port, but we suggest you stick with the default.\n\nInstall the software\n\nNote: You must have Java installed on your system to run i2p. If you do not have Java installed, go to this URL and download a copy for your Operating System:\n\nhttp://www.java.comexternal link\n\nOnce you have Java installed on your system, run this command:\n\njava -jar i2pinstall.jar\n\nOR\n\nYou can just double click on the i2pinstall.jar file if your system is setup to understand what a .jar file is (on Windows, this is almost always the case if you have Java installed.)\n\nStart the services\n\nNormally the install will startup the i2p services automatically, but in case they don't, or if you shut them down and want to start them up again, run these commands (from the directory you install i2p in):\n\n./i2prouter start\n\nPoint your browser to this URL\n\nhttp://localhost:7657/index.jsp\n\nThis is the i2p router interface, your gateway to the software, documentation, and lists of sites on the network. Before you can do anything, you need to &amp;quot;seed&amp;quot; your router. No worries, it very very simple to do, just look on the left hand side of the &amp;quot;Router Console&amp;quot; page and click the &amp;quot;reseed&amp;quot; link. It should change to &amp;quot;reseeding&amp;quot;\n\nTo start access sites via your browser, you need to take one more step.\n\nChange your proxy\n\nChange your browsers proxy to point to localhost port 4444. We also recommend you add &amp;quot;localhost&amp;quot; to your list of excluded sites, otherwise you won't be able to use the Router Console anymore (http://localhost:7657/index.jsp) \n\n\nGLHF!","torrent":{"xt":"urn:btih:24716252437dabe40684ecf2ada9743fc858d4ce","amp;dn":"Anonymous+Bittorrent+%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24716252437dabe40684ecf2ada9743fc858d4ce","infoHashBuffer":{"type":"Buffer","data":[36,113,98,82,67,125,171,228,6,132,236,242,173,169,116,63,200,88,212,206]},"announce":[],"urlList":[]}}