{"title":"Scientology Ron's Journal 67 &amp; 36","uid":3430342,"size":11250786,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:27e328c06376ffa77f6855564dcf0975d750e80c&amp;dn=Scientology+Ron%5C%27s+Journal+67+%26+36&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"belalugosi","files":3,"time":1136945197,"description":"This torrent consists of two audio tapes by L. Ron Hubbard:\n\n&quot;Ron's Journal 67&quot; - Made in September 1967. The tape runs approximately 40 minutes, in which Hubbard talks about various subjects, including the Sea Org and an alleged conspiracy against Scientology, orchestrated by a secret society of about a dozen men who controls all mental health groups in the world. He talks about how Scientology, however, has sent in agents against these people.\n\nHubbard also talks about having made a breakthrough, discovering things that &quot;were the demise for this civilisation&quot;. He says this information is &quot;carefully arranged to kill anyone if he discovers the exact truth of it&quot; and that he got injured and &quot;almost lost this body&quot; obtaining the material. He doesn't give much details about what the information is &quot;because it's very likely to make you sick too&quot;. What he is talking about is the story about Xenu.\n\n&quot;Ron's Journal 36&quot; was made in 1982 and is a short Christmas greeting to all scientologists and a pep talk from Hubbard, although some people speculate the person on the tape may not be Hubbard but a soundalike, since Hubbard lived in hiding at this time. \n\nThe quality of RJ67 is pretty good. I ripped RJ36 myself and the quality is so-so with some background noises.","torrent":{"xt":"urn:btih:27e328c06376ffa77f6855564dcf0975d750e80c","amp;dn":"Scientology+Ron%5C%27s+Journal+67+%26+36","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27e328c06376ffa77f6855564dcf0975d750e80c","infoHashBuffer":{"type":"Buffer","data":[39,227,40,192,99,118,255,167,127,104,85,86,77,207,9,117,215,80,232,12]},"announce":[],"urlList":[]}}