{"title":"Batman/Superman--World's Finest","uid":3503212,"size":2523682816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:28bf21a3159b46d946cd236688dcc235c6063b66&amp;dn=Batman%2FSuperman--World%5C%27s+Finest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thornman99","files":8,"time":1152809770,"description":"\nThis DVD contains only the main movie. It is in NTSC format, region free, and spanish subtitled.\n\n\nJoker, short on money for his criminal endeavors, strikes a deal with Lex Luthor to kill Superman. Batman tracks Joker to Metropolis and alerts Superman to the Joker&amp;#039;s plan. After initial distrust of each other, the World&amp;#039;s Finest team up to thwart the villains by night. By day, Bruce Wayne and Clark Kent clash over the attention of Lois Lane.\n\n\nThis DVD is not too big, so I ask you to please seed this DVD in its full totality, so more people can enjoy it. Thank you.\n\n\n\n\nEste DVD contiene solamente la pelicula principal, sin menu. Esta en formato NTSC, region libre, y en subtitulo en Espanol. \n\n\n\nEl Guason, corto de dinero para su esfuerzo criminal, hace un trato con Lex Luthor para matar a Superman. Batman rastrea al Guason a Mtropolis y alerta a Superman acerca de los planes del Guason. Batman y Superman no confian del uno al otro al principio, pero luego se unen para hacer el equipo mejor del mundo en contra de los villanos de la noche. Por el dia Bruce Wayne y Clark Kent compiten por la atencion de Lois Lane.\n\n\nEste DVD no es muy grande, asi que les pido que por favor subirlo en su totalidad, para asi que mas presonas disfruten de el. Gracias. \n\n","torrent":{"xt":"urn:btih:28bf21a3159b46d946cd236688dcc235c6063b66","amp;dn":"Batman%2FSuperman--World%5C%27s+Finest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28bf21a3159b46d946cd236688dcc235c6063b66","infoHashBuffer":{"type":"Buffer","data":[40,191,33,163,21,155,70,217,70,205,35,102,136,220,194,53,198,6,59,102]},"announce":[],"urlList":[]}}