{"title":"Nuova Idea - Mr  E  Jones (Italian Prog/Rock 1972) (192)","uid":3305418,"size":59616684,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29552e9ed21242fa608fa25b63e9a325e6071f15&amp;dn=Nuova+Idea+-+Mr++E++Jones+%28Italian+Prog%2FRock+1972%29+%28192%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"brainticket","files":11,"time":1111582850,"description":"A group from Genova, they had much in common with New Trolls, and some of their members like Usai and Belloni have even played with that band in different stages.\nThey formed in 1969 with the name of Plep, that afterwards became J.Plep, and released a single in that year under this name (the label bears the name &amp;quot;Gil dei J.Plep&amp;quot; that was in fact the lead singer Giorgio Usai). \n\n1972 came and guitarist Marco Zoccheddu left the band, with Antonello Gabelli replacing him on the second album Mr.E.Jones, a concept album based on a clerk's life, with good lyrics and some nice tracks like the long Illusione da poco. The band make a strong use of multivocal and falsetto parts not unlike New Trolls', but the instrumental parts are very well played.\n\nI've heard some say that this album is far inferior to their first album Clowns, but I have never heard that one so I can only advise that I quite like this. In some of the poppier places like on the 2nd track it reminds me of early Le Orme. I have also added for your pleasure a good image oif the original albume cover, the first single cover from the album, and the promo poster that came with the original album - which I think is pretty cool.\nEnjoy and please comment, Brainticket:)","torrent":{"xt":"urn:btih:29552e9ed21242fa608fa25b63e9a325e6071f15","amp;dn":"Nuova+Idea+-+Mr++E++Jones+%28Italian+Prog%2FRock+1972%29+%28192%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29552e9ed21242fa608fa25b63e9a325e6071f15","infoHashBuffer":{"type":"Buffer","data":[41,85,46,158,210,18,66,250,96,143,162,91,99,233,163,37,230,7,31,21]},"announce":[],"urlList":[]}}