{"title":"PS2 - Pilot Down Behind Enemy Lines [PAL] [MULTi5] [FULLDVD]","uid":3384816,"size":1873229286,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:29a0b1474f94ee99e281aaec7aefd0439fee37ce&amp;dn=PS2+-+Pilot+Down+Behind+Enemy+Lines+%5BPAL%5D+%5BMULTi5%5D+%5BFULLDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"changoboy","files":40,"time":1127055383,"description":"EL Capitan Brent Cooper y su copiloto el Teniente Bill Foster del escuadron 392 de bombarderos efectuaban un bombardeo rutinario sobre Alemania en el invierno de 1944.\n\nAntes de llegar a los objetivos, su B-24 Libertador se vio atacado por fuego enemigo. Intentado escapar, sufrio da&amp;ntilde;os en sus alas.\n\nLuchando por mantener el control, Cooper y Foster lograron eyectarse antes de que el avion explosionara en los bosques nevados de la Francia ocupada.\nFoster logro abrir su paracaidas a tiempo, quedando levemente herido, pero no quedo ningun rastro de Brent Cooper ni del resto de los tripulantes.\n\nEn temperaturas bajo cero, Foster logro encontrar el B-24 destruido, que le proporciono calor. Aviones de la Lufwaffe se podrian escuchar a lo lejos, y los alemanes le podrian descubir en cualquier patrulla rutinaria. Bill Foster esta a punto de vivir una mision imposible de supervivencia. Las probabilidades eran de 500 contra 1 en su contra....\n\nFoster debe sobrevivir a los elementos, conseguir suficiente comida y no ser capturado. Siguiendo su rastro se encuentra el piloto de la Lufwaffe Killenger, cuya pasion es buscar y eliminar a pilotos derribados.\n\nLa mision de Foster le llevara a traves de terreno enemigo (la Francia ocupada y Alemania) hasta suiza, cruzando pueblos, ciudades, bases enemigas, bosques y rios utilizando su astucia y sigilo para escapar del enemigo.\n\nLas probabilidades estan en su contra, y Killinger sigue a Foster muy de cerca, dejandole una posibilidad: muerte o libertad.","torrent":{"xt":"urn:btih:29a0b1474f94ee99e281aaec7aefd0439fee37ce","amp;dn":"PS2+-+Pilot+Down+Behind+Enemy+Lines+%5BPAL%5D+%5BMULTi5%5D+%5BFULLDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a0b1474f94ee99e281aaec7aefd0439fee37ce","infoHashBuffer":{"type":"Buffer","data":[41,160,177,71,79,148,238,153,226,129,170,236,122,239,208,67,159,238,55,206]},"announce":[],"urlList":[]}}