{"title":"Three Stooges 126-129 Final Try (2 parts)","uid":3396452,"size":463697391,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29c55f74f49537bc895329a33b8244e708b42cdf&amp;dn=Three+Stooges+126-129+Final+Try+%282+parts%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeterL99","files":9,"time":1129316362,"description":"Square Heads of the Round Table (1948)\n\n    Director: Edward Bernds\n    Cast: Jock Mahoney, Christine McIntyre, Vernon Dent, Phil Van Zandt\n\n    Set in Elizabethan times, the Three Stooges decide to help their friend Cedric the Blacksmith, win the hand of the fair princess Elaine. At night the group sneaks into the castle to serenade Elaine, but pick the wrong window and are caught by the King. Tossed in the dungeon, the boys escape with Cedric's help and manage to foil the plans of the Black Prince who was plotting against the King. All turns out well when the grateful King allows Cedric to marry Elaine.\n--------------------------------------------------------------------------------\nFiddlers Three (1948)\n\n    Director: Jules White\n    Cast: Virginia Hunter, Vernon Dent, Phil Van Zandt\n\n    The Three Stooges are musicians at the court of King Cole. When they ask the king's permission to marry their sweethearts, the King agrees, but only after Princess Alicia has married Prince Valiant. This news upsets Mergatroyd, an evil magician who plans to marry the Princess himself and rule the Kingdom. Mergatroyd abducts the Princess, and it's up to the Three Stooges to foil his plans and expose his evil doings.\n--------------------------------------------------------------------------------\nHot Scots (1948)\n\n    Director: Edward Bernds\n    Cast: Christine McIntyre, Herb Evans, Ted Lorch, Charles Knight\n\n    The Three Stooges apply for job as 'Yard Men' at Scotland Yard, thinking they'll become detectives, but instead wind up as gardeners. When they learn that detectives are need to guard a Scottish castle where valuables have been disappearing, they masquerades as Scotsmen to get the job. After a spooky night in the castle, the boys expose the servants as the crooks.\n--------------------------------------------------------------------------------\nHeavenly Daze (1948)\n\n    Director: Jules\n    White Cast: Vernon Dent, Sam McDaniel, Symona Boniface\n\n    Shemp dies but cannot get into heaven until he reforms Moe and Larry. He returns to earth as an invisible spirit and sets out to prevent the other two Three Stooges from selling a phony invention (a fountain pen that writes under whip cream) to a rich couple. Shemp sabotages Moe and Larry's sales pitch, but it looks he's headed for the fires below anyway. But no, its only a dream and Shemp set the bed on fire while smoking in bed.\n--------------------------------------------------------------------------------\nMISSING:\n\nShivering Sherlocks (1948)\n\n    Director: Del Lord Cast: Christine McIntyre, Vernon Dent, Duke York, Kenneth; McDonald, Frank Lackteen\n\n    The Three Stooges witness an armed robbery and are brought in by the cops; as suspects. After passing a lie detector test, the boys are freed; but are now the only ones who can identify the crooks. Meanwhile, their friend Gladys has inherited a house in the country and the; boys go with her to inspect it so she won't be gypped when its sold. The house turns out to be the crook's hideout, and when they abduct; Gladys, the Three Stooges must rescue her.\n\n","torrent":{"xt":"urn:btih:29c55f74f49537bc895329a33b8244e708b42cdf","amp;dn":"Three+Stooges+126-129+Final+Try+%282+parts%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c55f74f49537bc895329a33b8244e708b42cdf","infoHashBuffer":{"type":"Buffer","data":[41,197,95,116,244,149,55,188,137,83,41,163,59,130,68,231,8,180,44,223]},"announce":[],"urlList":[]}}