{"title":"WoW-1.6.1.4544-to-1.7.0-enGB-patch","uid":3383269,"size":56572740,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:29d8d37df93b35902f72496a6015c6c3dc5e4423&amp;dn=WoW-1.6.1.4544-to-1.7.0-enGB-patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"d99flopp","files":1,"time":1126731459,"description":"Mac version of the WoW-1.6.1.4544-to-1.7.0-enGB-patch\n-----------------------------------------------------\n\nWorld of Warcraft Client Patch 1.7.0 (2005-09-14)\n\nZul'Gurub\n\n      Hidden within the jungles of Stranglethorn, an ancient Troll city full of peril has been uncovered. Do you have what it takes to delve into its mysteries with a band of hardy explorers? There's only one way to find out! Zul'Gurub is a high-level, 20-man raid instance with 120 new rare and epic items to uncover. Adventure awaits! \n\nArathi Basin\n\n      Join the League of Arathor or the Forsaken Defilers as they battle for the precious resources stockpiled within the latest Battleground, Arathi Basin! Pitting 15 members of each faction against each other, the race is on to be the first to 2000 resources, capturing strategic landmarks around the Basin to increase your team's gain and cripple the enemy. With an all-new set of reputation-based rewards, there's never been a better time to join the war! \n\nStranglethorn Fishing Extravaganza\n\n      The Stranglethorn Fishing Extravaganza is a grand new event set along the coasts of Stranglethorn Vale. Early on the appointed day, friendly neighborhood goblins will visit Ironforge and Orgrimmar to inform aspiring anglers of the grand tournament and give instructions. At the appropriate time, the shout will ring out across Stranglethorn to bait your hooks and cast your lines! \n\nGeneral\n\n    * The debuff limit has been increased to 16 (from 8). In addition, the client will now display all 16 debuffs.\n    * Switching weapons in combat triggers a 1 second global cooldown for all abilities for rogues and a 1.5 second global cooldown for everyone else.\n    * Possessed units (e.g. Mind Control, Eyes of the Beast etc...) can now cancel combat mode by clearing your current target. In addition, the UI will have a gold border when the possessed unit is actively in combat mode with the target.\n    * Several stun spells and abilities that were previously unresistable can now be resisted as was always intended.\n    * Damage absorption no longer protects against falling, drowning, or fatigue damage.\n    * The targeting circles for area effect spells will no longer be cancelled when the caster moves.\n    * Absorbed and resisted environmental damage is now shown in the combat log.\n    * If an attack deals non-physical damage, the type of damage is now reported in the combat log.\n    * Fixed bug where you could kill someone in a duel with spell reflection.\n    * Auras and shapeshift forms can be cancelled while you are fleeing or confused.\n    * Fixed bug where you couldn't right click to attack a hunter who is feigning death.\n    * You can no longer unequip weapons while they are disarmed.\n    * Debuffs and area effect spells now use their actual cast level rather than effective cast level for calculating periodic resistance.\n    * Escape Artist works with Frost Nova and Frost Trap again.\n    * Damage absorption is now applied before damage splitting effects.\n    * Casting spells on your pets and summons will no longer cause guards in neutral towns to attack you.\n    * Fixed a bug where mana was being regenerated while channelling spells that use mana.\n    * Fixed a bug where the Dazed ability used by creatures when attacking targets from behind was countered/dispelled by some spells (e.g. Blessing of Freedom).\n    * Fixed a bug where area of effect periodic damage spells were being resisted more frequently than they should have been when casting lower level ranks of the spell (affected spells were Blizzard, Consecration, Explosive Trap, Flamestrike, Hurricane, Rain of Fire and Volley).\n    * Effects that make players immune to physical will no longer be immune to the &quot;Recently Bandaged&quot; effect from First Aid.\n    * Made general improvements to the camera.\n    * You are no longer able to kill players in duels with reflected DoT spells\n    * When you swap weapons in combat, you start your swing again, instead of continuing your last swing.\n    * Fixed bug where self-inflicted damage, like Poisonous Blood, wouldn't break stealth.\n    * When an attribute increasing effect (e.g. Arcane Intellect) is refreshed on a target, it will no longer reset the target's health or mana and then increase the total.\n    * Spells and effects that reduce attack speed will no longer stack with each other. Some spells this change effects include Thunderclap, Frost Armor, the Doomguard's Cripple spell, the Icy Chill enchantment, and Hurricane.\n    * Players who have died can now view the contents of their bags and view menus (ie the character sheet, quest log, etc). This change also applies to Hunters that are using Feign Death.\n    * Pets now switch to a new target if possible when their current target is polymorphed.\n    * Meeting Stones\n          o A number of miscellaneous improvements have been made that should allow for better group forming when using the meeting stones.\n          o You will no longer be kicked from the meeting stone queue when a player declines a group invite or when inviting someone that is already in a group.\n          o You will now be informed that you have left the meeting stone queue when the group leader logs out.\n          o Tanks and Healers will now be immediately added to the group by the meeting stone when they are the 5th member of the group.\n          o You can now be added to a group by the meeting stone when that group contains characters that have disconnected. \n\nPvP\n\n    * Battlegrounds\n          o Battleground &quot;holidays&quot; have been added to Warsong Gulch, Alterac Valley and Arathi Basin. Holidays occur during most weekends, starting on Thursday night at midnight and continuing until Tuesday morning. During a holiday, emmissaries from that Battleground will be found in the major cities, and honor/faction rewards for performing objectives in that battleground are increased.\n          o Warsong Gulch and Arathi Basin will now be level-banded as follows: 20-29, 30-39, 40-49, 50-59, 60\n          o System Messages have been added to Warsong Gulch to replace the heralds.\n          o Battleground queue functionality has been improved to eliminate certain types of &quot;traffic jams&quot; that could prevent instances from starting\n          o Losers of Warsong Gulch are now given a &quot;Ribbon of Sacrifice&quot; which they may turn in to Captain Shatterspear or Sentinel Farsong for a faction reward.\n          o Offensive use of damage immunities no longer causes the flag to drop in Warsong Gulch.\n          o In the Battlegrounds, you will now automatically be resurrected by Spirit Healers unless you choose to decline.\n          o A bug that allowed ghost players to pass through the Warsong Gulch starting gate has been fixed.\n          o Alterac Valley now correctly rewards honor for owning graveyards at the end of the game.\n          o Characters that use the Battlemaster to enter a Battleground will now port back to that Battlemaster when they leave the Battleground for any reason.\n          o Fixed range check for removing insignia from players in Battlegrounds.\n          o Fixed a bug that would cause players to stand up when a turnin was made in Alterac Valley.\n          o Players will no longer be able to gain health by repeatedly entering and leaving the effect of a Battle Standard.\n          o Entering a battleground now resets the timer for the AFK flag. This should prevent players being kicked by the AFK timer moments after they enter the Battleground instance.\n          o Using the /who command while in a Battleground instance will now only display players in your instance.\n          o The requirement to purchase special Food and Bandage consumables for Warsong Gulch and Arathi Basin has been lowered; they are now available for use at Friendly and Honored, respectively. \n    * Consecration and other similar spells can no longer be used by non-PvP flagged players to damage PvP flagged enemies.\n    * Racial &quot;Leaders&quot; have been strengthened, and are now worth slightly less honor.\n    * Players may no longer purchase items that require a PvP rank unless they meet the rank requirement at the time of purchase. \n\nDruids\n\n    * Improved Starfire - The stun effect can now be resisted.\n    * Druids should now be able to shapeshift back into caster form while Feared.\n    * Cat Form - The base weapon damage of the form has been increased.\n    * Cat Form - Each point of agility now adds 1 attack power.\n    * Cat Form - Rip's damage per combo point has been increased.\n    * Cat Form - Ferocious Bite's damage per combo point has been increased. In addition, extra energy now converts to damage at a higher rate.\n    * Cat Form - Replaced global cooldown on Tiger's Fury with a 1 second self cooldown. In addition, its duration has been increased to 6 seconds.\n    * Cat Form - Rake's damage has been increased.\n    * Entangling Roots now shares the same duration in pvp as other long-duration forms of crowd control (ie: polymorph, fear, sap). \n\nHunters\n\n    * Due to significant talent changes, Hunters will have all talent points refunded and can be respent. Training costs for all talent spell/ability replacements have been significantly reduced.\n    * Survival and Beast Master talent trees have undergone major revisions in an effort to give Hunters additional, viable choices when selecting talents.\n    * Deterrence - Will now increase parry chance when using Fist Weapons.\n    * Deflection - Will now increase parry chance when using Fist Weapons.\n    * Improved Concussive Shot - The stun effect can now be resisted.\n    * Trueshot Aura - Attack Power and Ranged Attack Power bonus increased, mana cost decreased, area of effect increased.\n    * Frost Trap - Updated tooltip to reflect duration of the Frost Trap Effect.\n    * Aimed Shot - Fixed tooltip to correctly display shot time.\n    * Auto Shot - Fixed a bug where switching targets would cancel Auto Shot. Switching targets should now continue firing on the newly acquired target.\n    * Scatter Shot - Should now cancel combat mode when used.\n    * Eyes of the Beast - Cast time reduced.\n    * Flare - Fixed the tooltip to accurately reflect the actual radius of the effect.\n    * Ranged Weapon Specialization - Now affects all ranged weapon attacks (e.g. Arcane Shot).\n    * Improved Concussive Shot - Will now have a chance to stun targets that are afflicted with other slowing effects (e.g. Wing Clip).\n    * Hawk Eye and Barrage have swapped locations, and we added 1 more rank to Barrage.\n    * Freezing Trap now shares the same duration in pvp as other long-duration forms of crowd control (ie: polymorph, fear, sap).\n    * The resist rate for hunter traps is now based on the hunter's skill rather than the level of the trap.\n    * Pet Abilities\n          o Hunters now have the first round of pet customization available. New passive abilities include increased armor, stamina, Fire resistance, Frost resistance, Nature resistance, Shadow resistance, and Arcane resistance.\n          o All Hunter pets have their abilities unlearned. Training points have been fully refunded. (Abilities the Hunter has learned to teach their pets have not been lost. For example, if you have the ability to teach your pets &quot;Claw 3&quot;, you will still be able to do so in this patch. However, your pet will have to be taught this ability again by using the Beast Training interface.)\n          o Hunter pets can now be untrained of all their skills from any beast trainer in the major cities. Similar to talents, untraining a specific pet scales up as you do it more times: 10 silver, 50 silver, 1 gold, 2 gold, 3 gold, etc., eventually stopping at 10 gold.\n          o Training point costs for all abilities have been rebalanced. You'll now be able to use all your pet's training points with meaningful choices. To help make &quot;hunting&quot; pets more viable in more situations, the Growl ability is now free to all pets.\n          o Hunter pets can now learn a maximum of four active abilities. Active abilities include Claw, Bite, Dash, Dive, Cower, Prowl, Screech, Scorpid Poison, Growl, and Furious Howl.\n          o Bats, owls, and carrion birds can now learn the Screech ability, a fast single-target attack that also lowers the attack power of all enemies within melee range of the pet.\n          o Cats can now learn Stealth. In addition to being unseen, they receive a damage bonus for their first attack coming out of stealth.\n          o Scorpids can now learn Scorpid Poison. The poison deals Nature damage over time and stacks up to five times on a single enemy.\n          o Wolves can now learn Furious Howl. The howl adds a flat amount of damage to all nearby party member's next attack (within 15 yards). \n    * Hunter pets now gain experience based on the level difference between them and their target rather than the difference between the Hunters and their target. This will make it much easier to level up a low level pet. Keep in mind that the Hunter must still kill creatures from which he/she will gain experience.\n    * The tooltips for quick Hunter shots have been updated to show them as instant abilities.\n    * Feign death is no longer resisted by players.\n    * Hunters are now able to name their pets while mounted.\n    * Hunter's pets will be smarter about when to use Dash/Dive.\n    * Fixed bug where Aimed Shot wouldn't cancel properly when the target moves out of range.\n    * Fixed a bug where lower level versions of Immolation Trap and Explosive Trap were being resisted more than they should be. \n\nPaladins\n\n    * New Spell: Hammer of Wrath (Level 44) - Hurls a hammer that strikes an enemy for Holy damage. Only usable on a wounded target.\n    * Blessing of Sacrifice no longer shares damage with dead Paladins (You can no longer kill Paladin Ghosts).\n    * Paladins can no longer activate Divine Favor on the previously cast healing spell.\n    * Seal of the Crusader - Fixed a bug that displayed the incorrect amount of attack power increased by ranks 2, 3 and 5 of the spell. \n\nPriests\n\n    * Focused Casting - Mana cost removed. Now no longer triggers the global cooldown on all other spells.\n    * Vampiric Embrace - Now heals 20% of the damage actually caused (including critical hits, buffs etc...) but now only heals when shadow spells cause the damage.\n    * Switching to Shadow Form no longer cancels Holy buffs on a priest.\n    * You can cancel melee combat while mind controlling by clearing the target, like you can normally.\n    * Blackout - Fixed a bug where rank 2 of the talent wasn't giving a chance to stun. \n\nRogues\n\n    * Riposte - Will now initiate combat when used.\n    * Deflection - Will now increase parry chance when using Fist Weapons.\n    * Mace Specialization - The stun effect can now be resisted.\n    * Shoot Bow/Gun/Crossbow - Should no longer cause a global cooldown on all other abilities.\n    * The fire damage from the Blazefury Medallion and the Gutgore Ripper's effect should no longer immediately break Gouge.\n    * Riposte - Fixed a bug where the ability was not usable when a special attack (e.g. Gouge) is parried. \n\nWarlocks\n\n    * Inferno - The stun effect can now be resisted. Tooltip updated to reflect enslave duration after the initial summon.\n    * Spell Lock (Felhunter) - In addition to interrupting spellcasting, it will now silence the target for a short duration.\n    * Benefits received from the old Master Conjuror talent should now be removed on all Warlocks.\n    * Firestone - When a Firestone is equipped, it should no longer interrupt tradeskill creation.\n    * Demonic Sacrifice - All effects gained from sacrificing the pet should no longer be dispellable.\n    * Conflagrate - The Conflagrate spell is now instant cast. The damage and mana cost has been raised on all ranks of the spell.\n    * Fear will now cause creatures to flee immediately, even if they are already moving.\n    * Succubus pets will be smarter about when to use Seduction.\n    * Succubus pets can now autocast Lesser Invisibility.\n    * Fixed a bug where Fear and Curse of Recklessness, when used together, would prevent targets from casting spells.\n    * Fixed a bug where Soul Link and Power Word: Sheild, when used together, would heal the Warlock instead of splitting or absorbing damage.\n    * Demon Armor - The armor increase will now stack together with Scrolls of Protection.\n    * The Improved Drain Mana talent no longer does additional damage from plus damage items. This bonus damage was unintended and was a bug. \n\nWarriors\n\n    * Deflection - Will now increase parry chance when using Fist Weapons.\n    * Retaliation - Will now cause a maximum of 30 retaliatory strikes in 15 seconds. In addition, retaliatory strikes will not be possible while stunned.\n    * Improved Revenge - The stun effect can now be resisted.\n    * Mace Specialization - The stun effect can now be resisted.\n    * Retaliation, Recklessness and Shield Wall will no longer be cancelled if you switch stances while the effect is active.\n    * Shield Slam - Threat caused increased.\n    * Shoot Bow/Gun/Crossbow - Should no longer cause a global cooldown on all other abilities.\n    * Sweeping Strikes will now ignore dead targets, and will ignore PvP enabled targets if you are not PvP enabled \n\nItems\n\n    * We have determined that the defense statistic was being applied to items too liberally, causing those items to be stronger than they should have been relative to other items of the same level with different effects. As a result, we have reduced the amount of defense points on all items with bonuses to defense by approximately 33% in order to bring those items in line with other similar items.\n    * Proficiency Bonuses have been added to the game. Some sets of equippable items have been added that will give bonus effects to the player only if they have a specific skill, such as Leatherworking.\n    * With the new ability to train Hunter pets with considerable magical resistance, the amount of pet resistance granted by the set bonuses for the Giantstalker's and Dragonstalker's has been reduced while the pet health granted has been increased.\n    * The Earthfury set bonus that increases the range of totems now works with the Mana Tide Totem.\n    * The Giantstalker's set bonus that increases Volley damage now works properly.\n    * The Lawbringer Paladin Set's Healing Circle effect now only affects your party, but the range of the heal has been increased to 30 yds.\n    * The pants and gloves for the Dreadmist, Magister's and Devout sets have had their Agility removed, and other statistics slightly increased.\n    * The free mana cost buff provided by the Mage's Netherwind armor set is now called &quot;Netherwind Focus&quot; and will be noted in your combat log.\n    * The effect of the Judge's Gavel has been changed to a stun.\n    * Flarecore Gloves now bind when equipped.\n    * Flarecore Leggings and Robe now provide a damage bonus to all spells, not just fire spells.\n    * The duration of the Bonereaver's Edge weapon debuff has been lowered, but the frequency of the effect has been raised.\n    * The Polychromatic Visionwrap is now a cloth item with durability.\n    * The Searing Needle's proc will now do the listed damage of the tooltip.\n    * The Unstoppable Force now has a short duration stun instead of a knockback effect, and the stun will occur less frequently.\n    * Changing stances no longer removes the Orb of Deception effect.\n    * When you have more than one transformation aura (Orb of Deception, Noggenfogger, etc.), the last one applied is the one that is shown.\n    * Several of the Molten Core Epic Weapons have been updated with new weapon glows.\n    * Totems affected by the Earthfury set bonus no longer have their effect flicker when players are outside their normal radius.\n    * Fixed bug preventing several items, such as the Goblin Jumper Cables, from being gift wrapped.\n    * Fixed bug where equipping and unequipping set items and other items with the same bonus as the set bonus could reduce the affected stats twice until logout.\n    * Sayge's Dark Fortune of Resistance now adds +25 to all schools instead of +10%.\n    * PvP reward gloves that grant stealth detection have had the detection reduced somewhat.\n    * There are now items in the game that have a duration on them that is measured in real time. For instance, there are fish that have a four-hour duration; they only last four hours regardless of whether or not the character is logged in.\n    * Alterac Valley Spring Water now has a minimum level of 55.\n    * The Lobotomizer's proc name has been changed to &quot;Brain Damage&quot;.\n    * Corrected the art for the Nether-lace Tunic.\n    * The Marshal's Lamellar Legplates now have the proper strength bonus.\n    * The Fire Runed Grimoire and Darkmoon Card: Heroism are now properly considered armor items.\n    * The spirit buff from Bottled Alterac Spring Water should now work for shapeshifted druids.\n    * The Marshal's Silk Gloves now has the Mana Shield improvement effect.\n    * The effect tooltips for The Black Book, Gutgore Ripper, and Natural Alignment Crystal now properly list their duration.\n    * Scout's Blade now properly sheathes at the hip.\n    * A few items in the Alliance PvP Rogue and Druid sets were previously misnamed, this has been corrected.\n    * The Cenarion and Earthfury Vestments now have proper durability values.\n    * The Sergeant Major's Silk Cuffs and First Sergeant's Silk Cuffs now have the same amount of stamina.\n    * The stun from the Tidal Charm trinket no longer breaks when damage is dealt to the stunned target.\n    * The Fade effect on the Stealthblade will no longer trigger the cooldown for the Rogue's Feint ability.\n    * The effect of Black Amnesty will now be noted in the combat log.\n    * Rethban Ore, Black Diamonds, and Pristine Black Diamonds may now be found in the Miscellaneous Junk category of the Auction House.\n    * Blue Wedding Hanbok name changed to reflect the actual color of the dress.\n    * The minimum level 48 Lorekeeper's Ring and Advisor's Ring now properly consider their effects to be passive.\n    * Hair should no longer stick through the Helm of Endless Rage.\n    * Key to the City is now considered Uncommon loot.\n    * The Amulet and Orb of the Darkmoon have had their stats improved and are now Epic (purple).\n    * Fishing poles which provide the same bonuses as lures now get the extra bonus from the lure when it is applied.\n    * Fixed bug where moving enchanted weapons from one hand to the other would remove the equipped enchantment benefit.\n    * Fixed bug where swapping two equipped trinkets would remove one of the trinket's passive effects.\n    * Night Dragon's Breath can now be used while silenced.\n    * Texture for the Dragon's Touch wand corrected.\n    * Bind on Equip Bracers and Belts in Molten Core now drop more often.\n    * Cenarion Helm texture fixed.\n    * Invulnerable Mail changed to a lower duration effect, but your own melee swings will not interrupt the invulnerability.\n    * All item based self heals will no longer be effected by equipment that provides bonuses to healing. This change affects both the Arcanite Champion and the Crusader Enchantment. \n\nPets\n\n    * You can now modify the auto-cast status of pet spells in the pet spellbook. \n\nProfessions\n\n    * New crafted sets have been added that require reagents found only in Zul'Gurub or through the reputation gained from adventuring therein.\n    * Only spells and abilities that target enemy units will cancel the World Enlarger effect.\n    * Black Lotus is no longer soulbound.\n    * Blackfury and Black Amnesty now bind when equipped.\n    * Catseye Goggles have had their stealth detection increased somewhat.\n    * The Mooncloth Robe pattern changed so it displays as white quality instead of blue since it is vendor purchased.\n    * The Effects of Flasks will now persist through death.\n    * Free Action potions can now be dispelled.\n    * Wildvine potions have been improved.\n    * Dreamless Sleep potions now take full effect in 12 seconds instead of 15.\n    * There is now a Horde cooking recipe that uses Tender Crocolisk Meat found at Brackenwall Village.\n    * Dark Iron Boots have been added as Blacksmithing plans that require Exalted reputation with the Thorium Brotherhood.\n    * Timbermaw Reputation Recipes are no longer sold in limited quanities with a restock time. If you have the reputation, you will always be able to buy the recipe.\n    * Significantly more Stranglekelp has started washing ashore to the beaches of the world.\n    * Dark Iron mineral nodes will now sometimes appear in the Burning Steppes and Searing Gorge.\n    * Enchanting an item with an enchantment that will cause the item to become soulbound will now prompt the enchanter with a warning message before the enchantment is cast.\n    * The Gnomish Death Ray now only can be cast if the target is within 20 yards. Previously you could cast this on players outside that range, even though the spell immediately failed.\n    * Cured Rugged hides now stack to 10 instead of 5. \n\nQuest\n\n    * A great number of quests and events added to Zul'Gurub.\n    * A level 50 class quest has been added for the Rogue (Lord Ravenholdt in Ravenholdt Manor), Priest (Ogtinc in Azshara), Mage (Archmage Xylem in Azshara), and Hunter (Ogtinc in Azshara).\n    * Reputation gains given to a player on the Alliance, Horde, or Steamwheedle Cartel factions directly will now cascade down to member factions through the middle of the Exalted reputation level.\n    * The summoning crystals of Andorhal have been removed; as a result, Araj the Summoner will behave like a normal spawn. The respawn time on Araj once he is slain is 10-15 minutes. It should be noted that the spawns surrounding where he holds dominion have been maintained; players seeking to defeat him should not be shy about bringing friends with them.\n    * Araj the Summoner now has increased hit points and does increased melee damage.\n    * Araj the Summoner no longer drops a Corruptor's Scourgestone 100% of the time when killed.\n    * The text for the Horde and Alliance versions of &quot;Araj's Scarab&quot; now reflect the changes done to the Araj encounter.\n    * The text for the Horde and Alliance versions of &quot;Alas, Andorhal&quot; now reflect the changes done to the Araj encounter.\n    * The Argent Dawn quest &quot;The Active Agent&quot; now offers a choice of rewards: Seal of the Dawn and Rune of the Dawn. Both may be used just like an Argent Dawn Commission.\n    * Players seeking to replace their Seal of the Dawn (or get a Rune of the Dawn instead) once they've finished &quot;The Active Agent&quot; quest should speak with Betina Bigglezink in Eastern Plaguelands.\n    * The Seal of the Dawn is now unique, no longer has any cash value, and is no longer disenchantable.\n    * The level 5 quests had the ranged weapon removed from their reward options. This was done to make sure hunters upgrade their melee damage in the levels before obtaining a pet.\n    * Added text to the Test of Endurance quest to indicate you might need to bring some friends along.\n    * The amount of XP and Stormwind reputation has been increased for completing &quot;Hilary's Necklace&quot; quest.\n    * Torek in Ashenvale (the questgiver for Torek's Assault) is now PvP enabling.\n    * Important Blackrock Documents for the Horde quest, &quot;Warlord's Command,&quot; no longer despawn. They can still randomly spawn at one of four locations.\n    * Two new quests have been added to Thorium Point in the Searing Gorge for Thorium Brotherhood reputation turnin for players with neutral faction. You will now be able to turn in Iron and Heavy Leather to increase your reputation with the Brotherhood.\n    * &quot;The Darkreaver Menace&quot; quest has had its reward improved; any Shaman who has already completed the quest should speak to Sagorne Creststrider in Orgrimmar to get their new reward.\n    * The Boulderslide Ravine quest in Stonetalon Mountains now more clearly points players to the Boulderslide Ravine.\n    * The original Hakkar quest (the one that involved killing Hakkar's Avatar in the Sunken Temple) has been extended, and now offers a reward.\n    * Completing the initial Magram or Gelkis quest in Desolace now gives appropriate positive and negative reputation gains.\n    * The completion dialogue for the &quot;A Rogue's Deal&quot; quest has been clarified.\n    * All 8 versions of the &quot;A Donation of Runecloth&quot; quest have had their quest text clarified.\n    * Certain mobs and NPCs that erroneously had plus or minus reputation gains on kills for Horde or Alliance have been corrected.\n    * Various quest typos fixed. \n\nRaids and Dungeons\n\n    * Characters will now receive an error when attempting to enter a raid dungeon if the reason they cannot enter is because they are not in a raid group.\n    * Fixed a bug that was preventing Rallying Cry of the Dragon Slayer to fire when Onyxia's head was turned in (assuming a head was not already up).\n    * You can now no longer avoid Onyxia's confuse effect by jumping or moving erratically.\n    * Death Knight Darkreaver in Scholomance shouldn't be so noisy anymore.\n    * The Ogre Tannin Basket in Dire Maul should stick around longer if someone opens it and does not initially loot the tannin from it.\n    * A few Molten Core bosses now drop Fiery or Lava Cores. \n\nUser Interface\n\n    * New &quot;Dressing Room&quot; Interface now available! If you control-left click on any item, item reference (vendors, quests) or item link (chat), a UI panel will appear showing your character wearing that item. You can then use the same command (control-left click) on additional items to add to the preview appearance. In addition, the Auction House now has a checkbox in the upper right-hand corner; if checked, any item you click on within the Auction House will automatically be previewed on your character.\n    * Need Before Greed and Group Loot options have been improved. The rolling window that appears when an item of the threshold and above is looted now has three buttons: a Need button (the dice), a Greed button (the coin), and a close button. Any players who select Need will get a chance to roll first for the item, with the high roller winning. If no one selects Need, all characters who selected Greed will then roll, with the highest roll winning the item. If everyone closes the window, the item becomes lootable by anyone in the group.\n    * You can now disable the slow scrolling of text when you are receiving a new quest.\n    * Opening the overhead map will now &quot;ping&quot; your location your map (to make it easier to notice your location when there are many friendlies nearby on the overhead map).\n    * The overhead map now displays a directional icon for your character.\n    * Spell effects that stack multiple times on a character will now display a number in the bottom corner indicating how many times the effect has stacked. For example, if a player has had the Sunder Armor ability used on them three times, the Sunder Armor effect icon will display a 3 in the corner.\n    * A confirmation dialog is now shown when you choose to make an Inn your home.\n    * The tooltip for spells like Seal of the Crusader correctly reflects the benefit of the spell, instead of occasionally being off by one.\n    * Using /random will now send the text to your party or raid wherever they are instead of the local area around the player that used /random.\n    * When in a raid group, the group you are in will now appear above your name next to your portrait.\n    * Mail recipient name completion now works with offline guild members even if you are not showing them in the guild UI.\n    * Guild ranks and player notes are now filtered by the profanity filter.\n    * The temporary mana cost reduction of Burst of Knowledge and similar effects is now reflected in tooltips.\n    * Quest rewards are now linked in chat like other items gained.\n    * You can auto-equip items while in flight by right clicking on them, as you would normally.\n    * You can now use the Escape key to exit out of pop up dialogues.\n    * Fixed bug preventing the Release Spirit dialog from showing if you die while jumping in lava.\n    * Fixed lua error when relinking poor and standard quality items from loot messages.\n    * Consumable items on the action bar will now always show the number remaining, even if there are none in your inventory.\n    * You can create the directory InterfaceIcons, and any 32x32 .blp or .tga files you put in there will be available in the icon list for your macros.\n    * Pet spells in macros are now supported, both using /cast and using CastSpellByName().\n    * If you omit the rank of a spell in /cast or CastSpellByName(), it will use the highest rank of the spell which you know.\n    * While it will still be possible to override files in Interface/FrameXML, doing so is discouraged (and is likely to become impossible in a future release). Significant API additions are being made to eliminate the need for such direct FrameXML changes.\n    * You will now be able to list .lua files directly in the addon .toc file.\n    * The SetPoint() and SetAllPoints() script functions can take an actual frame instead of a frame name.\n    * TargetNearest* script functions will only work in response to a button click or a key binding, to discourage addons which scan the battlefield for targets.\n    * Addon-specific Saved Variables!\n          o Each addon's saved variables will be saved in the file WTFAccount{accountname}SavedVariables{addonname}.lua, and will only be loaded when the addon is loaded.\n\n            IMPORTANT: The first time you enter the game with this change, you must make sure all your addons are enabled, or their saved variables will be lost! If you accidentally do this once, you can recover by quitting the game, moving your backup SavedVariables.lua into place and restarting the game with addons enabled.\n\n    * Addon Loading On Demand!\n          o If you add the following line to your addon's .toc file, it will not be loaded at the normal load time, it will instead be dynamically loaded upon request:\n\n            ## LoadOnDemand: 1\n\n            You can query to see if an addon is loaded by using the new IsAddOnLoaded(&quot;addonname&quot;) function, and you can load an addon dynamically using the LoadAddOn(&quot;addonname&quot;) function. This function returns true if the addon is loaded successfully, and can be safely and efficiently called even if the addon is already loaded.\n\n            For your convenience, the function UIParentLoadAddOn(&quot;addonname&quot;) is provided which will attempt to load the addon and pop up an error message if it failed to load for any reason.\n\n            Once an addon is loaded, the ADDON_LOADED event is sent, with arg1 set to the name of the addon. An addon can listen for that event, and when it recieves that event with it's own name, it can safely access its saved variables.\n\n            An important thing to note is that when an addon is loaded dynamically, it doesn't have access to any of the virtual frame templates that are defined by FrameXML, including font definitions.\n\n    * New Scripting Functions\n          o debugprofilestart() - starts a timer for profiling during debugging.\n          o millis = debugprofilestop() - return the time in milliseconds since the last call to debugprofilestart() \n    * New UI Element Member Functions\n          o handlerFunction = Frame:GetScript(&quot;handler&quot;) - (for handlers like &quot;OnShow&quot;, &quot;OnEnter&quot;, etc) which returns the current event handler for a frame.\n          o Frame:SetScript(&quot;handler&quot;, function) - sets the action/event handler for a frame (or removes it with a nil function)\n          o Frame:SetBackdrop(nil) / Frame:SetBackdrop({bgFile = &quot;bgFile&quot;, edgeFile = &quot;edgeFile&quot;, tile = false, tileSize = 0, edgeSize = 32, insets = { left = 0, right = 0, top = 0, bottom = 0 }}) (Note: This is a table argument)\n          o FontString:SetFont(&quot;font&quot;, size [, &quot;flags&quot;]).\n          o StatusBar:SetStatusBarTexture(&quot;file&quot; [, &quot;layer&quot;])\n          o lines = ScrollingMessageFrame:GetMaxLines()\n          o ScrollingMessageFrame:SetMaxLines(lines)\n          o ScrollingMessageFrame:EnableFading([isEnabled]) (Defaults to true)\n          o ScrollingMessageFrame:SetFadeDuration(seconds)\n          o ScrollingMessageFrame:SetTimeVisible(seconds)\n          o ScrollingMessageFrame:Clear()\n          o lines = EditBox:GetHistoryLines()\n          o EditBox:SetHistoryLines(lines)\n          o EditBox:SetIgnoreArrows([isIgnored]) (Defaults to true)\n          o r,g,b,a = FontString:GetTextColor()\n          o Frame:SetParent(nil, or &quot;parent&quot; or parentFrame)\n          o numChildren = Frame:GetNumChildren()\n          o child1, child2, child3, ... = Frame:GetChildren() \n    * Addon Saved Variables\n          o SavedVariables will no longer drop stored numbers to single precision.\n          o Infinite/Nan values no longer cause corrupted SavedVariables.lua file. (Written as nils with comment) \n    * Chat and Combat Logging\n          o The script functions ChatFrameLog() and ToggleCombatLogFileWrite() are obsolete.\n          o Added script function: isLogging=LoggingChat([newState]) (Returns new state (or current state if no argument))\n          o Added script function: isLogging=LoggingCombat([newState]) (Returns new state (or current state if no argument))\n          o New slash command /chatlog toggles chat logging (/combatlog toggles combat logging)\n          o The file for the chat log is LogsWoWChatLog.txt and the file for the combat log is LogsWoWCombatLog.txt\n          o Chat and combat log files will be appended to rather than overwritten.\n          o You now receive combat log messages and damage feedback when you are being attacked by creatures you can't see.\n          o If you call a tamed Deepmoss Hatchling, you are no longer notified that you hatched.\n          o Fixed disconnection caused by relinking an item in a different locale than that of your client.\n          o Looted items now always show their names in the appropriate quality color.\n          o You now get combat feedback when you take damage from unseen opponents, like the Unseen in Raven Hill.\n          o Fixed damage display on the character sheet when you have Fury of the Frostwolf or Stormpike's Salvation. \n\nWorld Environment\n\n    * The Ranazjar Isle sub-area has been added off the northwest coast of Desolace. The Ranazjar Isle puzzle piece now properly pops when you venture there.\n    * Entering the zeppelin towers at Durotar and Grom'gol Base Camp no longer incorrectly flags you as being in the Valley of Strength.\n    * Argent Dawn, Timbermaw, Zandalar and Arathi Basin vendors now show you their entire inventory regardless of current reputation, allowing players to peruse their full range of wares. The items in question now require the appropriate reputation level to make use of them.\n    * Some of the ship and zeppelin paths have been modified.\n    * Gor'tesh and Grol the Destroyer should no longer stay in evade mode indefinitely.\n    * A new inn has been added to the Grom'gol Base Camp in Stranglethorn Vale at the base of the zeppelin tower.\n    * The Champion's Hall and the Hall of Legends have new load screens.\n    * Some Horde quest NPCs were moved to new locations to promote more intuitive quest flow: Storm Shadowhoof who was previously at Bloodvenom Falls in Felwood has been moved to Everlook. Witch Doctor Mau'ari who was previously in Orgrimmar has been moved to Everlook.\n    * Scorpids above level 10 now drop more valuable parts than they did previously.\n    * Rare Felwood creatures should now have loot.\n    * Twilight's Hammer creatures in Silithus can now be pickpocketed.\n    * Zone bound items, such as the Gordok Courtyard Key, will no longer leave your inventory if you are a ghost outside their intended zone. Reviving in a zone outside the item's listed zone binding will still cause the item to disappear, however.\n    * Pelturas Whitemoon's faction has been fixed; the NPC is now properly associated with Darnassus.\n    * Narm Faulk is now a part of the Ironforge Faction.\n    * Hadoken Swiftstrider now has gossip text.\n    * Ferra can now be skinned.\n    * Fixed a typo in Ogunaro Wolfrunner's greeting to those who are not yet friendly with Orgrimmar.\n    * Fixed a typo on a signpost in Western Plaguelands.\n    * Sayge's buffs at the Darkmoon Faire are now exclusive to one another.\n    * Onyxia no longer teleports from point to point while flying. \n","torrent":{"xt":"urn:btih:29d8d37df93b35902f72496a6015c6c3dc5e4423","amp;dn":"WoW-1.6.1.4544-to-1.7.0-enGB-patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d8d37df93b35902f72496a6015c6c3dc5e4423","infoHashBuffer":{"type":"Buffer","data":[41,216,211,125,249,59,53,144,47,114,73,106,96,21,198,195,220,94,68,35]},"announce":[],"urlList":[]}}