{"title":"Fei Fei - Cybervenus (another japanese VR celebrity)","uid":3305047,"size":214115997,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:2b637e13905e5158ac5918af698f84d6d404623f&amp;dn=Fei+Fei+-+Cybervenus+%28another+japanese+VR+celebrity%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Frezzno","files":9,"time":1111503998,"description":"Another release from Escapi back in 2002. This girl is much better rendered then Yuki Terai, this girl looks more natural (not...).\n\nThere are six parts in total and the plot seems to be linked together, but I don't understand it anyway. It's like they're trying to teach her to become something. Also, unlike Yuki Terai, Fei Fei doesn't seems to have any musicvideos.\n\nIt was a waste of time for me to look at this movie. But if you want to know what kind of a taste the japs have or you just wanna take a look for educational perposes or you really like these kind of stuff then you go a head.\n\nNOTE: I don't dislike japanese in any ways and I sure hope that they don't dislike me because of me making a point about their taste. We all got different taste and that's why this world is so wonderful. To have many options to choose from. (Besides, I think they think we got wierd taste otherwise these kind of stuff wouldn't have been made in the first place. Or just that the real thing isn't exciting enough.)\n\nFor more info about Fei Fei:\n\nhttp://www.escapi.com/default.asp?target=fuji_new\n\nOr just make a Google search and you'll find a lot of stuff about her.\n\nThis package includes english and swedish subs.\n\n/Frezzno","torrent":{"xt":"urn:btih:2b637e13905e5158ac5918af698f84d6d404623f","amp;dn":"Fei+Fei+-+Cybervenus+%28another+japanese+VR+celebrity%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b637e13905e5158ac5918af698f84d6d404623f","infoHashBuffer":{"type":"Buffer","data":[43,99,126,19,144,94,81,88,172,89,24,175,105,143,132,214,212,4,98,63]},"announce":[],"urlList":[]}}