{"title":"The Goat Horn (1972)","uid":3278619,"size":734741899,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2bfd29f3dd841fd00132cb9bac94a09ff506c9ad&amp;dn=The+Goat+Horn+%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Palio","files":3,"time":1106089284,"description":"Four hoodlums break into the house of the shepherd Karaivan, raping and killing his wife. A young shepherds daughter became the eyewitness of the raping and death of her mother. Karaivan decides to take the law into his own hands and becomes enslaved by his violent wish for revenge. He cuts the hair of his daughter Maria, dresses her in man's clothes and raises her as a boy so that she can kill in cold blood. The goat horn becomes a symbol of revenge. After 9 years she found the four violators and manages to kill three of the men with goat horn, but before killing the last one, in the rich oriental house Maria becomes the unwitting witness of a love scene and change comes over her. From time to time she secretly dons a beautiful women dress and exults in her newly found female identity. She felt in love with young shepherd and the hate melted in her heart. When Karaivan discovers the change that is taking place in her it is already late. He tries to bring her back to the revenge by killing the young lover. The father sets him hut on fire, but without suspecting it, kills the daughter who is also there.\n\n* Seeding will be in the evenings ... sorry this is the only way I can.","torrent":{"xt":"urn:btih:2bfd29f3dd841fd00132cb9bac94a09ff506c9ad","amp;dn":"The+Goat+Horn+%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bfd29f3dd841fd00132cb9bac94a09ff506c9ad","infoHashBuffer":{"type":"Buffer","data":[43,253,41,243,221,132,31,208,1,50,203,155,172,148,160,159,245,6,201,173]},"announce":[],"urlList":[]}}