{"title":"A Few of ChrisGoes(Rocks)Â´s Favourite Rock Albums 1965-76","uid":3417188,"size":543705107,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c5343aaa524715efc406d5536e923689b5719a3&amp;dn=A+Few+of+ChrisGoes%28Rocks%29%C2%B4s+Favourite+Rock+Albums+1965-76&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ChrisGoes","files":79,"time":1133686131,"description":"Size: 518 MB\nBitrade: 256\nmp3\nRipped By: ChrisGoes(Rock)\nArtwork Included\nTracker: tracker.prq.to/announce\n\n*************************************************************************\n\nhttp://img207.imageshack.us/img207/6198/namnlst1kopiera3fh.jpg\n\n*************************************************************************\n\nThe Vagrants - The Great Lost Album (Leslie West) (1965 - 1968)\n\nMost famous for featuring Leslie West on guitar in his pre-Mountain days, \nthe Vagrants were extremely popular in their home base of Long Island, NY in the mid-'60s, and recorded some decent singles without approaching a national breakout. Like fellow New Yorkers the Rascals, the Vagrants prominently featured a Hammond organ, and often played soul-influenced rock. The Vagrants were far more\nguitar-based than the Rascals, however, as well as projecting a more garagey, less mature outlook; their later material lands somewhere between the Rascals and Vanilla Fudge.\n\nOne of the few rock bands signed to the folkie Vanguard label, the Vagrants cut some fair singles between 1965 and 1968 that suffered from a lack of identity: a Zombie-ish number here, a punk stomper there, a soul-rock thing here. &quot;I Can't Make a Friend,&quot; which shows up on some garage compilations, is the most well-known of their initial efforts, but the group took their closest swipe at stardom after Felix Pappalardi helped them sign to Atco.\n \nA rock version of Otis Redding's &quot;Respect&quot; (which surfaced on the Nuggets compilation) was a hit in some Eastern regions, but couldn't compete with Aretha Franklin's rendition, also released in 1967. After a couple of other singles on Atco, the group broke up in late 1968, when West formed Mountain (which also included Pappalardi). Much of the Vagrants' material \nwas reissued in the mid-'90s.\n\n01 - Respect (1967)\n02 - I Can't Make a Friend (1967)\n03 - Beside the Sea (1967)\n04 - I Don't Need your Loving (1967)\n05 - Young Blues (1966)\n06 - And When it's Over (1967)\n07 - A Sunny Summer Rain (1967)\n08 - The Final Hour (1966)\n09 - My Babe (1966)\n10 - I Love You, I Love You (1967)\n11 - Oh Those Eyes (1965)\n12 - You're Too Young (1965)\n13 - Your Hasty Heart (1966)\n14 - Satisfaction (1968) (((Outstanding Version)))\n\n*************************************************************************\n\nTruth And Janey - Erupts (Superb Hardrockers Live Performance 1976)\n\nThe Truth and Janey sound is probably captured best on this live record. It's a mix of classic rock, psychedelic guitar rock reminiscent of Hendrix, and the progressive structures of a band like Budgie. Lots of jammy parts, some of them heavier than others of course. Some of it reminds me of the same kind of deep blues rooted 'Cream' material. Nice and heavy, but soulful and tastefully done.\n\nThis Truth and Janey CD shows that some things never change ? even in almost 30 years. This masterful live recording from April 8, 1976 at the Col. Ballroom in Davenport, Iowa showcases why bands today should be paying homage to Truth and Janey. They were laying down the heavy, slugging it out on the circuit, rolling off riff after riff, tasteful extended solo after solo? doing things their way, while thumbing their noses to the era of disco. \n\nSonically, this is the best kind of band sponsored live release. It sounds like a bootleg from an audience member, but a bootleg done off the soundboard after slipping the soundman a twenty. It?s clear, but it?s raw. Instruments are all at discernable levels, and vocals are spot on, but there?s a rough quality here that allows the listener to be taken back 28 years and dropped dead center in front of Bill Janey lighting up his stratocaster. I mean, if you like ?live? recordings that make you feel as if you were at the show, this one?s for you.\n\nAnd it?s funny how things don?t change much. This is the first live recording I?ve ever heard where the turnout was piss poor. I?m talking maybe 20 people at the show?!?!?! Not too different from many of the fuzz rock shows I?ve been to over the last few years. But this just added to the whole mystique of the recording. I found myself entertaining the question, who are these cats? How have I never heard this band before? When I think of 70?s underground rock, man, this band and live recording embody the 70?s. They are the real deal.\n\nMusically, they take all the influences of the day (Hendrix, Cream, Captain Beyond, etc.) and manage to create their own sound and unique songs. Bill Janey is a guitarist extraordinaire. Steve Bock?s bass playing would turn lesser players? fingers into pretzel knots. Dennis Bunce keeps time like a Rolex without the pretentiousness. Furthermore, I catch Marc Bolan/T. Rex warble in Janey?s vocals which is a plus in my book. \n\nAll in all, an excellent live recording that engages the listener as close to the live experience as possible. If you like the obscure, enjoy digging into the past, checking out a band that paved the way for good rock bands like Fu Manchu and Nebula, you will enjoy this. \n\n\nTruth and Janey are:\nBill Janey ? Guitars, Vocals\nSteve Bock ? Bass, Vocals\nDenis Bunce ? Drums, Vocals\n\nTrack Listing:\n\n1. No Rest for the Wicked\n2. Birth of the Heart\n3. Universal Light\n4. A Child\n5. Building Walls\n6. Tunnel of Tomorrow\n7. The Light\n8. One Down One to Go\n9. White Bread\n10. My Mind\n11. As I Am\n12. Ain?t No Tellin\n13. Hard Road\n\n*************************************************************************\n\nTucky Buzzard - Warm Slash (Superb Hardrock 1971)\n\nRecorded at the Chateau de Herrouville, Paris &amp; Olympic Studios, Barnes, London, 1971. All tracks written by Tucky Buzzard. The band had been touring Europe on a regular basis &amp; this album saw the start of their touring in the States with the likes of Uriah Heep &amp; Deep Purple. As usual, Bill produced the album &amp; flew to the States for the band's debut at 'The Whisky A Go Go' in Los Angeles. Old friends Black Sabbath also flew in from Florida to show support &amp;, of course, join the riotous party after the gig.\n\n1. Mistreating Woman    \n2. (She's A) Striker    \n3. Fill You In   \n4. Need Your Love   \n5. Which Way, When For Why   \n6. Burnin'    \n7. Heartbreaker   \n8. Sky Balloon   \n9. Aint Too Soon \n\n*************************************************************************\n\nTwentieth Century Zoo - Thunder On A Clear Day (US Fuzzy Bluesrock 1968)\n\nHailing from the same gila monster-infested Arizona desert wilderness that produced an unlikely harvest of fertile bands (Alice Cooper's Spiders, Kenn&amp;eacute;lmus, Phil &amp; The Frantics) the Twentieth Century Zoo were the paradigm of what was happening to music as 1966 blossomed into 1967-68. These Phoenix shroom-heads stirred the savage fuzzback-laced sounds of the garage generation into the brain-baking trippiness of the emerging SF ballroom scene and made a concoction all their own. Includes the entire scarce Vault-label album, obscenely rare early single sides, unissued cuts and more!\n\n1. You Don't Remember [Single Version]        \n2. Clean Old Man        \n3. Love in Your Face [Single Version]        \n4. Tossin' and Turnin'        \n5. Quiet Before the Storm        \n6. Rainbow        \n7. Bullfrog        \n8. Love in Your Face        \n9. You Don't Remember        \n10. It's All in My Head        \n11. Blues With a Feeling        \n12. Only Thing That's Wrong        \n13. Stallion of Fate        \n14. Country        \n15. Hall of the Mountain King        \n16. Enchanted Park  \n\n*************************************************************************\n\nZakarrias - Zakarrias (UK Psychedelic-Flavoured Heavy Rock) (1971)\n\nExact reissue of excellent rare early '70s Deram psych / prog. One of the more interesting albums on the label with powerful distinctive male vocals, heavy guitar, bass keyboards and string arrangements. A bit like T2 in places... certainly a grower....\n\n01 - Country Out Of Reach - 4.03\n02 - Who Gave You Love - 3.58\n03 - Never Reachin&amp;acute; - 4.55\n04 - The Unknown Years - 6.59\n05 - Sunny Side - 3.39\n06 - Spring Of Fate - 3.17\n07 - Let Us Change - 3.50\n08 - Don&amp;acute;t Cry - 4.11\n09 - Cosmic Bridge - 5.59\n\n*************************************************************************\n\n","torrent":{"xt":"urn:btih:2c5343aaa524715efc406d5536e923689b5719a3","amp;dn":"A+Few+of+ChrisGoes%28Rocks%29%C2%B4s+Favourite+Rock+Albums+1965-76","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5343aaa524715efc406d5536e923689b5719a3","infoHashBuffer":{"type":"Buffer","data":[44,83,67,170,165,36,113,94,252,64,109,85,54,233,35,104,155,87,25,163]},"announce":[],"urlList":[]}}