{"title":"Hospital.Kingdom.PDTV.XviD.Cap1y2-TWIM","uid":3383772,"size":796213248,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2cf945b2d909fa229859660cc8f341117fad3e0f&amp;dn=Hospital.Kingdom.PDTV.XviD.Cap1y2-TWIM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twim","files":2,"time":1126840544,"description":"***SPANISH AUDIO***\n\nSINOPSIS:\n\nEl escenario es un hospital construido sobre las ruinas de un molino incendiado en 1869, durante la guerra civil norteamericana, donde 200 trabajadores cos&amp;iacute;an uniformes para el ejercito. Todos los hombres y mujeres consiguieron escapar, pero la mayor&amp;iacute;a de los ni&amp;ntilde;os, que trabajaban en condiciones monstruosas, quedaron atrapados y murieron.\nAhora, en el Hospital Kingdom, entre electros, resonancias y la pr&amp;aacute;ctica de la m&amp;aacute;s alta cirug&amp;iacute;a, ocurren extra&amp;ntilde;os fen&amp;oacute;menos paranormales y los muertos vagan a sus anchas. \n\n&quot;Hospital Kingdom&quot; es la primera serie de televisi&amp;oacute;n que ha sido escrita y producida por el escritor estadounidense Stephen King y est&amp;aacute; basada en la miniserie &quot;Riget (The Kingdom)&quot;, del director dan&amp;eacute;s Lars Von Trier, quien tambi&amp;eacute;n est&amp;aacute; vinculado como productor junto a Mark Carliner, Richard Dooling, Bruce Dunn, Stephen King, Robert F. Phillips y Mary Anne Waterhouse.\n&quot;Hospital Kingdom&quot; est&amp;aacute; claramente influenciada, como se puede apreciar especialmente en algunos &quot;gui&amp;ntilde;os&quot; dentro de sus capitulos, por una desgraciada experiencia personal que tuvo Stephen King en 1999 en la cual estuvo al borde de la muerte siendo arrollado por una furgoneta que iba fuera de control, mientras paseaba por los alrededores de su casa en Maine, &amp;eacute;sto oblig&amp;oacute; al maestro del terror a estar durante varios meses hospitalizado.\nPrecisamente con este suceso da comienzo la serie, dando lugar a un relato aterrador con magnificos efectos visuales, donde se entrelazan fascinantes argumentos y una espectacular trama que te mantendr&amp;aacute; en vilo hasta el &amp;uacute;ltimo de sus 13 episodios.\nA todo esto se une una gran interpretaci&amp;oacute;n por parte de los actores intervinientes, entre los que cabe destacar, de los 22 personajes que en total intervienen en su reparto a: el doctor Hook (Andrew McCarthy), Sally Druse (Diane Ladd), el doctor Stegman (Bruce Davison), el doctor Jesse James (Ed Begley, Jr.) y a la ahora de moda gracias a su papel en Perdidos (Lost), Evangeline Lilly, quien interpreta a la novia de Benson.\nLa miniserie &quot;Hospital Kingdom&quot; est&amp;aacute; dirigida por Craig R. Baxley y no habr&amp;aacute; una segunda temporada pese haber sido un gran &amp;eacute;xito de audiencia en todos los paises donde se ha emitido como Argentina, M&amp;eacute;xico, Inglaterra o Estados Unidos","torrent":{"xt":"urn:btih:2cf945b2d909fa229859660cc8f341117fad3e0f","amp;dn":"Hospital.Kingdom.PDTV.XviD.Cap1y2-TWIM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf945b2d909fa229859660cc8f341117fad3e0f","infoHashBuffer":{"type":"Buffer","data":[44,249,69,178,217,9,250,34,152,89,102,12,200,243,65,17,127,173,62,15]},"announce":[],"urlList":[]}}