{"title":"Rainbow 1979 Down.To.Earth.(eac.ape).rar","uid":3275480,"size":231993895,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2db21f13515640afe33b25fc44baefd30d833065&amp;dn=Rainbow+1979+Down.To.Earth.%28eac.ape%29.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ritchie","files":1,"time":1105486735,"description":"The departure of Ronnie James Dio gave Richie Blackmore a chance to reinvent Rainbow, which he does to a certain extent on Down to Earth. Adding former Deep Purple collegue Roger Glover as bassist and vocalist Graham Bonnet, Blackmore tones down some of the excess of the Dio years, particularly in terms of fantastical lyrics, and turns to straight-ahead hard-rock, only occaisonally adorned by prominent synthesizers. In general, their material is fairly solid, and &amp;quot;Since You Been Gone&amp;quot; easily ranks among the band's best songs, but overall the record is a little generic and now sounds very much of its time -- namely, the late '70s, when album rock still ruled the arenas. Nevertheless, Rainbow has a distinct idea, primarily through the guitar artistry and mystical sensibility of Richie Blackmore. He sounds invigorated on the album, turning in muscular performances and strong solos on each cut; clearly, the reunion with has revitalized him. Unfortunately, Bonnet tends to oversell his vocals, screaming a little bit too often, but he doesn't distract from the fact that Blackmore, Glover and drummer Cozy Powell turn Down to Earth into a fine hard rock platter. It might not offer anything unique, but it delivers the goods.","torrent":{"xt":"urn:btih:2db21f13515640afe33b25fc44baefd30d833065","amp;dn":"Rainbow+1979+Down.To.Earth.%28eac.ape%29.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db21f13515640afe33b25fc44baefd30d833065","infoHashBuffer":{"type":"Buffer","data":[45,178,31,19,81,86,64,175,227,59,37,252,68,186,239,211,13,131,48,101]},"announce":[],"urlList":[]}}