{"title":"ToxicBIOS v1 3","uid":3309164,"size":791999,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3002958f1972af480b1b13a4849e67c115b593da&amp;dn=ToxicBIOS+v1+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrTLU","files":1,"time":1112214074,"description":"\t\t\t ÃœÃœÃœÃœÃœÃœÃœÃœ                                               \n                      Â°ÃœÃ›  Â°Â±Â° Â° Ã›ÃœÂ°                                            \n ÃœÃœÃœÃœÃœ Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â²Â°Â°Ã›  ÃŸÂ±Â°Â° Â°Â±ÃŸ  Ã›Â°Â° Ã›Ã›Ã›Ã›Â°  Ãœ  Ã›Ã›Ã›Ã›  Ã›Ã›Ã›Â² Ãœ   Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°      \n   Â²Â±  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°Ã› Â° Â°Â° Â°  Â°  Â° Ã›Â° Â°Ã›Ã›Ã›Ã›Â°   Â°Ã›Ã›Ã›Â°  Ã›Ã›Ã›Ã›  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â²Ã›Ã›      \n   Â±       Â°Â²Ã›Ã›Ã›Â°   Ã› Â°Â±Â°  Â°Â° Â°  Â°Â±Â° Ã›  Â°Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Â°   Ã›Ã›Ã›Ã› Â°Ã›Ã›Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Ã›Â°     \n        Â°   Â²Ã›Ã›Ã›    Ã›  Â° Â°Â±    Â±Â° Â° Â°Ã›   Â°Ã›Ã›Ã›Ã›Â°Ã›Ã›Ã›Ã›    Â²Ã›Ã›Ã› Ã›Ã›Ã›Ã›Ã›Â°              \n    Â° Â°Â±Â±Â°Â° Ã›Ã›Ã›Ã›   Â°Ã›Â°Â°Â±   Â°  Â°  Â°Â±Â° Ã›Â°   Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°    Â²Ã›Ã›Ã› Ã›Ã›Ã›Ã›Â°     Â°Â°Â°Â°      \n     Â°Â±Â²Â±Â±Â° Ã›Ã›Ã›Ã› Â° Â°Ã›Â±Â° Â° Â°Â±Â°Â°Â± Â°Â° Â°Â±Ã›Â° Â°  Â°Ã›Ã›Ã›Ã›Ã›Â°  Â°  Ã›Ã›Ã›Ã› Â²Ã›Ã›Ã›   Â°Â±Â±Â±Â±Â°Â±Â°     \n  Â° Â°Â±Â²Â²Â±   Ã›Ã›Ã›Ã›    ÃŸÃœÂ°    Â°Â±Â±Â°    Â°ÃœÃŸ  Â°  Â°Ã›Ã›Ã›Ã›Ã›Â°  Â±Â° Ã›Ã›Ã›Ã› Â²Ã›Ã›Ã›    Â°Â°Â±Â°Â±Â±Â±     \n   Â°Â±Â²Â±Â±Â²Â°  Ã›Ã›Â²Ã› Â°  Â°Ã› ÃŸÃ›Ã›Ãœ Â°Â° ÃœÃ›Ã›ÃŸ Ã›Â° Â±  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°    Ã›Ã›Ã›Ã› Ã›Ã›Ã›Ã›Â°  Â°  Â° Â°Â±Â±     \n   Â°Â°Â°Â°Â±Â°Â±Â° Ã›Ã›Ã›Ã›    Ã›  Â°Ã›Ã›Ã›Ã›  Ã›Ã›Ã›Ã›Â°  Ã›   Â°Ã›Ã›Ã›Ã›Â°Ã›Ã›Â²Ã›Â° Â± Ã›Ã›Â²Ã› Ã›Ã›Ã›Ã›Ã›Â°  Â°    Â°Â°     \n   Â±   Â° Â°  Ã›Ã›Â²Ã›  Â°  Ã›ÃŸ     Ã›Ã›     ÃŸÃ›   Â°Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Ã›Â°  Ã›Ã›Ã›Ã› Â°Ã›Ã›Ã›Ã›Ã›Â°             \n   Ã›  Â°     Ã›Ã›Â²Ã› Â°Â±Â° Â° Ã›Â° Â°ÃŸÃŸÃŸÃŸÂ° Â°Ã› Â°  Â°Ã›Ã›Ã›Ã›Â°   Â°Ã›Â²Ã›Ã›Â° Ã›Ã›Â²Ã› `Ã›Ã›Ã›Â²Ã›Ã›Ã›Â°Â°Ã›Ã›Ã›Ã›Â°     \n  Â±Ã›Â±       Ã›Ã›Â²Ã› Â°Â±Â±Â°  Â°Ã›Â° Â°Â±Â±Â° Â°Ã›Â°    Ã›Ã›Ã›Ã›Ã›  Â°  Ã›Ã›Â²Ã›Ã› Ã›Ã›Â²Ã›  Â°Ã›Ã›Ã›Â²Â²Ã›Ã›Ã›Ã›Ã›Ã›Ã›      \n Â±Ã›Ã›Ã›Â±      Ã›Ã›Ã›Ã›  Â°Â±Â±Â°  Ã›Â±Â° Â°Â° Â°Â±Ã›     Ã›Ã›Ã›Ã›Â° Â°Â±Â° Â°Ã›Ã›Ã›Ã› Ã›Ã›Ã›Ã›    Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°      \n  Â±Ã›Â±                   Â°ÃŸÃŸÃ›ÃŸÃŸÃ›ÃŸÃŸÂ°           Â²                                  \n   Ã›        Â±Â±Â±Â±                   Â°  Â°Â±Â±Â²Â±Â°Â²Ã›Â² Â°Â±Â±Â±Â±Â±Â° Â°Â±Â±    Â°Â±Â±Â±Â±Â±Â±Â±Â±Â±Â°      \n   Â±       Â°Â°Â²Â±Â°Â°       Â°Â±Â±Â±Â±Â±Â±Â±Â°      Â°Â±Ã›Â±Â±Â°Â² Â°Â±Â²Â±Â±Â±Â° Â°Â°Â²Â±   Â°Â±Â±Â²Â±Â° Â°          \n         Â°Â±Â±Â±Â±Â²Â±Â±Â±Â° Â° Â±Â°Â±Â±Â²Â²Â±Â±Â²Â±Â±Â°Â±Â°    Â²Ã›Â²Â±Â±Â±Â±Â±Â²Â±Â°     Â±Â²Â°Â° Â°Â±Â±Â²Â²Â±Â±   Â°        \n     Â°Â±Â°Â°Â±Â±Â±Â²Â²Â²Â²Â±Â±Â±Â°Â±Â°  Â°Â±Â±Â±Â²Â±Â±Â±Â°     Â°Â²Ã›Ã›Ã›Â²Â°  Â°Â±Â±Â±Â±Â±Â°  Â±Â±Â°   Â°Â±Â±Â±Â±Â±Â±Â±Â±Â±Â±Â°Â°     \n ÃœÃœÃœÃœÃœÃœ  Â°Â°Â°Â°Â°Â°Â°Â°Â°Â° Ãœ Â°  Â°Â°Â°Â°Â°Â°Â°   Â° Ãœ  Â²Ã›Â±   ÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÂ±ÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœ  \n                                                               Â°Â±Â²Ã›Â²Â±Â°          \n                 -= ToxicBIOS v1.3 Release =-                   Â°Â±Â²Â±Â°          \n                                                                 Â°Â±Â°                                                                             \nIntroduction\n============\n\nToxicBIOS is a third party flash upgrade for the DMS4 Lite and Pro modchips by\nTeam Toxic. Our goal is to provide a host of features which DMS4 owners deserve,\nbut are sadly lacking in the factory default &amp;quot;legal&amp;quot; flash. Thanks to the \nsuperior hardware design of the DMS4 series chips, we have been able to create \na freeware flash replacement which will unlock your modchips full potential \nand enable your console to do things you have only dreamed of :)\n\nCurrent features provided by ToxicBIOS are as follows:\n\n- Auto-detect and non-swap booting of all disc types (PS2, DVD, PSX, etc)\n- Support for DVD+R dual layer media\n- Compatible with all PS2 models V1-V12\n- Dev.olution mode (from memory card and HDD)\n- DVD region free, Macrovision removal and green screen fix for the DVD player\n- Auto-ATAD patching for HDD-enabled games\n- Fast boot mode for PS2, PSX and DVD movies\n- Support for the HDD browser upgrade on a non-Sony HDD\n- Set default boot mode to: Normal, MC/HDD Dev.olution, Fast Boot\n- Playstation 2 game video fix (Colour Carrier, PAL, NTSC, PAL60), with\n  automatic y-position correction\n- Playstation 1 game video fix\n- Enable MegaMemory memory cards without the need for the boot disc\n- Configuration menu where various settings can be manipulated\n- &amp;quot;Toxic&amp;quot; logo displayed at the PS2 logo screen\n- When booting from Dev.olution mode or Fast Boot, games use correct language\n- Modchip disable mode, for online gaming\n- Support for the Codebreaker cheat device\n- 100% boot rate\n- Much, much more to come!\n\n*****************************************************************************\nNOTE: All HDD related features are unsupported on the PStwo (V12) console for\n      obvious reasons ;)\n*****************************************************************************\n\nDetailed Feature Overview\n=========================\n\n-&amp;gt; Dev.olution mode\n\n   Using Dev.olution mode you can boot applications from either the memory\n   card or hard disk drive. When booting in MC Dev.olution mode, the ELF file\n   &amp;quot;mc0:/BOOT/BOOT.ELF&amp;quot; is launched. This ELF file can be anything you want, \n   such as DMS Explorer, PS2Menu, PS2OS etc. To boot in MC Dev.olution mode\n   either hold down TRIANGLE on controller 1 while the PS2 is booting, or\n   set default boot mode to MC Dev.olution in the configuration menu. Currently\n   the only application which can be launched with HDD Dev.olution mode is\n   DMS HDD Explorer. Once HDD Explorer is installed, you may boot in HDD\n   Dev.olution mode by either holding down START on controller 1 while the PS2\n   is booting, or set default boot mode to HDD Dev.olution in the configuration\n   menu.\n\n   NOTE: From ToxicBIOS v1.2 and up you must use DMS HDD Explorer v1.3 or\n         greater. Older versions are no longer supported.\n\n-&amp;gt; ATAD auto-patching\n\n   When ATAD auto-patching is enabled, you can connect a non-Sony HDD to your\n   PS2 and use it as though it was an official Sony drive. You will be able\n   to install and use the HDD browser update (found on the HDD utility disc) on\n   a non-Sony HDD, and you will be able to partially install some games with\n   HDD support to improve performance.. even though this is a bit pointless\n   with the existence of HDLoader ^_^\n\n-&amp;gt; Fast boot mode\n\n   Fast boot mode allows you to skip the redundant &amp;quot;swirling electrons&amp;quot; and\n   various logo screens and directly load your PS2/PSX game or DVD movie as \n   soon as you turn on the console, saving valuable time which would be better \n   spent gaming. To use fast boot mode, either hold down SELECT while the PS2 \n   is booting or set default boot mode to fast boot in the configuration menu. \n\n-&amp;gt; DVD+R dual layer media support\n\n   Until now it has been impossible to play DVD9 games backed up onto dual\n   layer media on the PS2 due to a problem with reading from the second layer\n   because the data format on burnt DL discs is different than on pressed\n   discs (burnt = OTP, pressed = PTP). However, we have discovered a software\n   hack which enables the PS2 to read even burnt OTP discs meaning it is now\n   possible to make backups of dual layer games such as GT4. ToxicBIOS includes\n   an &amp;quot;auto-patching&amp;quot; mechanism which applies this patch on the fly. The\n   auto-patcher is disabled by default, to enable set &amp;quot;DVD+R DL Support&amp;quot; in\n   the settings menu.\n\n   NOTE: Unfortunately due to software restrictions the auto-patching will\n         not work if you boot your DL backup from the updated Sony browser\n\t stored on the HDD. If you are using the updated browser then in\n\t order to play your DL backups you must boot them with fastboot. \n\t If you are not using the browser update then there are no\n\t limitations regarding how you can boot DL backups.\n\n-&amp;gt; Default boot mode\n\n   Using the configuration menu you can set the default boot mode to one of the\n   following: Normal, Fast Boot, MC Dev.olution, HDD Dev.olution. If you do not\n   manually specify a boot mode while the PS2 is booting by holding down a\n   button on controller 1, the default boot mode will be used. For example if\n   the default boot mode is set to MC Dev.olution, when you turn on the PS2\n   without holding down any buttons on the controller, your MC Dev.olution\n   application will be loaded from the memory card. If you then wish to boot\n   normally (i.e.: boot through standard browser) hold down CROSS on controller\n   1 while booting to over-ride the default boot mode.\n\n-&amp;gt; Playstation 2 game video fix\n\n   There are 4 different modes for the PS2 video MODE fix, as described below:\n\n   - Colour Carrier: The colour carrier of the video signal is changed to\n     match the region of your console.\n   - Force PAL: Video mode forced to PAL (50hz), regardless of what video mode\n     games try to set.\n   - Force NTSC: Video mode forced to NTSC (60hz), regardless of what video\n     mode games try to set.\n   - Force PAL60: Video mode forced to PAL60, which is 60hz with PAL colour\n     carrier.\n\n   In addition to the PS2 video MODE fix, you can also enable the PS2 video\n   Y-POS fix. The y-position fix is used in conjunction with the PS2 video\n   MODE fix in order to correct the vertical position of the display. For\n   example, simply focing PAL when a NTSC game is running will generally result\n   in the display being far off center. The y-position fix corrects this and\n   centers the display. Please note that the y-position fix is not available\n   when the PS2 video MODE fix is off or set to Color Carrier, since in these\n   cases the video mode is not forced so the display position will not need\n   to be corrected. Please note that the y-position fix feature should still\n   be considered EXPERIMENTAL and has been known to cause problems with a few\n   games. If a game isnt working, disable the y-position fix and see if this\n   helps.\n\n   You can configure the PS2 video MODE and PS2 video Y-POS fixes in the\n   configuration menu.\n   \n-&amp;gt; Configuration Menu\n\n   The configuration menu is used to manipulate various ToxicBIOS settings, for\n   example enabling or disabling ATAD auto-patching. The configuration menu also\n   displays useful information about your PS2 system and DMS4 modchip. To enter\n   the configuration menu, hold down SQUARE on controller 1 while the PS2 is\n   booting.\n\n-&amp;gt; Disable Mode\n\n   When playing online games it is often necessary to disable the modchip so you\n   do not get a DNAS error while connecting to the online game server. To\n   disable DMS4, hold down L1 on controller 1 as the PS2 is booting. You will\n   see a message saying that the modchip has been disabled. Insert your game and\n   reset the console - the modchip will not be disabled and will stay disabled\n   until the PS2 is placed in standby.\n\n-&amp;gt; Codebreaker cheat device support\n\n   The more recent codebreaker cheat devices include a protection system which\n   is designed to detect the presence of modchips and prevent the application\n   from working on a modified system. ToxicBIOS bypasses this protection and\n   allows codebreaker to work properly, however you must first set\n   &amp;quot;Auto Tray Eject&amp;quot; to OFF in the options menu.\n\nBoot-time controller mapping\n============================\n\nWhen the console is booting, holding down certain buttons on controller 1 will\nactivate certain modes/features. These are listed below:\n\n   CROSS    - Use standard boot (over-ride default boot mode setting)\n   TRIANGLE - MC Dev.olution mode\n   START    - HDD Dev.olution mode\n   SELECT   - Fast boot mode\n   SQUARE   - Load configuration menu\n   L1       - Disable modchip\n\nHow to Install\n==============\n\nInstallation directions vary depending on boot method:\n\n- ELF boot: Simply execute the ELF using your favorite loader application \n  (PS2Menu, PS2Link, Naplink, PS2OS, LaunchELF etc) and follow the on-screen \n  directions.\n\n- CD boot: Simply burn the BIN/CUE provided, boot the disc and follow the\n  on-screen directions.\n\nFrequently Asked Questions\n==========================\n\nQ: Can I disable the &amp;quot;Toxic&amp;quot; logo displayed under the Playstation 2 logo when\n   booting PS2 games?\nA: Yes. Set &amp;quot;Display Toxic Logo&amp;quot; to NO in the configuration menu.\n\nQ: Why do I get the &amp;quot;TV system doesn't match&amp;quot; error while trying to play a\n   DVD movie?\nA: You will be presented with this error if you attempt to play a PAL movie on\n   a NTSC console. This is due to a limitation in the DVD player software and\n   currently there is no way around this. We are looking into ways to fix this\n   and hopefully a fix will be included in a future ToxicBIOS release.\n\nQ: I have a feature request or bug report for Team Toxic. How can I contact you?\nA: We do not provide any contact details such as e-mail addresses etc, however \n   we do monitor various &amp;quot;scene&amp;quot; forums so if you have a request or a problem\n   then just make a post and there is a good chance we will see it and take note\n   of it :)\n\nQ: I have a game which isnt loading or working prorperly. What can I do?\n\n   1) Disable y-position fix if it is enabled. This is still experimental and\n      has been known to cause problems with a few games.\n   2) Make sure that the game is burnt on good quality media at an appropriate\n      speed. If your PS2's laser cannot read from your disc, the game will\n      obviously not work.\n\nChange Log\n==========\n\n 1.3 Release:\n ------------\n\n * Added support for DVD+R dual layer media, making DMS4 the worlds first\n   modchip to support dual layer backups.\n * Fixed devolution mode with MM16 cards\n * Fixed booting PSX games which do not have SYSTEM.CNF\n\n 1.2 Release:\n ------------\n\n * Fastboot can now also load PSX games and DVD movies\n * Improved authentication logic which leads to significantly improved boot \n   rates on consoles with poor lasers\n * Codebreaker cheat devices are now supported\n * Manual y-position fix toggle and gui enhancements added to configuration menu\n * Progressive scan while PS2 video fix enabled is now working\n * Added support for DMS HDD Explorer v1.3. Older versions are no longer supported.\n * Other minor bugfixes and code cleanup\n\n 1.1 Release:\n ------------\n\n * Progressive scan is now working in games and the DVD player\n * Macrovision removal is now working properly\n * Fixed problems with some games caused by the y-position fix\n * Fixed problem preventing applications being loaded from within DMS Explorer\n * Fixed problem preventing some recent games such as Athens 2004&amp;quot;,\n   &amp;quot;Spyro: A Hero's Tail&amp;quot; from working.\n * Disable screen is now displayed correctly when using component video cables\n\nGroup News\n==========\n\nTeam Toxic is also working on a patcher for DVD9 games which will allow you\nto patch the disc image so it can be burnt onto DVD+R DL media and used with\nany modchip. The effect is similar to the auto-patcher already integrated\ninto our flash except the patch is applied before the disc is burnt and not\nas it is loaded.\n\nHowever, we had to question if this was a good idea when we learnt that\ncertain modchip manufacturers have been planning to rip our DVD+R DL patching\ncode since it was originally announced, long before the actual ToxicOS release.\nWe have decided to still release this for the good of the scene however - but\nif you see DVD+R support appear in other modchips in the near future please\nkeep in mind where this came from originally :)\n\nMiscellaneous\n=============\n\nToxicBIOS may be hosted by anybody, anywhere - PROVIDED that the archive\nremains unaltered and that it is not used in ways its not supposed to be!\n\nOh, and props to the DMS team for making such a nice modchip - even though\nthe flash they ship with the chip sucks and cant do much of anything :P\n","torrent":{"xt":"urn:btih:3002958f1972af480b1b13a4849e67c115b593da","amp;dn":"ToxicBIOS+v1+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3002958f1972af480b1b13a4849e67c115b593da","infoHashBuffer":{"type":"Buffer","data":[48,2,149,143,25,114,175,72,11,27,19,164,132,158,103,193,21,181,147,218]},"announce":[],"urlList":[]}}