{"title":"ToxicOS v0.3","uid":3309103,"size":1992246,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:30a0cf28f7d970c3b4f36eb6f9819aa9b6ada2c2&amp;dn=ToxicOS+v0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrTLU","files":1,"time":1112205398,"description":"ÃœÃœÃœÃœÃœÃœÃœÃœ                                               \n                      Â°ÃœÃ›  Â°Â±Â° Â° Ã›ÃœÂ°                                            \n ÃœÃœÃœÃœÃœ Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â²Â°Â°Ã›  ÃŸÂ±Â°Â° Â°Â±ÃŸ  Ã›Â°Â° Ã›Ã›Ã›Ã›Â°  Ãœ  Ã›Ã›Ã›Ã›  Ã›Ã›Ã›Â² Ãœ   Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°      \n   Â²Â±  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°Ã› Â° Â°Â° Â°  Â°  Â° Ã›Â° Â°Ã›Ã›Ã›Ã›Â°   Â°Ã›Ã›Ã›Â°  Ã›Ã›Ã›Ã›  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â²Ã›Ã›      \n   Â±       Â°Â²Ã›Ã›Ã›Â°   Ã› Â°Â±Â°  Â°Â° Â°  Â°Â±Â° Ã›  Â°Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Â°   Ã›Ã›Ã›Ã› Â°Ã›Ã›Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Ã›Â°     \n        Â°   Â²Ã›Ã›Ã›    Ã›  Â° Â°Â±    Â±Â° Â° Â°Ã›   Â°Ã›Ã›Ã›Ã›Â°Ã›Ã›Ã›Ã›    Â²Ã›Ã›Ã› Ã›Ã›Ã›Ã›Ã›Â°              \n    Â° Â°Â±Â±Â°Â° Ã›Ã›Ã›Ã›   Â°Ã›Â°Â°Â±   Â°  Â°  Â°Â±Â° Ã›Â°   Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°    Â²Ã›Ã›Ã› Ã›Ã›Ã›Ã›Â°     Â°Â°Â°Â°      \n     Â°Â±Â²Â±Â±Â° Ã›Ã›Ã›Ã› Â° Â°Ã›Â±Â° Â° Â°Â±Â°Â°Â± Â°Â° Â°Â±Ã›Â° Â°  Â°Ã›Ã›Ã›Ã›Ã›Â°  Â°  Ã›Ã›Ã›Ã› Â²Ã›Ã›Ã›   Â°Â±Â±Â±Â±Â°Â±Â°     \n  Â° Â°Â±Â²Â²Â±   Ã›Ã›Ã›Ã›    ÃŸÃœÂ°    Â°Â±Â±Â°    Â°ÃœÃŸ  Â°  Â°Ã›Ã›Ã›Ã›Ã›Â°  Â±Â° Ã›Ã›Ã›Ã› Â²Ã›Ã›Ã›    Â°Â°Â±Â°Â±Â±Â±     \n   Â°Â±Â²Â±Â±Â²Â°  Ã›Ã›Â²Ã› Â°  Â°Ã› ÃŸÃ›Ã›Ãœ Â°Â° ÃœÃ›Ã›ÃŸ Ã›Â° Â±  Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°    Ã›Ã›Ã›Ã› Ã›Ã›Ã›Ã›Â°  Â°  Â° Â°Â±Â±     \n   Â°Â°Â°Â°Â±Â°Â±Â° Ã›Ã›Ã›Ã›    Ã›  Â°Ã›Ã›Ã›Ã›  Ã›Ã›Ã›Ã›Â°  Ã›   Â°Ã›Ã›Ã›Ã›Â°Ã›Ã›Â²Ã›Â° Â± Ã›Ã›Â²Ã› Ã›Ã›Ã›Ã›Ã›Â°  Â°    Â°Â°     \n   Â±   Â° Â°  Ã›Ã›Â²Ã›  Â°  Ã›ÃŸ     Ã›Ã›     ÃŸÃ›   Â°Ã›Ã›Ã›Ã›Â° Â°Ã›Ã›Ã›Ã›Â°  Ã›Ã›Ã›Ã› Â°Ã›Ã›Ã›Ã›Ã›Â°             \n   Ã›  Â°     Ã›Ã›Â²Ã› Â°Â±Â° Â° Ã›Â° Â°ÃŸÃŸÃŸÃŸÂ° Â°Ã› Â°  Â°Ã›Ã›Ã›Ã›Â°   Â°Ã›Â²Ã›Ã›Â° Ã›Ã›Â²Ã› `Ã›Ã›Ã›Â²Ã›Ã›Ã›Â°Â°Ã›Ã›Ã›Ã›Â°     \n  Â±Ã›Â±       Ã›Ã›Â²Ã› Â°Â±Â±Â°  Â°Ã›Â° Â°Â±Â±Â° Â°Ã›Â°    Ã›Ã›Ã›Ã›Ã›  Â°  Ã›Ã›Â²Ã›Ã› Ã›Ã›Â²Ã›  Â°Ã›Ã›Ã›Â²Â²Ã›Ã›Ã›Ã›Ã›Ã›Ã›      \n Â±Ã›Ã›Ã›Â±      Ã›Ã›Ã›Ã›  Â°Â±Â±Â°  Ã›Â±Â° Â°Â° Â°Â±Ã›     Ã›Ã›Ã›Ã›Â° Â°Â±Â° Â°Ã›Ã›Ã›Ã› Ã›Ã›Ã›Ã›    Â°Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Ã›Â°      \n  Â±Ã›Â±                   Â°ÃŸÃŸÃ›ÃŸÃŸÃ›ÃŸÃŸÂ°           Â²                                  \n   Ã›        Â±Â±Â±Â±                   Â°  Â°Â±Â±Â²Â±Â°Â²Ã›Â² Â°Â±Â±Â±Â±Â±Â° Â°Â±Â±    Â°Â±Â±Â±Â±Â±Â±Â±Â±Â±Â°      \n   Â±       Â°Â°Â²Â±Â°Â°       Â°Â±Â±Â±Â±Â±Â±Â±Â°      Â°Â±Ã›Â±Â±Â°Â² Â°Â±Â²Â±Â±Â±Â° Â°Â°Â²Â±   Â°Â±Â±Â²Â±Â° Â°          \n         Â°Â±Â±Â±Â±Â²Â±Â±Â±Â° Â° Â±Â°Â±Â±Â²Â²Â±Â±Â²Â±Â±Â°Â±Â°    Â²Ã›Â²Â±Â±Â±Â±Â±Â²Â±Â°     Â±Â²Â°Â° Â°Â±Â±Â²Â²Â±Â±   Â°        \n     Â°Â±Â°Â°Â±Â±Â±Â²Â²Â²Â²Â±Â±Â±Â°Â±Â°  Â°Â±Â±Â±Â²Â±Â±Â±Â°     Â°Â²Ã›Ã›Ã›Â²Â°  Â°Â±Â±Â±Â±Â±Â°  Â±Â±Â°   Â°Â±Â±Â±Â±Â±Â±Â±Â±Â±Â±Â°Â°     \n ÃœÃœÃœÃœÃœÃœ  Â°Â°Â°Â°Â°Â°Â°Â°Â°Â° Ãœ Â°  Â°Â°Â°Â°Â°Â°Â°   Â° Ãœ  Â²Ã›Â±   ÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÂ±ÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœÃœ  \n                                                               Â°Â±Â²Ã›Â²Â±Â°          \n                  -= ToxicOS v0.3 Release =-                    Â°Â±Â²Â±Â°          \n                                                                 Â°Â±Â°\nIntroduction\n============\n\nToxicOS is a third party flash upgrade for the DMS4 Pro modchip by Team Toxic.\nWhile providing all the features of ToxicBIOS, it also provides a host of\ninnovative new features such as the ability to run games from the HDD.\n\nSo, whats new in this release?\n\n- It is now possible to launch your PS2/PSX games and DVD movies off disc\n  directly from within ToxicOS, bringing ToxicOS one step closer to being a\n  full OS replacement for the standard PS2 browser.\n- DVD-9 games such as Gran Turismo 4 are now playable from the HDD.\n- 48-bit LBA support added, while keeping support for 28-bit applications\n  on the same HDD (such as the Sony browser upgrade).\n- Many compatibility fixes for playing games from the HDD have been included.\n- Support has been added for DVD+R dual layer media, making DMS4 the worlds\n  first modchip to support dual layer backups.\n- Support for the V12 IDE HDD hack for those daring enough to attempt it :)\n- Configuration screen added to ToxicOS where both modchip and OS settings\n  can be manipulated. This has made the standard Toxic config menu obsolete.\n- Games installed via ToxicOS now show an icon in the updated PS2 browser.\n- Fixed Devolution mode with unlicensed memory cards (MM16 etc).\n- Many other miscellaneous changes and fixes.\n\nUnfortunately due to lack of time we had to leave out the integrated cheat\ndevice as development has not been completed, however this will be included\nwith the next release of ToxicOS along with some other very cool features.\n\nToxicOS feature list\n====================\n\nOS features:\n\n- Run PS2 games directly from a _IDE_ HDD. This leads to decreased loading\n  times and makes gaming so much more convenient. Never again will you need\n  to endure those painfully slow loading times!\n- Boot standard discs (PS2, PSX, DVD) from inside ToxicOS (so you dont need\n  to boot movies etc through the native PS2 browser).\n- Run DVD-9 games from the HDD.\n- 48-bit HDD support to enable the use of larger drives.\n- V12 IDE HDD support.\n- Configuration screen where various settings relating to both the BIOS and\n  OS software can be configured.\n\nBIOS features:\n\n- Auto-detect and non-swap booting of all disc types (PS2, DVD, PSX, etc)\n- Support for DVD+R dual layer media\n- Compatible with all PS2 models V1-V12\n- Dev.olution mode (from memory card and HDD)\n- DVD region free, Macrovision removal and green screen fix for the DVD player\n- Auto-ATAD patching for HDD-enabled games\n- Fast boot mode for PS2, PSX and DVD movies\n- Support for the HDD browser upgrade on a non-Sony HDD\n- Set default boot mode to: Normal, MC/HDD Dev.olution, Fast Boot\n- Playstation 2 game video fix (Colour Carrier, PAL, NTSC, PAL60), with\n  automatic y-position correction\n- Playstation 1 game video fix\n- Enable MegaMemory memory cards without the need for the boot disc\n- Configuration menu where various settings can be manipulated\n- &amp;quot;Toxic&amp;quot; logo displayed at the PS2 logo screen\n- When booting from Dev.olution mode or Fast Boot, games use correct language\n- Modchip disable mode, for online gaming\n- Support for the Codebreaker cheat device\n- 100% boot rate\n\nFeatures planned for future releases include:\n\n- Integrated cheat device, allowing you to use cheats while playing games\n  from the HDD or CD/DVD without requiring a 3rd party cheating product.\n- The ability to manipulate console settings such as screen size, date/time\n  from inside of ToxicOS.\n- Support for installing homebrew applications to the HDD or memory card. This\n  will provide similar functionality to DMS Explorer/CC BootManager etc.\n- Some suprises which we know you'll love!\n\nDetailed Feature Overview\n=========================\n\n-&amp;gt; ToxicOS\n\n   When booting into ToxicOS you will be presented with the main menu which\n   lets you navigate through the various sections of ToxicOS.\n\n   * Load Disk     - selecting this will load the disc currently inserted in \n                     the CDVD drive. This can be a PS2 game, PSX game or DVD \n\t\t     movie.\n   * HDD Games     - selecting this will bring you to the HDD game menu, as\n                     described in more detail below.\n   * Select Cheats - Currently not available, but in a future release will\n                     take you to the cheat code menu.\n   * Settings      - Takes you to the settings screen where the various\n                     settings relating to both the OS and BIOS software\n\t\t     can be manipulated.\n\n   You can boot into ToxicOS either by holding down R1 while the console\n   is booting or setting the default boot mode to &amp;quot;ToxicOS&amp;quot;.\n\n-&amp;gt; Run games from the HDD!\n\n   Using ToxicOS you can install and run games directly from an IDE HDD\n   connected to your PS2. To do this, navigate to the 'HDD games&amp;quot; screen\n   from the main menu. From here you can:\n\n   a) Play games already installed on your HDD\n   b) Install a new game to your HDD\n   c) Remove a game from your HDD\n   d) Rename a game on your HDD\n   e) View information for a specific game and change game settings\n   f) Return to the main menu\n\n   At the main screen either the game list or toolbar is in focus at any one\n   time. You can alternate focus with the LEFT and RIGHT buttons on the D-pad.\n   When the game list is in focus the key mapping is as follows:\n\n   UP/DOWN\t- Select game\n   CROSS\t- Start playing the selected game\n   TRIANGLE\t- View info/settings for selected game\n   L1\t\t- Scroll page up\n   R1\t\t- Scroll page down\n\n   When the toolbar is in focus, use the LEFT/RIGHT buttons to select an\n   action and CROSS to choose that action. If you select install you will\n   be taken to the installation screen. Here you will be asked to insert a \n   CD or DVD and then enter a name for the game using the onscreen keyboard.\n   While at the onscreen keyboard the key mapping is as follows:\n\n   D-pad\t- Move selection\n   CROSS\t- Make selection\n   START\t- Shortcut for ENTER key\n   CIRCLE\t- Shortcut for CANCEL key\n   L1\t\t- Move cursor left\n   R1\t\t- Move cursor right\n   L2\t\t- Shortcut for BACKSPACE key\n   R2\t\t- Shortcut for SHIFT key\n\n   Enter the name of the game then select ENTER to continue. Now the game\n   will be installed to the HDD - and this can take a while, so be patient :)\n\n   The rename and remove options in the toolbar are self-explanatory so no\n   need to cover them here. The settings option will bring up the game info/\n   settings dialog. From here you can see game information and change the\n   compatibility mode settings. Some games require special compatibility modes\n   to be set in order for those games to work correctly. More information\n   regarding these compatibility modes will be made available shortly.\n\n-&amp;gt; DVD+R dual layer media support\n\n   Until now it has been impossible to play DVD9 games backed up onto dual\n   layer media on the PS2 due to a problem with reading from the second layer\n   because the data format on burnt DL discs is different than on pressed\n   discs (burnt = OTP, pressed = PTP). However, we have discovered a software\n   hack which enables the PS2 to read even burnt OTP discs meaning it is now\n   possible to make backups of dual layer games such as GT4. ToxicOS includes\n   an &amp;quot;auto-patching&amp;quot; mechanism which applies this patch on the fly. The\n   auto-patcher is disabled by default, to enable set &amp;quot;DVD+R DL Support&amp;quot; in\n   the settings menu.\n\n   NOTE: Unfortunately due to software restrictions the auto-patching will\n         not work if you boot your DL backup from the updated Sony browser\n\t stored on the HDD. If you are using the updated browser then in\n\t order to play your DL backups you must boot them either with\n\t fastboot or from inside ToxicOS (&amp;quot;Launch Disc&amp;quot; from main menu). If\n\t you are not using the browser update then there are no limitations\n\t regarding how you can boot DL backups.\n\n-&amp;gt; 48-bit HDD support\n\n   ToxicOS has now broken the 28-bit barrier, making it possible to fully\n   utilise HDD's with their capacity larger than 128GB. If you are using such\n   a HDD you also have the option of using the Toxic Extened APA partition\n   format on your HDD which has many advantages over the standard APA\n   partition format, used by all other current PS2 HDD aplications (ie: homebrew\n   software).\n\n   MAKE SURE that you read the section relating to the two different partition\n   formats below since it contains some VERY IMPORTANT information, especially\n   relevant to those who wish to use homebrew software with &amp;quot;48-bit HDD support&amp;quot;.\n\n-&amp;gt; V12 IDE HDD support\n\n   With the release of schematics by &amp;quot;automan&amp;quot; it has become possible to connect\n   a standard IDE HDD to the V12 &amp;quot;pstwo&amp;quot; however all the current HDD\n   applications have problems, forcing you to re-format the drive on each boot.\n   ToxicOS has overcome this limitation and offers full V12 HDD support for\n   those that are daring enough to wire up the IDE interface ;)\n\n-&amp;gt; Dev.olution mode\n\n   Using Dev.olution mode you can boot applications from either the memory\n   card or hard disk drive. When booting in MC Dev.olution mode, the ELF file\n   &amp;quot;mc0:/BOOT/BOOT.ELF&amp;quot; is launched. This ELF file can be anything you want, \n   such as DMS Explorer, PS2Menu, PS2OS etc. To boot in MC Dev.olution mode\n   either hold down TRIANGLE on controller 1 while the PS2 is booting, or\n   set default boot mode to MC Dev.olution in the configuration menu. Currently\n   the only application which can be launched with HDD Dev.olution mode is\n   DMS HDD Explorer. Once HDD Explorer is installed, you may boot in HDD\n   Dev.olution mode by either holding down START on controller 1 while the PS2\n   is booting, or set default boot mode to HDD Dev.olution in the configuration\n   menu.\n\n   NOTE: From ToxicOS v0.2 and up you must use DMS HDD Explorer v1.3 or\n         greater. Older versions are no longer supported.\n\n-&amp;gt; ATAD auto-patching\n\n   When ATAD auto-patching is enabled, you can connect a non-Sony HDD to your\n   PS2 and use it as though it was an official Sony drive. You will be able\n   to install and use the HDD browser update (found on the HDD utility disc) on\n   a non-Sony HDD, and you will be able to partially install some games with\n   HDD support to improve performance.. even though this is a bit pointless\n   with the existence of ToxicOS ;)\n\n-&amp;gt; Fast boot mode\n\n   Fast boot mode allows you to skip the redundant &amp;quot;swirling electrons&amp;quot; and\n   various logo screens and directly load your PS2/PSX game or DVD movie as \n   soon as you turn on the console, saving valuable time which would be better \n   spent gaming. To use fast boot mode, either hold down SELECT while the PS2 \n   is booting or set default boot mode to fast boot in the configuration menu.\n\n-&amp;gt; Default boot mode\n\n   Using the configuration menu you can set the default boot mode to one of the\n   following: Normal, ToxicOS, Fast Boot, MC Dev.olution, HDD Dev.olution. If \n   you do not manually specify a boot mode while the PS2 is booting by holding \n   down a button on controller 1, the default boot mode will be used. For \n   example if the default boot mode is set to MC Dev.olution, when you turn on \n   the PS2 without holding down any buttons on the controller, your MC Dev.olution\n   application will be loaded from the memory card. If you then wish to boot\n   normally (i.e.: boot through standard browser) hold down CROSS on controller\n   1 while booting to over-ride the default boot mode.\n\n-&amp;gt; Playstation 2 game video fix\n\n   There are 4 different modes for the PS2 video MODE fix, as described below:\n\n   - Colour Carrier: The colour carrier of the video signal is changed to\n     match the region of your console.\n   - Force PAL: Video mode forced to PAL (50hz), regardless of what video mode\n     games try to set.\n   - Force NTSC: Video mode forced to NTSC (60hz), regardless of what video\n     mode games try to set.\n   - Force PAL60: Video mode forced to PAL60, which is 60hz with PAL colour\n     carrier.\n\n   In addition to the PS2 video MODE fix, you can also enable the PS2 video\n   Y-POS fix. The y-position fix is used in conjunction with the PS2 video\n   MODE fix in order to correct the vertical position of the display. For\n   example, simply focing PAL when a NTSC game is running will generally result\n   in the display being far off center. The y-position fix corrects this and\n   centers the display. Please note that the y-position fix is not available\n   when the PS2 video MODE fix is off or set to Color Carrier, since in these\n   cases the video mode is not forced so the display position will not need\n   to be corrected. Please note that the y-position fix feature should still\n   be considered EXPERIMENTAL and has been known to cause problems with a few\n   games. If a game isnt working, disable the y-position fix and see if this\n   helps.\n\n   You can configure the PS2 video MODE and PS2 video Y-POS fixes in the\n   configuration menu.\n   \n-&amp;gt; Settings Menu\n\n   The configuration menu is used to manipulate various ToxicOS settings, for\n   example enabling or disabling ATAD auto-patching. The configuration menu also\n   displays useful information about your PS2 system and DMS4 modchip. To enter\n   the settings menu, boot into ToxicOS then at the main menu select &amp;quot;Settings&amp;quot;.\n   \n-&amp;gt; Disable Mode\n\n   When playing online games it is often necessary to disable the modchip so you\n   do not get a DNAS error while connecting to the online game server. To\n   disable DMS4, hold down L1 on controller 1 as the PS2 is booting. You will\n   see a message saying that the modchip has been disabled. Insert your game and\n   reset the console - the modchip will not be disabled and will stay disabled\n   until the PS2 is placed in standby.\n\n-&amp;gt; Codebreaker cheat device support\n\n   The more recent codebreaker cheat devices include a protection system which\n   is designed to detect the presence of modchips and prevent the application\n   from working on a modified system. ToxicOS bypasses this protection and\n   allows codebreaker to work properly, however you must first set\n   &amp;quot;Auto Tray Eject&amp;quot; to OFF in the options menu.\n\nHDD partition format information - ALL READ!\n============================================\n\nIf you are using a 48-bit compatible HDD (ie: a HDD that has a capacity greater\nthan 128GB) ToxicOS gives you the option of either using the Toxic Extneded\nAPA format (abbreviated &amp;quot;APAEXT&amp;quot;) or the standard APA partition format\n(abbreviated &amp;quot;APA&amp;quot;). If your HDD is not formatted then you will be asked\nif you wish to use APAEXT or APA. If your HDD is already formatted but you\nhave not used data past the 128GB boundary then you will be asked if you\nwish to update to APAEXT (please note that you will not lose any data during\nthis process). APAEXT is better than APA in many ways and in general we\nrecommend that you use this, however there are some people who will want to\nstick with the standard APA format as we will describe further down.\n\nThe reason why the two different formats are needed can get rather technical\nand allough we recommend that you read all the information before making your\ndecision as to which format you use, we realise that the information is a lot\nto take in and can be hard to understand so we will provide a simple set of\nguidelines you can use to make your decision if you wish, and then following \nthat some detailed information explaining the differences between the two\nformats in more detail.\n\nSimple Guidlines\n----------------\n\n - If your HDD capacity is less than 128GB then APAEXT is not supported so the\n   standard APA format will be used.\n - If your HDD capacity is greater than 128GB and you NEVER used or intend to\n   use homebrew applications patched with 48-bit LBA support such as patched\n   HDLoader, patched DMS Format Tools, 48-bit PS2OS etc then you should use\n   APAEXT. This will allow you to completely fill the HDD with games for\n   ToxicOS while maintaining compatibility with 28-bit HDD software (such as\n   Sonys upgraded browser). THIS IS THE RECOMMENDED OPTION!\n - If your HDD capacity is greater than 128GB and you have used or intend to \n   use homebrew applications patched with 48-bit LBA support such as patched\n   HDLoader, patched DMS Format Tools, 48-bit PS2OS etc (even though there is\n   no point in using 48-bit versions of these applications if you intend to \n   use ToxicOS) then you should choose standard APA.\n\nWARNING: Using 48-bit patched applications such as 48-bit HDLoader when the HDD\n         has been formatted with APAEXT can cause HDD corruption! We recommend\n\t that you simply avoid 48-bit patched HDD software and simply use the\n\t standard 28-bit versions.\n\nTechnical information regarding the different formats\n-----------------------------------------------------\n\nNOTE: Here we assume that 1 gigabyte = 1024 megabytes, not 1000 megabytes. This\n      makes the maximum capacity for a 28-bit HDD 128GB and not 137GB.\n\nAPAEXT essentially breaks the HDD into 2 parts, the first part being 128GB\nlarge and the second part taking up the remaining space on the HDD. The first\npart has the same format which current 28-bit HDD enabled homebrew software \napplications use. This makes it so that any such applications can utilise the\nfirst 128GB of the HDD, and the applications will only see the first 128GB of\nthe HDD so they will not interfere with the game data stored on the second\npart. The second part of the HDD *should* only be accessed by ToxicOS or\nsoftware which can recognise the format of the second part (at the time of\nwriting, ToxicOS is the only application which can do this).\n\nThe problem comes when you want other homebrew applications to be able to see\npast the 128GB barrier. Some people have patched commonly used homebrew HDD\napplications such as the DMS format tool etc to be able to utilise area past\nthe 128GB barrier, however these applications do not know about the APAEXT\nformat and if you use them on an APAEXT formatted HDD then if they write data\npast the 128GB barrier YOUR HDD WILL BECOME CORRUPT! If you wish to use such\napplications then you must tell ToxicOS to use the standard APA format - \nhowever if you have data written past the 128GB barrier using the standard APA\nformat you will not be able to use standard HDD enabled applications that\nhave not been patched to see past the 128GB barrier (such as the updated \nPS2 browser software)!\n\nSo, its all a bit of a mess really. If you format with APAEXT then you cannot\nuse homebrew applications with 48-bit HDD support. If you format with standard\nAPA you cannot use applications with only 28-bit HDD support once there is\ndata past the 128GB barrier. Keep in mind, that most applications only support\n28-bit INCLUDING the updated PS2 browser which runs from the HDD. Therefore it\nis our opinion that copies of homebrew software which have been patched to \nsupport 48-bit HDD's are generally bad news and you should try and avoid such \nsoftware, ESPECIALLY IF YOUR HDD IS FORMATTED WITH APAEXT.\n\nOUR RECOMMENDATION IS:\n\nThat you format with APAEXT and avoid homebrew applications with 48-bit support. \nThere really is no need to use such applications anyway since ToxicOS will \ninstall games to the second part of the HDD first until it contains no more \nfree space and only then will it start installing games to the first part. So, \nfor most people you will have lots of space for homebrew applications to use \non the first part of the HDD eliminating the need for homebrew applications\nto see past the first 128GB.\n\nBoot-time controller mapping\n============================\n\nWhen the console is booting, holding down certain buttons on controller 1 will\nactivate certain modes/features. These are listed below:\n\n   CROSS    - Use standard boot (over-ride default boot mode setting)\n   R1       - Boot into ToxicOS\n   TRIANGLE - MC Dev.olution mode\n   START    - HDD Dev.olution mode\n   SELECT   - Fast boot mode\n   L1       - Disable modchip\n\nHow to Install\n==============\n\nInstallation directions vary depending on boot method:\n\n- ELF boot: Simply execute the ELF using your favorite loader application \n  (PS2Menu, PS2Link, Naplink, PS2OS, LaunchELF etc) and follow the on-screen \n  directions.\n\n- CD boot: Simply burn the BIN/CUE provided, boot the disc and follow the\n  on-screen directions.\n\nFrequently Asked Questions\n==========================\n\nQ: How do I boot into ToxicOS?\nA: Hold R1 while booting the PS2 or set the default boot mode to &amp;quot;ToxicOS&amp;quot;.\n\nQ: Can I disable the &amp;quot;Toxic&amp;quot; logo displayed under the Playstation 2 logo when\n   booting PS2 games?\nA: Yes. Set &amp;quot;Display Toxic Logo&amp;quot; to NO in the configuration menu.\n\nQ: Why do I get the &amp;quot;TV system doesn't match&amp;quot; error while trying to play a\n   DVD movie?\nA: You will be presented with this error if you attempt to play a PAL movie on\n   a NTSC console. This is due to a limitation in the DVD player software and\n   currently there is no way around this. We are looking into ways to fix this\n   and hopefully a fix will be included in a future ToxicOS release.\n\nQ: I have a feature request or bug report for Team Toxic. How can I contact you?\nA: We do not provide any contact details such as e-mail addresses etc, however \n   we do monitor various &amp;quot;scene&amp;quot; forums so if you have a request or a problem\n   then just make a post and there is a good chance we will see it and take note\n   of it :)\n\nQ: I have a game which isnt loading or working prorperly. What can I do?\n\n   1) Disable y-position fix if it is enabled. This is still experimental and\n      has been known to cause problems with a few games.\n   2) Make sure that the game is burnt on good quality media at an appropriate\n      speed. If your PS2's laser cannot read from your disc, the game will\n      obviously not work.\n\nQ: I have heard that some code was &amp;quot;stolen&amp;quot; in order to create ToxicOS, is this\n   true?!\nA: NO NO NO! People who say this are just trying to brainwash you in a sad\n   attempt to hurt Team Toxic. The TRUTH is NOTHING was stolen, as I will explain.\n   Its true that ToxicOS contains code from the open source projects ps2lib, \n   ps2drv and libhdd however this DOES NOT mean that we have stolen any code! \n   These open source projects are licensed in such a way that anybody can use \n   them for anything they want be it commercial projects, freeware projects, \n   open source or closed source! The only requirement is that the copyrights \n   of the original authors remain intact, this requirement has been met with \n   the license file supplied with this release. Other than the projects \n   mentioned above, ALL OTHER CODE in ToxicOS was developed by Team Toxic - \n   its our code, it belongs to us, and we can do with it as we see fit.\n\nQ: Will the source code for ToxicOS ever be released?\nA: No. We dont feel it would be a good idea to release source code since then\n   it would make it far too easy for certain groups to use our software for \n   their own financial gain by including it with their own products. Certain \n   HK companies will rip just about anything if they get a chance (even stuff \n   like Naplink.. &amp;quot;bootable Naplink CD's&amp;quot; anyone?) - so lets not give them \n   that opportunity :)\n\nVersion Information\n===================\n\nToxicOS consists of ToxicBIOS at its core (which means it has all the same\nfeatures as ToxicBIOS) and the actual OS application. The version numbers \nfor these components in this ToxicOS build are as follows:\n\nBIOS v1.3\nOS software v0.3\n\nChange Log\n==========\n\n 0.3 Release:\n ------------\n\n * Updated core BIOS to ToxicBIOS v1.3, which includes the following changes:\n   - Added support for DVD+R dual layer media, making DMS4 the worlds\n     first modchip to support dual layer backups.\n   - Fixed devolution mode with MM16 cards\n   - Fixed booting PSX games which do not have SYSTEM.CNF\n * It is now possible to launch your PS2/PSX games and DVD movies off disc\n   directly from within ToxicOS, bringing ToxicOS one step closer to being a\n   full OS replacement for the standard PS2 browser.\n * DVD-9 games such as Gran Turismo 4 are now playable from the HDD.\n * 48-bit LBA support added, while keeping support for 28-bit applications\n   on the same HDD (such as the Sony browser upgrade).\n * Many compatibility fixes for playing games from the HDD have been included.\n * Support for the V12 IDE HDD hack for those daring enough to attempt it :)\n * Configuration screen added to ToxicOS where both modchip and OS settings\n   can be manipulated. This has made the standard Toxic config menu obsolete.\n * Games installed via ToxicOS now show an icon in the updated PS2 browser.\n * Many other miscellaneous changes and fixes.\n\n 0.2 Release:\n ------------\n\n * Updated core BIOS to ToxicBIOS v1.2, which includes the following changes:\n   - Fastboot can now also load PSX games and DVD movies\n   - Improved authentication logic which leads to significantly improved boot \n     rates on consoles with poor lasers\n   - Codebreaker cheat devices are now supported\n   - Manual y-position fix toggle and gui enhancements added to configuration menu\n   - Progressive scan while PS2 video fix enabled is now working\n   - Added support for DMS HDD Explorer v1.3. Older versions are no longer \n     supported.\n   - Other minor bugfixes and code cleanup\n * Fixed a bug which caused a black screen on reset after playing PSX games\n * There have been no changes to the OS software in this build\n\n 0.1 Release:\n ------------\n\n * Initial release!\n\nGroup News\n==========\n\nTeam Toxic is also working on a patcher for DVD9 games which will allow you\nto patch the disc image so it can be burnt onto DVD+R DL media and used with\nany modchip. The effect is similar to the auto-patcher already integrated\ninto our flash except the patch is applied before the disc is burnt and not\nas it is loaded.\n\nHowever, we had to question if this was a good idea when we learnt that\ncertain modchip manufacturers have been planning to rip our DVD+R DL patching\ncode since it was originally announced, long before the actual ToxicOS release.\nWe have decided to still release this for the good of the scene however - but\nif you see DVD+R support appear in other modchips in the near future please\nkeep in mind where this came from originally :)\n\nOn another note, we would like to send out a big &amp;quot;thank you&amp;quot; to the people\ninvolved in beta testing this ToxicOS release (you know who you are). You\nguys rule! :)\n\nMiscellaneous\n=============\n\nToxicOS may be hosted by anybody, anywhere - PROVIDED that the archive\nremains unaltered and that it is not used in ways its not supposed to be!\n\nOh, and props to the DMS team for making such a nice modchip - even though\nthe flash they ship with the chip sucks and cant do much of anything :P\n","torrent":{"xt":"urn:btih:30a0cf28f7d970c3b4f36eb6f9819aa9b6ada2c2","amp;dn":"ToxicOS+v0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30a0cf28f7d970c3b4f36eb6f9819aa9b6ada2c2","infoHashBuffer":{"type":"Buffer","data":[48,160,207,40,247,217,112,195,180,243,110,182,249,129,154,169,182,173,162,194]},"announce":[],"urlList":[]}}