{"title":"10 Good Windows Applications 10mb rar file","uid":3463039,"size":11555304,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:30aa54be8947a1abe6361e11aebb42b8e7347f13&amp;dn=10+Good+Windows+Applications+10mb+rar+file&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xeno2007","files":2,"time":1143503567,"description":"A collection of 10 Windows applications I collected together into a rar file which makes your computer run a lot more efficiently. You may or may not have some of these already. Here&amp;#039;s the list:\n\n\n\nGoogle Web Accelerator\n\nRoutes your connection through the google servers which in turn speeds up your internet web browsing. It really works!\n\n\nIntelli Hyperspeed 2005 v1.81\n\nAnalyses and optimizes your computer performance by changing various settings, depending upon the criteria you give it; ie: games machine, webserver, technical computing, etc.\n\n\n\nDaemon Tools\n\nCan be invaluable for many downloaded images you need to mount in a virtual drive. Plus a few other things. You either have this already so aren&amp;#039;t reading this, or don&amp;#039;t have it so should go look it up on google.\n\n\n\nBBC Ticker\n\nPuts a bar at the top of your screen scrolling News headlines from around the world, links from the BBC News website in England.  You click on the links to go to the main webpage dealing with the story. The links are updated every 30 minutes, or to whatever you set it to.\n\n\n\n\nWindows Password Expert 1.1\n\n\nIf you&amp;#039;ve lost your Windows Admin password, this can 100% recover it.\n\n\n\nFastfolders v3.30\n\nOnce installed, you can right click on anyfolder for extra information and extra options. Very handy.\n\n\n\nHide Ip Platinum\n\nMinimises to the system tray. Right click to change proxy address.\n\n\nInfo viewer\n\nInstalls a small program that views nfo files a lot more aesthetically than some crap notepad or whatnot.\n\n\nPower ISO\n\nHandles all ISO files and can even mount them in a virtual drive without you having the need to unarchive them. So you can install things straight from the iso image.\n\n\n\nCrack app\n\nA file sharer along the lines of Limewire but a lot lot better. It&amp;#039;s totally free and a lot faster. It can also be used to search specifically for cracks and other similar things - hence the name ;)\n\n\nIt&amp;#039;s only 10mb.\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:30aa54be8947a1abe6361e11aebb42b8e7347f13","amp;dn":"10+Good+Windows+Applications+10mb+rar+file","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30aa54be8947a1abe6361e11aebb42b8e7347f13","infoHashBuffer":{"type":"Buffer","data":[48,170,84,190,137,71,161,171,230,54,30,17,174,187,66,184,231,52,127,19]},"announce":[],"urlList":[]}}