{"title":"BBC: David Icke, The Lizards And The Jews (ADL exposed as Haters","uid":3414048,"size":185517765,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:3171200d40780820f3da229dc0ccd82364e12ef2&amp;dn=BBC%3A+David+Icke%2C+The+Lizards+And+The+Jews+%28ADL+exposed+as+Haters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1133013715,"description":"This is the amazing documentary The Lizards And The Jews - Documentary on David Icke which among other things shows how false accusations of hate crimes (especially antisemitism) are used against people like David Icke who are exposing the power hungry globalist elite and thus preventing all of us to hear alternative views on global events.\n\n&quot;David Icke, The Lizards And The Jews&quot;, broadcaster and journalist Jon Ronson encounters one of Britain's most infamous media figures as he continues his search to uncover the truth behind who - or what - is really controlling the world. Tonight Ronson joins David Icke on a lecture tour that takes the ex-sports broadcaster headlong into controversy as his extraordinary views dismay his detractors and inspire his audiences, providing a fascinating insight into extremists - and how the public responds to them.\n\nDavid Icke was once the most ridiculed man in Britain after declaring on The Terry Wogan Show that he was the Son of God. But he has now resurrected his career and is an internationally successful conspiracy investigator who lectures to packed houses world-wide. His latest theory is that the ruling elite are genetically descended from a race of 12-foot blood-drinking, shape-shifting lizards. But when Icke says lizards does he just actually mean lizards, as he steadfastly maintains? Or does he, as a powerful coalition of prominent Jewish groups claim, mean Jews?\n\nRonson witnesses the media circus that ensues from Icke's tour of Canada. The Anti-Defamation League (ADF), the world's most powerful Jewish defence organization, and a coalition of leftist campaigners strongly oppose Icke's tour. The ADL believe that 'lizard' is code word for Jews, but Icke vehemently denies this. They point out that Icke has many followers on the extreme right. The hardcore neo-Nazis Unit Combat 18 once attended a lecture of his in London and gave him a glowing review in their newsletter. Old anti-Semitic cartoons from Eastern Europe portray Jews in a lizard-type way. Is this just coincidence?\nIn Vancouver, a coalition of prominent anti-racists call an emergency anti-Icke meeting. One member comments, &quot;Above all, I think David Icke represents a political threat, because his writings are anti-Semitic.&quot; Efforts are also made by protestors to have Icke deported and his book seized and incinerated under Canadian Hate Crimes Legislation.\n\nIcke is invited to a book signing at one of Canada's biggest book chains unaware that they have received calls warning about possible violent demonstrations. As a result, the book signing is called off. Following this, two radio interviews are cancelled. Icke views these attacks as part of dynamics of the conspiracy which prevent the truth from being told and calls one of the offending radio station managers &quot;one of the architects, unknowingly, of the destruction of our freedom.&quot;\nBut the anti-Icke coalition begins to fall apart. The powerful Canadian Jewish Congress has already withdrawn, stunned by the lack of public support. The few remaining protestors resort to desperate measures. They decide to toss a cream-pie at Icke at a book signing; two protestors don giant lizard outfits as a decoy. In an embarrassing moment they miss, hitting the children's book section instead. 50 min. A must see for everyone.\n\nVideo specs:\nwindows media video\nduration 48:54\nbitrate 512 kbps\n320x240\n","torrent":{"xt":"urn:btih:3171200d40780820f3da229dc0ccd82364e12ef2","amp;dn":"BBC%3A+David+Icke%2C+The+Lizards+And+The+Jews+%28ADL+exposed+as+Haters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3171200d40780820f3da229dc0ccd82364e12ef2","infoHashBuffer":{"type":"Buffer","data":[49,113,32,13,64,120,8,32,243,218,34,157,192,204,216,35,100,225,46,242]},"announce":[],"urlList":[]}}