{"title":"Brave Belt - Brave Belt (1971/VBR) - viyl-rip","uid":3391338,"size":61271940,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:319d802a687d3f69d9c31712a4b3ac544565b985&amp;dn=Brave+Belt+-+Brave+Belt+%281971%2FVBR%29+-+viyl-rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reride","files":14,"time":1128286595,"description":"Brave Belt is an amazing band; the missing link between early Guess Who and Bachman Turner Overdrive. Chad Allan contributes two very British-sounding compositions on side one, &quot;I Am the Man&quot; and French Kiss; the latter with country flavors, and the former as poppy as Kaleidoscope U.K. C.F. Turner slips in two appearances, and by the second Brave Belt disc he would become the vocalist. Chad Allan's contributions, not as dominant as they are here, was quickly evolving the band into BTO, Bachman Turner Overdrive. When Randy Bachman sings without the help of Chad Allan or C.F. Turner, specifically on &quot;Waitin' There for Me,&quot; &quot;It's Over,&quot; and &quot;Anyday Means Tomorrow,&quot; it is that neo-falsetto voice he made so famous on &quot;You Ain't Seen Nothing Yet&quot; from the album Not Fragile. But it is Chad Allan who is the vocal star here with &quot;Scarecrow,&quot; a fine example of psychedelia, superb production, and downright eerie guitar by Bachman. The cover photo, with two of the Bachman brothers and Chad Allan in the snow wearing fur coats, is misleading. This looks like a country-rock group. In actuality it's an amalgam of sounds from pre-Guess Who, validating Chad Allan &amp; the Expressions (maligned by so many inferior albums flooding the market with the initial Guess Who hit, &quot;Shaking All Over,&quot; and additional tracks culled from who knows where) and post-Guess Who B.T.O. &quot;Wandering Fantasy Girl&quot; is definite British rock again, while &quot;I Wouldn't Trade My Guitar for a Woman&quot; is the country music the front and back covers promise. &quot;Holy Train&quot; is more valuable music from Chad Allan, proof that his contributions are as essential as those of Randy Bachman. While the Guess Who were hitting with Share the Land, their former bandmates were being very creative. It's too bad this album did not get more attention, and it's even more tragic that Chad Allan didn't stay onboard for Bachman Turner Overdrive. ~ Joe Viglione, All Music Guide","torrent":{"xt":"urn:btih:319d802a687d3f69d9c31712a4b3ac544565b985","amp;dn":"Brave+Belt+-+Brave+Belt+%281971%2FVBR%29+-+viyl-rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319d802a687d3f69d9c31712a4b3ac544565b985","infoHashBuffer":{"type":"Buffer","data":[49,157,128,42,104,125,63,105,217,195,23,18,164,179,172,84,69,101,185,133]},"announce":[],"urlList":[]}}