{"title":"AM/FM - Mutilate Us (2001)","uid":3380837,"size":67111500,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:31ad892f42e9bd18b272f0382cd183127e1aa8c8&amp;dn=AM%2FFM+-+Mutilate+Us+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"raisincain78","files":14,"time":1126215824,"description":"1. Mutilate Us (0.13)\n   2. Secretly Odds In Knowing Normal Worlds (2.33)\n   3. A Best Man (2.58)\n   4. You And Me At 53 (1.41)\n   5. Those Long Arms (2.11)\n   6. Yours Recklessly (4.01)\n   7. LeAnne, The Seasons Persist (6.37)\n   8. When I Died In Sebastopol (3.39)\n   9. Time Flows Much More Slowly This Way (3.04)\n  10. When Larry And Gary Get Married (3.43)\n  11. Disney Girls (3.45)\n  12. Sucess Rides A Shiny White Line (1.51)\n  13. Mutilate Us (5.35)\n  14. Bonus Track (1.48)\n\nFrom Pitchfork Media:\n\nIn the top right corner of the cover of Mutilate Us, below the bandname and album title, is a quote culled from the LP's title track: &quot;And if we are the ones that will cross mountains for love/ Then we are the ones that let love mutilate us.&quot; It's hard to think of a tactic that's more self-congratulatory than incorporating lyrics into your cover art, especially when they're also printed in the liner notes. And really, it doesn't benefit much in the way of advertising. The words are just shy of being trite, and bespeak no insight that goes beyond the obvious. Plus, the abstract construct of &quot;love&quot; is the crux of the sentiment.\n\nSo, it's at least a little surprising that scrupulous ex-Franklin member Brian Sokel and multi-instrumentalist Michael Parsell's current project, AM/FM, doesn't come off the least bit smarmy on record. The Philadelphia-based duo's debut full-length is an unpretentious collection of lo-fi, acoustic-based pop tunes bolstered by Sokel's warm delivery. AM/FM has the charm and slightly skewed pop sensibilities of Ween, but in song structure only. Though, come to think of it, fecal humor and hallucinogenic abuse might be intriguing coming from the Polyvinyl camp.\n\nMutilate Us successfully skirts stuffiness with light-hearted sincerity. On the upbeat &quot;Secretly Odds in Knowing Normal Words,&quot; Sokel sings, &quot;You said I was full of shit/ But what's wrong with that?&quot; backed by bouncy percussion and hand-claps. &quot;Yours Recklessly&quot; is minor-keyed, folk territory, not entirely dissimilar from Elliott Smith's recent offerings. It opens on a wobbly solo-acoustic note, but the song's dense, swelling climax is a lovely pay-off. &quot;Time Flows Much More Slowly This Way&quot; is almost absurd in its catchiness, and serves as just one of many examples of the adroit songwriting showcased on the album.\n\nThis doesn't mean, though, that Mutilate Us is as consistently great as the aforementioned tracks. Sokel and Parsell sometimes sink too comfortably into poppiness and end up tripping over yesteryear's indie rock clich&amp;eacute;s. &quot;You and Me at 53&quot; is pedestrian in its aim to emulate the Cars, and its execution is worse still, echoing latter-day Promise Ring emergencies. &quot;Leanne, The Seasons Persist&quot; tends toward emo-pop with quiet, building instrumentation during the verses, but the predictability of the song's explosive between-verse segues render them completely ineffective.\n\nStill, the occasional misfires of Mutilate Us are forgivable; like most of the record's tracks, they're brief, often clocking in under two minutes. And when the record is successful, it's like a piston blasting warm guitar pop at incredible speeds. The bulk of the record is so assured that by the time its last lines are sung (those that adorn the album's cover), it's hard to not take their genuineness to heart and believe them.\n\n-Richard M. Juzwiak, May, 2001\n\n","torrent":{"xt":"urn:btih:31ad892f42e9bd18b272f0382cd183127e1aa8c8","amp;dn":"AM%2FFM+-+Mutilate+Us+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ad892f42e9bd18b272f0382cd183127e1aa8c8","infoHashBuffer":{"type":"Buffer","data":[49,173,137,47,66,233,189,24,178,114,240,56,44,209,131,18,126,26,168,200]},"announce":[],"urlList":[]}}