{"title":"The_Good_The_Bad_And_The_Ugly (xvid110-sickboy88)","uid":3404493,"size":1048566213,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31ff4eb6c09ce81675292e643c1c73cc4ea3e33d&amp;dn=The_Good_The_Bad_And_The_Ugly+%28xvid110-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sickboy88","files":3,"time":1130967526,"description":"The Good, the Bad and the Ugly (1966)\n\nIMDB Link:\n\nhttp://www.imdb.com/title/tt0060196/\n\n----\n\nThis movie is number 10 on IMDB's top movies of all time list:\n\nhttp://www.imdb.com/chart/top\n\n----\n\nA request for &quot;Judge Ito&quot;. This is a must see film. I encoded this from the enchanced widescreen dvd, with a bitrate that matched the visual quality of the dvd ...yeah...this means it looks just like the dvd.\n\nAlso note:\n\n***There are *TWO* audio tracks in this film***\n\nEnglish is the main audio track...if you select the second audio track, you will get a French dub...I figured why the fuck not, since French is the most widely spoken language in the world.\n\nPlease, don't be retarded, and send me an IM bitching because you were not smart enough to choose the English Audio Track, and instead, let your software default to French. I've got numerous emails/IM's from people saying &quot;Thanks for fucking up Harold and Kumar by having director's commentary over the whole fucking movie&quot;...yet these stupid fucks can't even read that the .avi had TWO fucking audio tracks in the movie. I've encoded 6-7 films with 2 or MORE audio tracks, and I keep getting questions about them...get with the fucking program people. Audio track 1 is ALWAYS the main soundtrack. Tracks 2 and on are ALWAYS supplementary.\n\nExternal English, Spanish, and French subs in VOBsub format.\n\n----\n\nMini Plot:\n\nTwo gunmen have formed a partnership. One is a wanted man (the Ugly) and his partner (the Good) will turn him in for the reward. When the hanging takes place, Good shoots the rope clean through and allows Ugly to escape. When they have a falling out, Good leaves Ugly in the desert. Ugly vows Revenge and tracks Good down and repeats the favor. Just before passing out, a dying man gives Good the secret of a hidden payroll. Both of them end up in a Union Prisoner of War camp run by a sadistic Union officer (The Bad) who discovers their secret and wants the treasure, taking them from the camp to find the cash.\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 721 kb/s AVG\nAspect: 640x288 = 2.22:1\nAudio 1: English, 60 kb/s VBR AVG MONO @ 48K Hz\nAudio 2: French, 60 kb/s VBR AVG MONO @ 48K Hz\nSubtitles: External: English, Spanish, French - VOBsub Format\nRuntime: 02:42:39\nFPS: 23.976\n\n----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nNow at Beta 2!\n\nhttp://www.koepi.org/XviD-1.1.0-Beta2-04042005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn\non (Y) and (UV) deblocking, and the new feature of\nXviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, please turn off pre-processing. I don't want\nanother stupid motherfucker telling me that my movies are out of sync\nbecause they are totally computer illiterate.","torrent":{"xt":"urn:btih:31ff4eb6c09ce81675292e643c1c73cc4ea3e33d","amp;dn":"The_Good_The_Bad_And_The_Ugly+%28xvid110-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ff4eb6c09ce81675292e643c1c73cc4ea3e33d","infoHashBuffer":{"type":"Buffer","data":[49,255,78,182,192,156,232,22,117,41,46,100,60,28,115,204,78,163,227,61]},"announce":[],"urlList":[]}}