{"title":"Genesis - A Trick of the Tail @320 Kbs","uid":3300477,"size":123096037,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:331811d8ea3fad99473e309f9b2b97736ed67c39&amp;dn=Genesis+-+A+Trick+of+the+Tail+%40320+Kbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KingStar","files":10,"time":1110491517,"description":"The quality of the group's first post-Peter Gabriel album astonished everyone, especially coming out after an 18-month gap following The Lamb Lies Down on Broadway. The opening number, &quot;Dance on a Volcano,&quot; almost deliberately recalls &quot;Cinema Show&quot; from Selling England by the Pound in melody and structure, and Phil Collins sounds more like Peter Gabriel than Gabriel himself did. Tony Banks and Steve Hackett's &quot;Entangled&quot; was the prettiest song the group had recorded up to that time, a gossamer-textured piece about sleep and dreaming in which a strummed acoustic guitar makes its most prominent appearance ever on a Genesis song, supported by the sweetest singing of Collins' career. Not all of the material is in league with these two songs, but all of it has some moments of tremendous beauty, and Banks' &quot;Robbery, Assault and Battery,&quot; with its bold, hard-rocking choruses and extended song structure, would have been worthy of inclusion on any of the group's earlier records. Even &quot;Los Endos,&quot; an instrumental finale that ought to be considered a cop-out in the absence of a good song, provides the quartet with an opportunity to showcase its still considerable collective skills to which few fans could object.\n\nSearch for KingStar to find my torrents","torrent":{"xt":"urn:btih:331811d8ea3fad99473e309f9b2b97736ed67c39","amp;dn":"Genesis+-+A+Trick+of+the+Tail+%40320+Kbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"331811d8ea3fad99473e309f9b2b97736ed67c39","infoHashBuffer":{"type":"Buffer","data":[51,24,17,216,234,63,173,153,71,62,48,159,155,43,151,115,110,214,124,57]},"announce":[],"urlList":[]}}