{"title":"Sexy Beast (2000) Special Edition DVDR","uid":3440197,"size":4687740928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:333bc1855a9657fb88ddccd162e0ffd19d820d08&amp;dn=Sexy+Beast+%282000%29+Special+Edition+DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"derek985","files":36,"time":1139077109,"description":"Sexy Beast (2000) Special Edition DVDR\n\nRip Info:\n\nThis is a beautifully done rip directly from the retail DVD. The movie is in 2.35:1 aspect ratio with all menus and extras preserved, english audio (2,3, &amp; 6 ch.) with english subtitles only. There are no multipart RAR&amp;#039;s or IMG/ISO files to deal with here, just the whole VIDEO_TS directory ready to be played or burned to a DVD as soon as your download is complete. Enjoy!\n\nPlot Summary:\n\nA retired British gangster (Ray Winstone) is trying to keep out of a London heist, despite the efforts of Don Logan (Ben Kingsley), a goateed, shaved-headed pit bull of a gangster in this raw, startling film that grabs your attention and never lets go. Gary &quot;Gal&quot; Dove lounges at his villa on Costa del Sol, with not a care in the world, until his Mediterranean paradise is interrupted by Logan, just arrived to recruit Gal for a London heist led by mob boss Teddy Bass (Ian McShane). Gal refuses the job; Logan won&amp;#039;t hear it. He&amp;#039;s human nitroglycerine, ready to explode at the slightest provocation, spewing Cockney profanities like armor-piercing bullets. Sexy Beast presents him as hilarious and horrifying, a soloist whose instrument is pure, bilious rage.\n\nKingsley&amp;#039;s volatile performance--the polar opposite of his OscarÂ®-winning role in Gandhi--expands the actor&amp;#039;s range into startlingly unexpected territory. It&amp;#039;s the white-hot center of Sexy Beast, but the feature debut of director Jonathan Glazer (after acclaimed TV commercials and music videos) is equally noteworthy for the performance of the lesser-known Winstone, and also for Glazer&amp;#039;s brass-knuckle approach to what is, essentially, a conventional gangland thriller. Glazer&amp;#039;s instincts aren&amp;#039;t always sound (dream sequences involving a hideous man-rabbit prove a bit too peculiar), but with pugilistic rhythm and a humorous knack for combining well-chosen songs and a rough, kinetic visual style, Sexy Beast is a wild ride.","torrent":{"xt":"urn:btih:333bc1855a9657fb88ddccd162e0ffd19d820d08","amp;dn":"Sexy+Beast+%282000%29+Special+Edition+DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"333bc1855a9657fb88ddccd162e0ffd19d820d08","infoHashBuffer":{"type":"Buffer","data":[51,59,193,133,90,150,87,251,136,221,204,209,98,224,255,209,157,130,13,8]},"announce":[],"urlList":[]}}