{"title":"BBC - Don't Panic. I'm Islamic.","uid":3441424,"size":1290462326,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33544ca432ed6f9a5a7f8e9f1750fcb03d407ec3&amp;dn=BBC+-+Don%5C%27t+Panic.+I%5C%27m+Islamic.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"user88","files":2,"time":1139340752,"description":"This programme was first broadcast Sunday 12 June 2005, 19:00\n\nSalma, a mother of three from Birmingham, is one of a community of two million Muslims living in Britain. &quot;The words go together don&amp;#039;t they - Islamic terrorism&quot;, she says.\n\nDon&amp;#039;t Panic, I&amp;#039;m Islamic meets Muslims who speak openly about what it means to be a British Muslim ? at a time when the nation is fighting a &amp;#039;war on terror&amp;#039;.\n\n&quot;If you have a Muslim name or wear a beard, we are all tarnished with the same brush,&quot; says Tariq, a PR executive. World events are forcing young Muslims to confront a crisis over their identity. Tariq changed his name to Daniel Jacob in order to get a job after a series of rejections for employment that he was amply qualified - as Daniel, job offers flooded in.\n\t\nThe programme also uncovers the implications of the prejudice they encounter. Mohamed has been called &amp;#039;Osama bin London&amp;#039; because he dresses in white robes and a headscarf similar to that worn by the prophet. &quot;They all gathered around me when I went to the airport,&quot; he says, &quot;simply because I wear Islamic robes. I told the airport security that I wouldn&amp;#039;t be so stupid to dress up like this if I was carrying a bomb.&quot;\n\nOn the other hand, Sajidah, a softly spoken mother from Slough, explains: &quot;There are many Muslims that come on the television but no one will ever say that they support Bin Laden. But privately if you speak to people there are many that will say what he did was right, that they (America) needed that smack in the face&quot;. While Sajidah sympathised with the victims of 9/11, she says that when Muslims are killed - such as those during the war and continuing strife in Iraq - there are no candlelight vigils or stirring speeches about punishing the perpetrators.\n\nThe comfortable middle ground is eroding as Muslims are asked to either accept the &amp;#039;war on terror&amp;#039; and deny their heritage or become radicalised and condemned as &amp;#039;terrorists&amp;#039;. Don&amp;#039;t Panic, I&amp;#039;m Islamic reveals a new current of Islam emerging among those in Britain&amp;#039;s youth who reject the need to &amp;#039;integrate&amp;#039;. &quot;I am British, just like someone else is blonde or a brunette,&quot; says one contributor. &quot;I don&amp;#039;t need to integrate.&quot;","torrent":{"xt":"urn:btih:33544ca432ed6f9a5a7f8e9f1750fcb03d407ec3","amp;dn":"BBC+-+Don%5C%27t+Panic.+I%5C%27m+Islamic.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33544ca432ed6f9a5a7f8e9f1750fcb03d407ec3","infoHashBuffer":{"type":"Buffer","data":[51,84,76,164,50,237,111,154,90,127,142,159,23,80,252,176,61,64,126,195]},"announce":[],"urlList":[]}}