{"title":"EVE Online Red Moon Rising v2.10.3900 Bloodlines","uid":3467650,"size":577907774,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:33c5b5b83321113b6bad9206a568423cd64ae692&amp;dn=EVE+Online+Red+Moon+Rising+v2.10.3900+Bloodlines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sullafelix","files":2,"time":1144378593,"description":"Visit the following URL to get a 14 day free cd key at this URL:\n &lt;a href=&quot;\nhttps://secure.eve-online.com/ft/?aid=101049&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://secure.eve-online.com/ft/?aid=101049&lt;/a&gt;\n\nEVE is a massive multiplayer online game (MMOG) set in a science-fiction based, persistent world. Players take the role of spaceship pilots seeking fame, fortune, and adventure in a huge, complex, exciting, and sometimes hostile galaxy.\n\nThis is the GTA of MMOs... it is legal to pirate and ransom other players\nfor in game cash.\n\nCarolus Martellus writes:\n\nEve Online is set in an unknown portion of space, spanning thousands of solar\nsystems, many of which are settled.\n\nThis Travel Warning is being issued to remind all pilots of ongoing security\nconcerns in low-sec Empire &amp; 0.0 Space. This Travel Warning supersedes\nprevious travel warnings.\n\nPilots involved in commercial or property matters should be aware that the\nbusiness environment is complex and dispute settlement mechanisms are not\nhighly developed. Corporations often cite corruption and ineffective courts as\nserious problems.\n\nSAFETY AND SECURITY \nAlliances strictly enforces its immigration/visa requirements. Pilots have\nbeen attacked for territory violations. Violators may also be subject to\nsubstantial fines. \n\nPilots should avoid travel to 0.0 space. Alliances restricts foreigners&amp;#039;\ntravel to their territory; many carebears and NPC hunters were attacked in\nthese territories by Alliance security forces in the past year.\n\nMost alliances will kill on sight anyone entering their space even if you are\nneutral and especially if you are a member of a &quot;NPC&quot; corporation (you could\nbe using an alternate identity and scouting for an opposing force.\n\nPirates and carebears should maintain a low profile, vary daily routines,\navoid crowds and demonstrations, and keep abreast of current Eve events.\n\nPIRACY\n\nEve piracy is a persistent and growing problem in low-sec and 0.0 space,\ntargeting primarily commercial vessels. The majority of piracy attacks occur\nin low-sec (&lt;0.5) and 0.0 space. Before traveling by ship in these areas,\npilots are advised to review the current security situation with their\ncorporation and alliance members.\n\nDue to ongoing concerns about the possibility of pirate attacks directed\nagainst alliances or other corporation and interests, CONCORD continues to\nwarn pilots to defer non-essential travel to low-security space.\n\nAlways be alert even in empire; the cost of a few suicide battleships is\nnothing compared to the price of a Tech 2 BPO.\n\nNever travel when away from keyboard. You deserve to die.\n\nIf pirates are scrambling you and you lost your tank, do not wait until you&amp;#039;re\ninto structure, CEASE FIRE &amp; STOP YOUR ENGINE. Attempt to comply with all\ninstructions from the hijackers, and also make it clear that you are willing\nto pay a ransom.\nYou will have no more than thirty seconds to transfer the ISK.\n\nIf you beg for help or smack in local, you&amp;#039;ll die a violent death.\n\nIf you really don&amp;#039;t have the money, offer the pirates to eject from your ship;\nthey will let you and your pod warp to safety.\n\nIf you are a slow keyboard type, use the Eve notepad facility to your\nadvantage to cut and paste cooked answers.\n(ref: Eve Low-sec Phrase Book [we need translators])\n\nDon&amp;#039;t hesitate to ask your attackers for tips and advise. \n\nBe polite (say thank you) and never smack in local after paying your ransom;\nyou don&amp;#039;t need to make a fool of yourself.\nOnce I attacked a merlin, which appeared later to be a harpy. I didn&amp;#039;t live\nlong but it was fun, convo&amp;#039;d the pilot and joked about my mistake and thanked\nhim for the fight. He congratulated me for my fair-play and gave me a full mil\nof isk, about twice the value of my ship.\n\nCalm yourself and enjoy the moment.\n\n&quot;In exactly the way that you justify doing the same to the whole world. But\nbecause I do it with a single paltry ship, I am called a pirate; while you do\nit with a large navy, and are called an emperor.&quot; Augustine of Hippo, Civitas\nDei (Book IV, Chapter iv)\n","torrent":{"xt":"urn:btih:33c5b5b83321113b6bad9206a568423cd64ae692","amp;dn":"EVE+Online+Red+Moon+Rising+v2.10.3900+Bloodlines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c5b5b83321113b6bad9206a568423cd64ae692","infoHashBuffer":{"type":"Buffer","data":[51,197,181,184,51,33,17,59,107,173,146,6,165,104,66,60,214,74,230,146]},"announce":[],"urlList":[]}}