{"title":"hal's Death by Jefferson Airplane Bootlegs Compilation (5 CDs;","uid":3420243,"size":703530580,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3617e3af3867c08c57b8e28b282788d22a56649e&amp;dn=hal%5C%27s+Death+by+Jefferson+Airplane+Bootlegs+Compilation+%285+CDs%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"P. Olybios","files":68,"time":1134359740,"description":"\n              HAL'S DEATH BY JEFFERSON AIRPLANE BOOTLEGS COMPILATION (complete)\n                        \nby &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;bfd7ded3ddcdd0d0d2daffc6ded7d0d091dcd0d2&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nAn aural history of the Jefferson Airplane as done through chronologically-placed live performances caught on bootlegs.  CDs 1 - 4 cover the band's history from 1966 through the 1989 reunion tour, and CD 5 briefly touches upon the post-JA bands with snippets of live interviews with band members old and new.\n\n*****\nMP3 conversion by P. Olybios (256 kbps) from original FLAC files.\n*****\nCD 1\n\n[While the following songs were traded to me as the given dates, it appears\nthat all are from several Sept/Oct '66 Winterland and Fillmore shows that\nwere collapsed into a show purportedly Sept. 30th! Grain of salt time;\nthe early period of the JA is steeped in myth, fiction &amp; fantasy . . .\nand some of us like it that way 8').]\n\nOther Side of this Life\nIt's No Secret\n\nSept. 23, 1966? -- Signe Anderson is the lead singer, but will leave the band\nin just two months. The sound of a plane taking off that opens this set was used\nfor several songs, and is most likely the progenitor of the starship taking off\nin Paul's BLOWS AGAINST THE EMPIRE.\n\n--\n\nCome Up the Years\nFly Trans Love Airways\n\nOct. 2, 1966? -- first appearance of Donovan's &quot;Fat Angel,&quot; a.k.a. &quot;Fly Trans\nLove Airways.&quot;  The original fat angel was Mama Cass Elliot of the Mamas and the\nPapas, and of course the Airplane was an additional allusion.\n\n--\n\nDon't Slip Away\nHigh Flying Bird\n\nOct. 7, 1966? -- These songs originally appeared with Signe as vocalist,\nalthough early Grace versions do exist.\n\n--\n\n[We're on a little bit firmer ground with the next; however, there is the matter\nof Grace's first show -- either Oct. 16th, or taped for the first time Nov. 6th.\nOnce again I've given the trading dates to these, but be aware they are debatable.]\n\nBringing Me Down\nJam\n\nOct. 14, 1966 -- Signe begins her last three-day run at the Fillmore.  Confusion\nexists over whether she finished the entire run, or whether Grace stepped in\non the last day, Nov. 16, so I have just put in the known Signe run of the first\ntwo days.\n\n--\n\nBill Graham intro &gt; jam\n3-5ths of a Mile in Ten Seconds\n\nOct. 15th, 1966 -- first appearance of &quot;3-5ths of a Mile&quot; and with Signe as\nvocalist.  Grace's version would of course open SURREALISTIC PILLOW.\n\n-- \n\nMy Best Friend\nPlastic Fantastic Lover\nToday\nWhite Rabbit\nIn the Midnight Hour\nShe Has Funny Cars\n\nNov. 6, 1966 (Oct. 16?) -- Some have argued this is the third day of the Oct.\nFillmore run, or else another venue closer to that date.  A historic concert,\nwhatever the real date.\n\n--\n\nSomebody to Love -- Nov. 25th, 1966  &lt;-- Grace had performed this with her original\nGo To Her        -- Nov. 26th, 1966      band, the Great Society, but this is the\n                                         first Airplane appearance of the hit.  Both\n                                         Signe and Grace have versions of the\n                                         latter song; this is Grace's.\n\n*****\nCD 2\n\nRonald Reagan's reaction to the new &quot;scene&quot;\nGet Together\n\nFeb. 4, 1967 -- classic speech by a young governor as well as a classic\nsong by Dino Valenti.  From the venerable SF NIGHTS collection.\n\n--\n\nCome Back Baby\nDon't Let Me Down\n\nMarch, 1967\n\n--\n\nSaturday Afternoon / Won't You Try\n\nMay 19, 1967\n\n--\n\nSaturday Afternoon / Won't You Try\nMartha\n\nOct. 2-5 (?), 1967 -- rehearsals for recording AFTER BATHING AT BAXTER'S.  Very\nhaunting &quot;Martha&quot; jam with Grace on recorder and keyboards.\n\n--\n\nYoung Girl Sunday Blues\nTwo Heads\nShare a Little Joke\n\nFeb. 1, 1968\n\n--\n\nStar Track\nGreasy Heart\n\nMay 17-18, 1968.  Rare live performance of Jorma's contribution to a new album in the\nmaking, CROWN OF CREATION, and Grace's (not the first appearance of &quot;GH,&quot; that was\na day earlier on the 17th, and this is from the 18th).\n\n*****\nCD 3\n\nFat Angel -- May 18th, 1968 . . . a later version emphasizing its jam nature.\n\n--\n\nWooden Ships -- April 26, 1969 . . . first live appearance of the Airplane version;\nthe song was co-written by Paul, David Crosby, and Steven Stills, who also did a\nversion of their own.\n\n--\n\nGood Shepherd\nWe Can Be Together\n\nMay 7, 1969 -- more tunes from the album in progress, VOLUNTEERS.\n\n--\n\nBallad of You, Me, &amp; Pooneil -- June 9, 1969 . . . another version.\n\n--\n\nGood Shepherd\nEskimo Blue Day -- June 13, 1969 . . . from the famous Family Dog shows.  The last\nsong, a favorite, was rarely performed in concert, the most famous version\ncoming from the commercially available WOODSTOCK II album.  I thought about putting\nthat in, but at the very last moment came across another live version 8').\n\n--\n\nWild Thyme\nEskimo Blue Day\n\nOct. 26, 1969 -- a version of &quot;EBD&quot; just a few months after Woodstock.\n\n--\n\nGreasy Heart -- Feb. 2, 1970 . . . now a staple song.\n\nHave You Seen the Saucers -- March 24, 1970 . . . a first appearance.\n\n*****\nCD 4\n\nCrown of Creation -- May 1st, 1970.\n\nMexico -- May 7, 1970.\n\nEat Starch Mom -- Sept. 3, 1972 -- the Airplane is near the end of its run; Marty\nis nearly finished with them, but Grace and Paul pull together, as do Jorma and Jack.\n\nBlind John\nLong John Silver\nAerie\nSept. 22, 1972 -- famous last concert of the Airplane; lots of versions exist as\nit appeared (in quadraphonic!) on radio.  This is the fullest and best-sounding\nof the many versions that I have.  &quot;Blind John&quot; was on a Micky Hart solo album with\nappearances by members of the Airplane, and &quot;Long John Silver&quot; was the album of\nthe day being promoted; not until 1989 would the original Airplane put out another.\n&quot;Feel So Good&quot; indicates the direction Jorma and Jack would head (Hot Tuna).\n\nLove Don't Lie\nSept. 10, 1984 -- Free concert at the Bandshell by Marty and his solo band; Paul\nKantner surprises the crowd by showing up for a few old Airplane tunes:  this\nlays the groundwork for the KBC Band when Casady joins in, and leads directly\nto the Airplane reunion five years later.\n\nPlanes\nAug. 18, 1989 -- Riverside Theater, Milwaukee.  First stop on the 1989 reunion\ntour, and the first public performance of &quot;Planes&quot; by the reunited Airplane\n(their first single off the 1989 album).\n\nGood Shepherd\nFreedom\nSept. 22, 1989 -- my first Airplane concert!  Coincidentally it was 17 years to\nthe day of the very last original Airplane concert above.  &quot;Freedom&quot; was Grace's \ncontribution to the reunion album that year, and was a show-stopper at the end of\nthe first set; her version here is so brilliant that a friend of mine who went\nalong with me said to me, somewhat disgustedly, &quot;she has NO right to still sing that\nwell!&quot;\n\nSummer of Love\nTrue Love\nCrown of Creation\n\nSept. 30, 1989 -- two songs from the reunion album, and an old favorite as encore.\nThis free concert in Golden Gate Park was the last full concert by the original\nAirplane, and was a memorable experience of mine.\n\nShe Has Funny Cars\nOct. 7, 1989 -- last appearance of the original Airplane, who performed five songs\nin Washington D.C. at a free concert to highlight the plight of the homeless.\n\n*****\nCD 5\n\nBrief snippets of interviews I have done with Airplane / Starship members followed\nby songs of that particular member:\n\nHal talks with Jorma\n\nPlastic Fantastic Lover -- Sept. 28th, 1989 -- the last JA show at the Fillmore.\n\nHal talks with Papa John\n\nSomewhere Over the Rainbow -- Oct. 9, 1992 . . . Paul's new lineup of the Jefferson\nStarship, featuring Paul, Jack on bass, Prairie Prince on drums, Slick Aguilar (who,\nbtw, was once lead guitarist for Crosby and Nash), and a new female vocalist,\nDarby Gould, formerly of World Entertainment War.\n\nHal talks with Darby Gould\n\nGenesis Hall -- Darby sang covers suggested by Paul: interesting choice, no? 8')\nAlso from the Catalyst, Santa Cruz, concert where Papa John played SotR.  I was\nbackstage beforehand talking to Papa John, and perhaps they both played and sang\nthese numbers for me, as I had asked about SotR and told Darby I was a Fairport\nConvention fan. . . .\n\nPERRO -- the studio efforts here were done at Wally Heider's studio in SF, and\ninclude an interesting mix of people:  here David Crosby experiments with a new\nsong of his with help from Paul and Jack (Phil?) and Jorma and Grace and Jerry Garcia.\nPaul dubbed them &quot;the Planet Earth Rock and Roll Orchestra&quot; and had them guest\non several early Jefferson Starship albums.  This selection is #15, the fourth\nin various tries of Crosby's song.  He never finished it, but Paul did.\n\nMountain Song\nHave You Seen the Stars Tonight\n\nFeb. 13, 1994 -- this is Paul Kantner and Jack and Diana Mangano (Darby's\nreplacement) at the Seva Benefit, along with Tim Gorman on keyboards.  Here Paul\nplays the unfinished Crosby song above with his own lyrics, and then invites\nCrosby to sing on another song they wrote together, the gorgeous &quot;Have You Seen\nthe Stars Tonight.&quot;\n\nSilver Spoon\n\nA demo by Grace.  Later Jack Casady came in and helped her finish it off for the\nSUNFIGHTER album.  \n\nTranscaucasion White Boy\n\nMore PERRO-influenced music; from the working tapes of BARON VON TOLLBOOTH\nAND THE CHROME NUN (David Crosby's pet names for Paul and Grace).\nBLOWS AGAINST THE EMPIRE\n\nA live performance by the classic early Jefferson Starship (Johnny Barbata, who\nplayed drums for CSN&amp;Y; Papa John; Paul; Grace; and Pete Sears who later also\nplayed for Hot Tuna, and still does on occasion).  At Radio City Music Hall in\nNew York, Oct. 19, 1974.  Again you hear Crosby/Paul's HYSTST, as\nwell as the final arrangment by Graham Nash for Paul's first solo album.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:3617e3af3867c08c57b8e28b282788d22a56649e","amp;dn":"hal%5C%27s+Death+by+Jefferson+Airplane+Bootlegs+Compilation+%285+CDs%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3617e3af3867c08c57b8e28b282788d22a56649e","infoHashBuffer":{"type":"Buffer","data":[54,23,227,175,56,103,192,140,87,184,226,139,40,39,136,210,42,86,100,158]},"announce":[],"urlList":[]}}