{"title":"Rob Essers - Raincolors (New Age 2002)","uid":3500383,"size":149454989,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:362da8b73584a5bb11883f2879065210226d19ac&amp;dn=Rob+Essers+-+Raincolors+%28New+Age+2002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Groove Unlimited","files":17,"time":1151866155,"description":"Artist     : Rob Essers\nAlbum      : Raincolors\nSource     : CD\nYear       : 2002\nGenre      : New Age\nLabel      : Cue Records / Groove Unlimited (re-release)\n\nCodec      : LAME 3.93 \nQuality    : CBR, 256kbps, stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\n\n\nIncluded   : This Info-File (NFO)\n             Frontcover\n             Backcover\n\nTracklisting\n------------\n(6:45) 01 - The Ability to Dream\n(5:30) 02 - A Walk Through...\n(4:33) 03 - Truceless\n(5:14) 04 - Sparkles\n(5:35) 05 - Square One\n(7:33) 06 - Luscious Feelings\n(3:59) 07 - Monochromatic\n(5:54) 08 - Colors of Rain\n(6:06) 09 - Loosing Chains\n(9:26) 10 - Electrons\n(4:52) 11 - The Trivial Round of Life\n(4:47) 12 - The Gateway\n(4:07) 13 - Dream House\n(3:19) 14 - In Locked Places\n\nPlaying Time : 77:40\nTotal Size   : 142 MB\n\n\nThis reissue of Rob Esser?s sought-after first album consists of the 11 original tracks recorded in 1992 and 1993, and 3 bonus tracks recorded within a year or two of that, fitting in very well with the rest. It all adds up to nearly 78 minutes of classic New Age (EM) with equal emphasis on melodies and sequencing. If you are a purist, note that the booklet indicates that some tempos have been changed ?to get more drive.? Not being familiar with the originals, all I can say is it does indeed have good ?drive,? beginning with ?The Ability To Dream,? a bouncy energetic number that sets the tone well. Dreamy soundscapes begin ?A Walk Through?,? continuing for a couple of minutes. The music seems to stop for a moment, but it then jumps right into the main theme, a great sequence in the style of early 80s Tangerine Dream. In fact, all the synth layers here have a feel very much like Tangram or Logos Live, two of my favorite TD discs. ?Truceless? has a very light bubbly sequence, but with dramatic overtones. Again one can?t help but think of TD?s heyday. ?Sparkles? is a bit on the softer side, headed almost toward TD?s Optical Race sound. ?Square One? also seems to draw more toward the highly melodic almost pop New Age sound explored in the late 80s and early 90s, A cool almost jazzy sequence begins ?Luscious Feelings,? but it too heads in a similar musical direction. Throughout, the emphasis is on lush layers of synthesizers woven together into a cohesive picture. The melody, rhythm, atmospherics and sequencing all fit neatly into individual packages. It all has a familiar feel to it for Berlin school New Age fans, but it has many good moments on it, like ?Monochromatic? and ?Electrons,? the former a brief laid-back affair with a great beat that chugs along, the latter a bright fast sequencer piece. At times I?m reminded of Dom F. Scab and John Lakveet, but the 80s-90s TD comparisons remain unavoidable, down to the stabbing harpsichord patch as ?In Locked Places? brings Raincolors to a close. This disc is fun to drive to, or to play while kicking back at home with friends.\n\n*************************************************************************\nReleases from  the New Age label Groove Unlimted, which include the back catalog, will now be distributed as free mp3s and lossless audio files. Check your favorite Bit Torrent sites and peer-to-peers for the mp3s, apes and flacs. Load up your Ipods and PCs and enjoy the music. Distribute this New Age Music freely!!! \nMusic wants to be free!! :-)\n-JimmyThaNAzi &amp; ThaKeeStoneKop\n**************************************************************************\n\n\n","torrent":{"xt":"urn:btih:362da8b73584a5bb11883f2879065210226d19ac","amp;dn":"Rob+Essers+-+Raincolors+%28New+Age+2002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"362da8b73584a5bb11883f2879065210226d19ac","infoHashBuffer":{"type":"Buffer","data":[54,45,168,183,53,132,165,187,17,136,63,40,121,6,82,16,34,109,25,172]},"announce":[],"urlList":[]}}