{"title":"The Three Stooges #183-189 (miss #189)","uid":3458408,"size":608581250,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:365148e9c42c855de2b849c1ac0862e4f4508599&amp;dn=The+Three+Stooges+%23183-189+%28miss+%23189%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PeterL99","files":13,"time":1142547792,"description":"Gypped in the Penthouse (1955)\n\n    Director: Jules White\n    Cast: Emil Sitka, Jean Willes\n\n    Larry and Shemp reminisce about their experiences with Jean, a diamond crazy gold digger each of them was gypped by. After telling their stories, they have a run in with Moe, who is now married to the same women. When Jean shows up, they deliver some stooge-style revenge.\n--------------------------------------------------------------------------------\nBedlam in Paradise (1955)\n\n    Director: Jules White\n    Cast: Phil Van Zandt, Vernon Dent, Sylvia Lewis, Symona Boniface\n\n    Shemp dies but cannot get into heaven until he reforms Moe and Larry. He returns to earth as an invisible spirit and sets out to prevent the other two Three Stooges, who are in league with the devil, from selling a phony invention (a fountain pen that writes under whip cream) to a rich couple. Shemp sabotages Moe and Larry&amp;#039; plans and makes it through the pearly gates.\n\nA remake of &quot;Heavenly Daze &quot;.\n--------------------------------------------------------------------------------\nStone Age Romeos (1955)\n\n    Director: Jules White\n    Cast: Emil Sitka, Dee Green, Nancy Saunders, Virginia Hunter\n\n    The Three Stooges hope to collect a reward by proving to a museum that cavemen still exist. They return from their expedition with a film purporting to show some stone age Three Stooges defending their women from other cavemen. The museum curators are about to pay they reward, until they overhear the Three Stooges talking about how they faked the film, with themselves playing the cavemen.\n\nThe stone age footage is reused from &quot;I&amp;#039;m a Monkey&amp;#039;s Uncle&quot;.\n--------------------------------------------------------------------------------\nWham Bam Slam (1955)\n\n    Director: Jules White\n    Cast: Matt McHugh, Alyn Loar, Dora Revier, Wanda Perry\n\n    Shemp is a sick man with a bad case of nerves. The stooge&amp;#039;s friend Claude, a self-taught healer, tries to cure Shemp with various home- made remedies. When nothing seems to work, Claude suggests they buy his old lemon of a car so they can take Shemp on a trip to the country. The car won&amp;#039;t start, and the trip never gets off the ground, but not to worry, Shemp is cured by all the excitement.\n\nA remake of &quot;Pardon my Backfire&quot;.\n--------------------------------------------------------------------------------\nHot Ice (1955)\n\n    Director: Jules White\n    Cast: Kenneth MacDonald, Christine McIntyre, Barbara Bartay\n\n    The Three Stooges apply for job as &amp;#039;Yard Men&amp;#039; at Scotland Yard, thinking they&amp;#039;ll become detectives, but instead wind up as gardeners. When they accidentally see a memo about the theft a famous diamond, the boys decide to go after the crooks. They find the crooks, but Shemp accidentally swallows the diamond which was hidden in a bowl of candy. The bad guys want to cut the diamond out, but the boys foil them with the help of a friendly gorilla.\n\nA remake of &quot;Crime on Their Hands&quot;, with Scotland Yard footage from &quot;Hot Scots&quot;.\n--------------------------------------------------------------------------------\nBlunder Boys (1955)\n\n    Director: Jules White\n    Cast: Emil Sitka, Kenneth MacDonald\n\n    The Three Stooges go to criminology school and graduate with the lowest possible honors. The boys join the police force and are assigned to track down a crook called the &quot;Eel&quot;, who disguises himself as a woman. The Three Stooges track the Eel to a hotel, but he slips through their hands after a wild chase. The Three Stooges are booted off the force and wind up as ditch diggers.\n\n","torrent":{"xt":"urn:btih:365148e9c42c855de2b849c1ac0862e4f4508599","amp;dn":"The+Three+Stooges+%23183-189+%28miss+%23189%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"365148e9c42c855de2b849c1ac0862e4f4508599","infoHashBuffer":{"type":"Buffer","data":[54,81,72,233,196,44,133,93,226,184,73,193,172,8,98,228,244,80,133,153]},"announce":[],"urlList":[]}}