{"title":"Ashampoo Magic Defrag v1.06","uid":3395568,"size":3647343,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:382a1a717c26c6ac7dacb487c47506e94c80b87b&amp;dn=Ashampoo+Magic+Defrag+v1.06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"useros","files":1,"time":1129137799,"description":"Magically defragments your system with ease!\nThe principle is ?Install &amp; Forget?. Ashampoo Magic Defrag runs in the background as a service, defragmenting when necessary to keep the hard disk tidy. The great thing about this is that the program manages it without ?stealing? any processor power from the user. Ashampoo Magic Defrag only activates when enough unused resources are available and stops immediately whenever the user does anything that requires more computer capacity ? for example when a program is started or used. The program achieves this by monitoring all the relevant parameters, including processor load and hard disk access.\nUsers with the necessary rights and permissions can also monitor and control the program via a local network.\n\nAshampoo Magic Defrag Highlights:\n\nDefragments the hard disk automatically and &quot;invisibly&quot; in the background.\nPauses defragmentation automatically as soon as other programs require processor capacity or access the hard disk.\nSwitching to Pause mode only takes around one second.\nNo analysis needed - defragmentation starts immediately! The advanced defragmentation algorithm eliminates the need for a time-consuming analysis phase. This means that the program is genuinely productive whenever it's running, even if it's just for a few seconds.\nInstall It &amp; Forget It: Once the program is installed it runs in the background as a service and keeps the hard disk defragmented automatically.\nStatistic functions for monitoring defragmentation.\nMulti-user support: Once the administrator has installed the program it keeps running, even on restricted user accounts without administrator rights.\nAlso defragments the hard disk when no user is logged in.\nCan be controlled and monitored via a local network.","torrent":{"xt":"urn:btih:382a1a717c26c6ac7dacb487c47506e94c80b87b","amp;dn":"Ashampoo+Magic+Defrag+v1.06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"382a1a717c26c6ac7dacb487c47506e94c80b87b","infoHashBuffer":{"type":"Buffer","data":[56,42,26,113,124,38,198,172,125,172,180,135,196,117,6,233,76,128,184,123]},"announce":[],"urlList":[]}}