{"title":"Lianna (Lesbian drama)","uid":3376235,"size":6413412534,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3b797828e2c9d231c455a93f1e4dfa8b502ae794&amp;dn=Lianna+%28Lesbian+drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fredrika2","files":65,"time":1125275809,"description":"'Lianna' from back in 1983 by veteran director John Sayles is still considered one of the best portraits of a woman finding her womanhood as a lesbian. I find it a bit hard to understand its masterpiece status but perhaps you will do so easily, and as a filmed portrait of a woman it is well above average anyway, regardless of the sexual preferences of women portrayed on screen!\n\nOne private comment I have read states that John Sayles should be awarded an &quot;honorary lesbian&quot; degree because &quot;he sees us&quot;. I wouldn't go that far, not least because honorary lesbian degrees would be an absurd notion, and also there are lots of us he doesn't see, of course. Also, Sayles usually seeks out to be controversial, as he did in this case. My personal view is that it is somewhat wrong to make a film about lesbianism in order to make oneself controversial. But Lianna is undeniably a 'sympathetic, realistic portrait' as it says on the dvd case. Sayles himself does a very good job as an actor in this film, playing a small part as a heterosexual male on the hunt for sex.\n\nSomewhat shocking in those days, probably, today we can set its 'shock value' aside and see it simply as a warm portrait of a warm?hearted woman, which makes it even better.\n\nPicture quality of this low-budget movie is below today's high standards in the sense that film stock has a sort of old colour scheme to it, but images were restored before the dvd release.\n\n\nSpecial feature: Audio commentary by director John Sayles.\n\nDetails:\nUncompressed full quality dvd 9 (NTSC)\nAspect ratio 1.78:1\nSpoken language: English\nOptional subtitles: English, Spanish \nDolby Digital mono\nRunning time 113 minutes\n\n\n","torrent":{"xt":"urn:btih:3b797828e2c9d231c455a93f1e4dfa8b502ae794","amp;dn":"Lianna+%28Lesbian+drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b797828e2c9d231c455a93f1e4dfa8b502ae794","infoHashBuffer":{"type":"Buffer","data":[59,121,120,40,226,201,210,49,196,85,169,63,30,77,250,139,80,42,231,148]},"announce":[],"urlList":[]}}