{"title":"Punk TV SVCD Compilation No1[bandit999]","uid":3396376,"size":836396412,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c7498724bfd90ac8dfde70815b6ce33ccefcb51&amp;dn=Punk+TV+SVCD+Compilation+No1%5Bbandit999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bandit999","files":15,"time":1129300126,"description":"***bandit999-073-8th-October-2005***\n\nOK Here is Punk TV SVCD Compilation No1. The first in what i hope will be another popular series.\n\nThis will be a series featuring the highest quality professional shot promo and live videos, in some cases the audio will be replaced using the audio CD track so as to maintain as high a quality viewing and listening experience as possible.\n\nI have pretty much perfected re-encoding and cleaning up low quality video, and as most bands now only post low quality quicktime/WMV small 10MB-15MB video files of their promo videos i have decided to take these videos and improve them by replacing the audio and re-encoding them so we can all enjoy these videos in the quality we deserve.\n\nI will also be sourcing videos from my extensive collection of SVHS videos and also from Official DVD's. Basically my main aim is to bring you high quality video compilations just like the best CD compilations, except in a visual way comprising of rare and not so rare clips by all kinds of punk bands. I have over 30 3 hour SVHS videos that are made up of nothing but TV clips and promos. These date back too the mid 1980's and have a lot of amazing rare and great videos which i look forward to sharing.\n\nSo here we go with the first one, all Authority Zero videos are from their DVD, all other videos were just MPEG 1 files or streaming files. I hope you can appreciate the time i have put into this and the quality i have been able to achieve.\n\nPlease let me know what you think and if you would like more of these, enjoy!\n\nPunk TV SVCD Compilation No1\n\n01_Authority Zero_A Passage In Time SVCD\n02_Authority Zero_1000 Years Of War SVCD\n03_Authority Zero_Mesa Town SVCD\n04_Authority Zero_Mexican Radio SVCD\n05_Authority Zero_Painted Windows SVCD\n06_Authority Zero_Superbitch SVCD\n07_Authority Zero_Taking On The World SVCD\n08_Authority Zero_Ratlin Bog SVCD\n09_Authority Zero_Siempre Loco SVCD\n10_Misconduct_New Begining SVCD\n11_Suneatshours_September 2001 SVCD\n12_The Deviates_Twice As Nice SVCD\n13_The Unseen_False Hope SVCD\n14_Misconduct_Side By Side SVCD\n\nThis is in PAL SVCD format and should be burned to CD and it will play in most DVD players. This will fit on 1 80min blank cd-r using nero.\n\nIf you want to play these videos on your computer in the proper aspect ratio use a programme called VLC Player it plays everything including most incomplete downloads which is very handy. It also plays bin &amp; cue files. It has no spyware etc and is safe to install. http://www.videolan.org/\n\nEnjoy bandit999\n\nwww.punktorrents.com","torrent":{"xt":"urn:btih:3c7498724bfd90ac8dfde70815b6ce33ccefcb51","amp;dn":"Punk+TV+SVCD+Compilation+No1%5Bbandit999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7498724bfd90ac8dfde70815b6ce33ccefcb51","infoHashBuffer":{"type":"Buffer","data":[60,116,152,114,75,253,144,172,141,253,231,8,21,182,206,51,204,239,203,81]},"announce":[],"urlList":[]}}