{"title":"The_Hitchhiker's_Guide_To_The_Galaxy (xvid110-sickboy88)","uid":3390466,"size":734405322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3da3be62c96f129dd7c60da17d4d3f8c25761cd9&amp;dn=The_Hitchhiker%5C%27s_Guide_To_The_Galaxy+%28xvid110-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sickboy88","files":3,"time":1128133236,"description":"The Hitchhiker's Guide to the Galaxy (2005)\n\nIMDB Link:\n\nhttp://imdb.com/title/tt0371724/\n\n----\n\nOn the road, moving to the other side of the country...rented this out of boredom, ripped it on the laptop, and noticed that there were no proper rips of it.  Enjoy.\n\nExternal English, French, and Spanish subs in VOBsub format.\n\n----\n\nMini Plot:\n\nDon't panic! After twenty years stuck in development (a mere blink compared to how long it takes to find the answer to life, the universe, and everything), The Hitchhiker's Guide to the Galaxy has finally been turned into a movie. Following the radio play, TV series, commemorative towel, and books, this latest installment in the sci-fi-comedy franchise is based on the screenplay and detailed notes by Douglas Adams.\n\nFor those unfamiliar with the story, everyman Arthur Dent (Martin Freeman) wakes up one morning to discover that his house is set to be demolished to make room for a bypass. Little does he know the entire planet Earth is also set to be destroyed for an interplanetary bypass by the Vogons, a hideous and bureaucratic race of aliens realized in the film by Jim Henson's Creature Shop. Whisked off the planet by his best friend, alien-in-disguise Ford Prefect (Mos Def), Dent embarks on a goofy jaunt across the galaxy accompanied by his trusty Hitchhiker's Guide, which looks like a really fancy PDA.\n\nThe guide itself provides some of the funniest bits of the movie, little animated shorts that explain the ludicrous life forms and extraterrestrial phenomena our heroes encounter. Along the way Arthur meets the two-headed party anima","torrent":{"xt":"urn:btih:3da3be62c96f129dd7c60da17d4d3f8c25761cd9","amp;dn":"The_Hitchhiker%5C%27s_Guide_To_The_Galaxy+%28xvid110-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da3be62c96f129dd7c60da17d4d3f8c25761cd9","infoHashBuffer":{"type":"Buffer","data":[61,163,190,98,201,111,18,157,215,198,13,161,125,77,63,140,37,118,28,217]},"announce":[],"urlList":[]}}