{"title":"Dinner At Eight (1933).avi","uid":3420536,"size":2196291584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3dd1c112a116aa6e21035b90116fe43f323acec3&amp;dn=Dinner+At+Eight+%281933%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"goblin1","files":1,"time":1134445470,"description":"When you gather together the great stars of the early 30's, give them a great script, a great director and let them have their head, you get &quot;Dinner at Eight&quot;. This is a delightful film which bridges the gap between comedy and drama. Granted, it is a little dated but that it only a minor inconvenience to those of us who love this movie.\n\nYou would be hard pressed to find another actress who could play the part of Carlotta Vance with such panache as Marie Dressler.......she is magnificent. She may give the best performance in the film but she has stiff competition from the rest of this star-studded cast.\n\nI find John Barrymore's performance particularly good as it seems to mirror his own career and problems with alcohol. Arranging himself in the right light to capture the great profile one last time is poignant. I am not a Wallace Beery fan but he is spot on as the vulgar, grasping business man with wonderful Jean Harlow as his slutty wife. She is a treat and of course, no one can forget her exchange with Dressler at the end of the film when she announces that she was reading a book! The lovely Billie Burke, who made a film career out of dithering society women (although she was a former Follies beauty and wife of Flo Ziegfeld)is a delight. Lionel Barrymore plays it pretty straight as her long suffering, tragically ill husband. Edmund Lowe passes muster as the philandering doctor and the rest of the supporting cast is as good as it gets.\n\nThey don't make 'em like this anymore. It's a movie lovers paradise! \n\nTV rip. Res. 640*480. Video bitrate 2411.\n\n","torrent":{"xt":"urn:btih:3dd1c112a116aa6e21035b90116fe43f323acec3","amp;dn":"Dinner+At+Eight+%281933%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd1c112a116aa6e21035b90116fe43f323acec3","infoHashBuffer":{"type":"Buffer","data":[61,209,193,18,161,22,170,110,33,3,91,144,17,111,228,63,50,58,206,195]},"announce":[],"urlList":[]}}