{"title":"Brendan Benson - The Alternative to Love (2005)","uid":3386613,"size":41516568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ec37710769a8c16a1732efa98d6e56fc783ad34&amp;dn=Brendan+Benson+-+The+Alternative+to+Love+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"raisincain78","files":12,"time":1127423622,"description":"1.\tSpit It Out\t\n2.\tCold Hands (Warm Heart)\t\n3.\tFeel Like Myself\t\n4.\tAlternative To Love\t\n5.\tThe Pledge\t\n6.\tThem &amp; Me\t\n7.\tBiggest Fan\t\n8.\tFlesh &amp; Bone\t\n9.\tGet It Together\t\n10.\tGold Into Straw\t\n11.\tWhat I'm Looking For\t\n12.\tBetween Us\n\nBrendan Benson smokes a lot of cigarettes. He's also had a lot of girlfriends, most of whom have left him. This combination is the nuclear fission of pop songwriting, and the afflicted can (and do) write inexhaustibly about the topics. Benson has been at it for almost a decade, and until now he's shown no sign of shaking his nicotine grievances. But there may be hope for him yet: On the title track to his new album (a song carried over from his 2003 EP Metarie), we learn he's been &quot;forever in search of the alternative to love.&quot;\n\nHas he found it? Nah. Benson's verbalizes his commitment to change, but action precedes essence, mon frere, and while The Alternative to Love is an well-intentioned record, Benson ends up sticking to his water pistols, squirting lovelorn power-pop spooned with la-la vanilla.\n\nI imagine Benson works game the same way his songs ingratiate themselves, which is to say he knows smiling indomitability can be endearing when the hipsters' disinterested shtick grows tiresome. Jaunty and overeager to reach the chorus, &quot;Spit It Out&quot; abides its title. But while it isn't &quot;Tiny Spark&quot; (Lapalco's stellar opener and Benson's Saturn commercial-poached claim to fame), &quot;Spit It Out&quot; has its charms, including a tease of a chorus that pulls back right when you expect it to explode.\n\n&quot;Cold Hands Warm Heart&quot; features The Alternative to Love's most appealing come-on: a twinkling, pendulous bell melody that perfectly captures Benson's brand of shrug-it-off determination. The rest of the track is an exercise in la-di-da filler.\n\nOn &quot;I Feel Like Myself Again&quot;, Benson proves himself a master pop mathematician, slithering around an offset beat to deliver a wontedly chewy vocal hook. He keeps saying something about &quot;just wait till I feel like myself again,&quot; but up to this point Benson has been in top form. The Alternative to Love's opening triumvirate is as strong as any string of songs he's written, and the wistful finality of the sweetly cathartic title track foreshadows a disappointing comedown.\n\nIf Benson had chosen to cut the album here, he would have had a perfect EP. Unfortunately, breakup tales can only go as far as their melodies and arrangements carry them, and The Alternative to Love fails to rise as soaringly above Benson's pablum in its second half. We're not asking for wit and personality, just the saccharine-drunk that helps blur the messy details. &quot;Flesh and Bone&quot; brings a hippocampus-feasting melody but can't match the svelte sophistication of its predecessors. And although Tchad Blake's mixing is a fabulous constant, his consistency means the weaker tracks are revealed for what they are: solid formula-followers lacking the elusive intangible charm that an unexpected note or rhythmic tic can bring.\n\nLatecomers &quot;Get It Together&quot; and &quot;Last Man Standing&quot; stir up a fuzz storm, but closer &quot;Between Us&quot; is more ellipsis than exclamation point, and that's a pretty accurate reflection of the kind of songwriter Benson is. On &quot;Last Man Standing&quot; he sums it up best: &quot;I have friends that are married and their lives are complete, and here I am stumbling down a darkened street.&quot; Benson knows better than anyone that being a beautiful failure beats tidy, predictable success any day.\n\n-Sam Ubl, March 28, 2005","torrent":{"xt":"urn:btih:3ec37710769a8c16a1732efa98d6e56fc783ad34","amp;dn":"Brendan+Benson+-+The+Alternative+to+Love+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec37710769a8c16a1732efa98d6e56fc783ad34","infoHashBuffer":{"type":"Buffer","data":[62,195,119,16,118,154,140,22,161,115,46,250,152,214,229,111,199,131,173,52]},"announce":[],"urlList":[]}}