{"title":"Chasing Amy CRITERION (NTSC)","uid":3400539,"size":8404428272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4053c67f44a72451ad0091120441a31939e8d6b0&amp;dn=Chasing+Amy+CRITERION+%28NTSC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fredrika2","files":88,"time":1130105524,"description":"To me, 'Chasing Amy' is about lesbians not being taken seriously by people in general. In this film, a boy in love with a lesbian, determined to 'win her over', finds it rather cute she has had sex with women prior to having met him. When encountered with the fact that she has also previously experimented with heterosexual activities, he is appalled, and his manly pride is hurt.\n\nThis phenomenon conforms to many men's views on lesbian love: 'It's not for real, it doesn't count'. Let me be perfectly clear on this: Lesbian love is as real as love and sex gets, boys.\n\nThis is the Criterion Collection Director Approved edition of Chasing Amy. Anyone familiar with the Criterion Collection immediately understands this is different to any other edition out there. The quality of the image is somewhere in the range of SuperBit dvds, often touching bitrates 2 Mbps faster or more than a standard edition. By request, I've uploaded it all in one torrent as one full, uncompressed dvd9 rather than splitting it onto two dvd 5 discs. That's 8500 MBs in one iso file. Do yourselves a favour and burn it as a dual layer dvd 9 or split it onto two dvd 5. If you prefer a compressed version, it's a better idea to download an already-compressed version, or an MPEG4.\n\n\nDETAILS:\n\n1\tThe Criterion Collection, volume 75 (NTSC)\n2\tDirector approved widescreen digital transfer to RSDL, supervised by the cinematographer, enhanced for 16:9 screens.\n3\tDiscrete 5.1 Dolby Digital soundtrack (English language spoken)\n4\tOptional English subtitles\n5\tVideo introduction for this dvd edition by the director\n6\tScreen-specific audio commentaries by the director, the producers, the Miramax executive, and actors Ben Affeleck and Jason Mewes\n7\tTen deleted scenes plus outtakes\n8\tA few screwed-up video introductions from cast and crew.\n9\tDVD cover, disc label and two inlay cards .\n10\tTrailer.\n","torrent":{"xt":"urn:btih:4053c67f44a72451ad0091120441a31939e8d6b0","amp;dn":"Chasing+Amy+CRITERION+%28NTSC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4053c67f44a72451ad0091120441a31939e8d6b0","infoHashBuffer":{"type":"Buffer","data":[64,83,198,127,68,167,36,81,173,0,145,18,4,65,163,25,57,232,214,176]},"announce":[],"urlList":[]}}