{"title":"Alpha Centauri - s/t (US/Canadian Hard Rock 1977)(256)","uid":3308287,"size":79334922,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:40d6c5d57c853fd8cd2e6ea3cfd731006ed57f57&amp;dn=Alpha+Centauri+-+s%2Ft+%28US%2FCanadian+Hard+Rock+1977%29%28256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brainticket","files":11,"time":1112073155,"description":"&amp;quot;Alpha Centauri was formed in Greeley, Colorado, in 1971 by Redmon, Thompson, and Smith. Hannum, from Wyoming would join in 1975. \n\nThe band performed its &amp;quot;hard driving&amp;quot; rock throughout American Midwest as headlines but the band did open for artists such as Styx and Uriah Heep, Chuck Berry and Jerry Lee Lewis. \n\nWith a fairly strong US following, the band moved to Canada where they began to write original material. The result was 1977's long awaited eponymous debut on Salt Records \n\nWith the release of the album came more concerts as well as several radio and television appearances including the Canadian TV special Alpha Centauri In Concert&amp;quot; from 1978. \n\nThe band was then aiming for the UK, but management problems and road burnout led to the band returning to the USA. After appearaning on Denver's 'Rock and Roll America', Alpha Centauri tried to duplicate their first album success until 1983 when they finally broke up. \n\nThe members of the band now live near Greeley, Colorado except for Hannum who lives in Oklahoma. They are active in various musical pursuits and have occasionally reunited. \n\nExcept for a brief period when Redmon was working with ex-Guess Who leader Chad Allen, Alpha Centauri remained together for 12 years. \n\nIn the '90's a resurgence of sorts occurred following a Derek Oliver review in &amp;quot;International Encyclopedia of Hard Rock and Heavy Metal&amp;quot;, where he cited Alpha Centauri as &amp;quot;The world's best undiscovered pomp band&amp;quot;. Rock efficianodos began scouring the globe for their only album and in 1996 Pacemaker Records re-issued the disc.&amp;quot;-JMPE\n\nThis style isn't my usual preference, but this is a pretty good album, though, to my ears, it verges on the early stages of the prog/stadium-metal cusp now and then (if you know what I mean...?).\nJust a dusty old 'head' at heart, I guess:)\n\nEnjoy!\nbrainticket\n","torrent":{"xt":"urn:btih:40d6c5d57c853fd8cd2e6ea3cfd731006ed57f57","amp;dn":"Alpha+Centauri+-+s%2Ft+%28US%2FCanadian+Hard+Rock+1977%29%28256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d6c5d57c853fd8cd2e6ea3cfd731006ed57f57","infoHashBuffer":{"type":"Buffer","data":[64,214,197,213,124,133,63,216,205,46,110,163,207,215,49,0,110,213,127,87]},"announce":[],"urlList":[]}}