{"title":"X Operations Online 1.5 (Full)","uid":3403734,"size":4726047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:41c8a40e832d2e43dfeb7ed81f4826f1eadf67d0&amp;dn=X+Operations+Online+1.5+%28Full%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"themetalmulisha","files":1,"time":1130795426,"description":"X operations Online Test - version 1.5 (Translated by Sub7)\n\nMultiplayer version of X operations is divided from the singleplayer version.\nThis is a test version, therefore the program specification is still simple.\nThis version is based on the singleplayer version, but is developed to some degree.\n\nMaximum players per server is 12.\nCurrently there is only &quot;team death match&quot;, where the players are automatically\nassigned to one of the two teams (BLUE / RED)\nA game ends when all the members in a team die or when time gets to the set limit.\n\nA player can freely control his/her view point after he/she dies.\n\nHere is the procedure for playing the game.\nTexts below are written on the assumption that you have the general knowledge of network,\nso refer something by yourself if there is anything you cannot understand.\n\nTo play on client side, input server address and port number in the spaces provided\nand then click START button.\n\nYou can also use the lobby server to get the server list. Click GET SERVER LIST button.\n(On purpose to reduce the load on the lobby server, this feature will then be unavailable for several seconds.)\nIf there is any server operating, its name and maximum number of players are displayed.\nChoose one from the list. Then server address and port number are automatically input.\nThe character F or E on the left side of the number means as follows:\n    F : There are more than or equal to half the limit in this server.\n    E : There are less than half the limit in this server.\nThis information is updated at regular time intervals, therefore there may be difference\nbetween displayed status and actual status.\n\nWhen title logo is displayed, your PC is successfully connected to the server.\nWait for the server to start the next game so you can join in.\n\nIf processing rate shown on the upper-right corner of the window doesn't reach 100%, you will\nbe at a disadvantage. Check FRAME SKIP in the first dialog box before connection.\n\nWhen disconnected, press F11, type &quot;retry&quot; and press return key to try reconnection.\nIf reconnection fails repeatedly, it is highly possible that the server is down.\nOnce quit the program - reopen - and try another server.\n\nYou can also run a server with ease. In the first dialog box, check SERVER and type port number\n(which, of course, must be opened. Set up your routing machine and firewall in order to connect.)\nCheck PUBLIC to put your server information to the lobby server. Uncheck it if you want to play\nwith specific members or if you want on the LAN.\nClick START to run the server.\n\nIn default configuration, automatic game start is at work. When there are more than two clients\nconnecting to the server, one randomized mission automatically starts.\nTo cancel this function, press F11, type &quot;auto&quot; and press return key. (Do the same to reactivate.)\nIn this condition, the server administrator is supposed to choose a mission. \n\nPress Esc to quit the current game, then going back to the mission select.\n\nYou can not join the game with a program running as the server. If you want, run another one\nand then connect to your own server as a client. To connect to the server on the identical\nmachine, type &quot;127.0.0.1&quot; into ADDRESS field.\n\nSERVER SETTING\n    SERVER NAME           : Text typed here is shown on the server list.\n    MAX PLAYERS (2 to 12) : Maximum number of players on this server\n    TIME LIMIT [second]   : Time limit of a game\n\n\n\nFunctions\n    Hold F1         : Show log that you have for up to 10 lines\n    Hold F12        : Show players list and their scores\n                          [K : The number of times you have killed.     ]\n                          [D : The number of times you have been killed.]\n    \n    Press Return    : Then type a message and press Return to show the message to all the players.\n      (for 2 times) : (In other words, execute say without argument) Then type a message and press\n                      Return to show the message to specific players.\n                          [Surviving player : To all the members in your team]\n                          [Dead player      : To all the dead players]\n                          (In both the two cases, server can read all these messages.)\n\nCommand Line Interface\nPress F11 to open command line. Commands prepared are as follows:\n    say &lt;message&gt;   : Show &lt;message&gt; to all the players (depending on dead/alive)\n    tsay &lt;message&gt;  : (Client only) Show &lt;message&gt; to specific players (see above)\n    wish red        : (Client only) Hope for being on RED team in the next game\n    wish blue       : (Client only) Hope for being on BLUE team in the next game\n    retry           : (Client only) Try to reconnect to the current server\n    auto            : (Server only) Toggle the automatic game start\n    kick &lt;name/number&gt;   : (Server only) Kick out the player of &lt;number&gt;\n    ban &lt;name/number&gt;    : (Server only) Kick out and ban the player of &lt;number&gt;\n    unban           : (Server only) Cancel all bans\n    help            : Show all the commands\n    envid &lt;name/number&gt;  : show Player Identity number(s)\n    \n\n    *Player number\n     All the players have numbers according to the player list (Hold F12).\n     0 for the top, and then sequentially numbered to the bottom.\n\nShortcut Features\nYou can use four function keys of F5 to F8 as the shortcut buttons.\nTop four lines in cmd.txt (of course you can edit the content) are assigned to F5, F6, F7 and F8.\nPress each key to execute the set command when command line is not opened.\n(In order not to be used as active jamming, the next shortcut key does not work before\n 3 seconds pass.)\n\nAutokick\nA player that seems to perform fault plays or that interrupts the other player is automatically\nkicked out. It is sometimes applicable to those who edit the game data.\nReasons For Autokick:\n\tSpeed    : This feature removes players using speed cheats.\n\tFill     : This feature removes players who are lagging the server by sending too much information.\n\tMemory   : This feature removes players using memory modification cheats (infinite ammo etc).\n\tTimeout  : This feature removes players that are experiancing connection trouble.\n\tAFK      : This feature removes players that have been inactive for a while.\n\n1.4 to 1.5\nThe revised points are as follows... \n* Communication between client and server has improved reducing lag.\n* Modified communication data quantity delicately so it can flow better, the character strings are in a better order \n* Console does not protrude from the picture, as requested by a lot of people. \n* Server list is now indicated at 3 stages \n* Map identification value addition\n*  The &quot;envid&quot; command has been added to help identify server jerks. Type &quot;envid &lt;player name&gt;&quot; and it will reveal the players number. This number can be noted down to identify players who are banned then change their ip to get access again. The numbers reveal the perpetrator. Autokick also reveals the number.\n* By the way, in the next version we will include new weapons; the FAMAS, the Mk23 and the M1 (Shotgun).\n* A Map editor and mission editor is on the schedule too.\n\n24/09/2005 written by Sub7 &lt;&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ccbfb9aefb8cb8a4a9a1a9b8ada0a1b9a0a5bfa4ade2afa3a1&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;&gt;\nhttp://www.themetalmulisha.com/xops\nCopyright 2005 team MITEI All Rights Reserved.","torrent":{"xt":"urn:btih:41c8a40e832d2e43dfeb7ed81f4826f1eadf67d0","amp;dn":"X+Operations+Online+1.5+%28Full%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c8a40e832d2e43dfeb7ed81f4826f1eadf67d0","infoHashBuffer":{"type":"Buffer","data":[65,200,164,14,131,45,46,67,223,235,126,216,31,72,38,241,234,223,103,208]},"announce":[],"urlList":[]}}