{"title":"A Touch Of Frost - 1x02 - Not With Kindness(1992) avi","uid":3277699,"size":734539776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:42a8ad66c22d8e1d78acf7440449bd023597a590&amp;dn=A+Touch+Of+Frost+-+1x02+-+Not+With+Kindness%281992%29+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edliden","files":1,"time":1105908695,"description":"Frost's sister-in-law, Marion, has come over from the US for his wife's funeral, but her staying at his house leads to friction, and she returns home prematurely. Frost is assigned another assistant, Det Sgt Gilmore. As DCI Allen is still on medical leave, Denton's incoming cases fall to Frost. These are a missing teenage girl, Paula Bartlett, and the case of a woman who has been receiving threatening phone calls and suffering malicious pranks. In addition to the staff shortage, the police station's central heating has broken down. While investigating an unrelated complaint about vandalism in a churchyard, Frost discovers the body of the missing girl, and the ensuing murder hunt focuses on the paper round that she failed to complete on the morning of her disappearance and death. Frost cannot do much to protect Alex Compton, the victim of the threats, and that night the police are called to her house, to find it engulfed in flames, with her husband dead inside and her unconscious on the lawn. The fire officers detect the petrol that shows it to have been arson, and Frost has his own ideas on who started it.","torrent":{"xt":"urn:btih:42a8ad66c22d8e1d78acf7440449bd023597a590","amp;dn":"A+Touch+Of+Frost+-+1x02+-+Not+With+Kindness%281992%29+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a8ad66c22d8e1d78acf7440449bd023597a590","infoHashBuffer":{"type":"Buffer","data":[66,168,173,102,194,45,142,29,120,172,247,68,4,73,189,2,53,151,165,144]},"announce":[],"urlList":[]}}