{"title":"Deep Purple - Heavy  Metal Pioneers - NTSC DVD","uid":3273118,"size":4175333376,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4340ec32489aef70478c44a862c027e4eac5c0c6&amp;dn=Deep+Purple+-+Heavy++Metal+Pioneers+-+NTSC+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Beria00","files":10,"time":1104931752,"description":"Deep Purple Heavy Metal Pioneers\nProcess under DVD decrypter - no more no less\n\nDeep Purple the British group, formed in 1968 and had their first taste of success with a cover of Neil Diamond's 'Kentucky Woman'. Since then, they have never looked back.\n\nWitness the history of the legendary band, Deep Purple with their friends, and their fans in an hour long program of archival performances, in-depth interviews &amp;amp; behind-the-scenes footage.\n\nPersonal and Intense Interviews With:\nRoger Glover\nRitchie Blackmore\nJon Lord\nIan Paice\nJoe Lynn Turner\n\nRare Concert Footage Of Their Greatest Hits:\n* Hush\n* Kentucky Woman\n* Smoke On The Water\n* Black Night\n* Strange Kind Of Woman\n* Woman From Tokyo\n...and Many More!\n\nActors:\t Deep Purple\nAudio:\t                  Linear PCM 2.0 Stereo\nAspect Ratio:\t      1.33:1 Fullscreen\nTransfer Format     4:3\nCategory:\t       Music/Documetary\nYear:\t1991\nLanguages:\tEnglish\nSubtitles:\t    English\nRunning Time:\t57 mins\n\nDVD5, L-PCM Stereo.\n\nCONTENTS\n\n1. Woman from Tokyo Mk IIa Studio version heard during the opening credits.\n2. Hush Mk I Complete live version taken from the US TV show After Dark, 1968.\n3. Mandrake root Mk IIa Only the guitar solo. Live version taken from the Doing their thing... video, recorded 1970.\n4. Speed king Mk IIa Bits of a live version taken from the Doing their thing... video, recorded 1970.\n5. Black night Mk IIa Bits of a live version taken from the Scandinavian Nights video, recorded 1972.\n6. Child in time Mk IIa Bits of a live version taken from the Doing their thing... video, recorded 1970.\n7. Strange kind of woman Mk IIa Bits of a live version taken from the Scandinavian Nights video, recorded 1972.\n8. Smoke on the water Mk III Bits of a live version taken from the Live at the California Jam video, recorded 1974.\n9. Highway star Mk IIa Bits of a live version taken from the Scandinavian Nights video, recorded 1972.\n10. The mule Mk III Bits of Ian's drum solo. Live version taken from the Live at the California Jam video, recorded 1974.\n11. Wring that neck Mk IIa Guitar/organ duell. Live version taken from the Doing their thing... video, recorded 1970.\n12. Burn Mk III Bits of a live version taken from the Live at the California Jam video, recorded 1974.\n13. Space truckin' Mk III Bits of a live version taken from the Live at the California Jam video, recorded 1974.\n14. Stormbringer Mk IV The album version of &amp;quot;Stormbringer&amp;quot; is played over live pictures taken from the Deep Purple Rises over Japan video.\n15. Perfect stranger MK IIb Bits of a live version videoed sometime during the Perfect Strangers tour 1985.\n16. King of dreams Mk V Complete promo video for MTV distribution.\n17. Woman from Tokyo Mk IIa Bits of the studio version heard during the end credits\n\nhttp://www.imdb.com/title/tt0223441/\n\nHoppas det skall falla er i smaken...\nBeria","torrent":{"xt":"urn:btih:4340ec32489aef70478c44a862c027e4eac5c0c6","amp;dn":"Deep+Purple+-+Heavy++Metal+Pioneers+-+NTSC+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4340ec32489aef70478c44a862c027e4eac5c0c6","infoHashBuffer":{"type":"Buffer","data":[67,64,236,50,72,154,239,112,71,140,68,168,98,192,39,228,234,197,192,198]},"announce":[],"urlList":[]}}