{"title":"Fooly Cooly(Foolie Coolie or FLCL) Episodes 1-6 320x240","uid":3392070,"size":299404062,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:446841af5f98e5e7c435b6236d952e1919547751&amp;dn=Fooly+Cooly%28Foolie+Coolie+or+FLCL%29+Episodes+1-6+320x240&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sweeper18","files":8,"time":1128441095,"description":"This is a great show, very outlandish and wacky. There are only 6 episodes ever made spanning 3 discs. It is aired on Cartoon Networks Adult Swim sometimes if they feel like it.\n\nBefore you begin studying this series in any great detail, be warned: weird has got nothing on Fooly Cooly. Honestly, take any conceptions you have about what this anime is about and throw them out. It is that weird.\n\nThe story of Fooly Cooly revolves around a small group of people living together in a slightly off-kilter city. There is 12-year-old Naota, practically alone in the world with an otaku father and a brother currently in the states playing baseball. There is also Mamimi, the 17-year-old girlfriend of his brother, who seems to be paying a lot of attention to Naota himself lately.\n\nThen the weird stuff begins when Haruko drops in, runs him over with a Vespa scooter, kisses him, and bashes him in the head with a bass guitar (oh, and he survived all that), and now strange things are coming out of his head...literally!. And this is just the first episode. Imagine five more episodes where things just get even wilder. And yet, every now and then, there is just the right dose of sanity to make this a short but sweet series.\n\nIn addition to its over-the-top weirdness, FLCL is loaded with self-reference, subtle elements, self-parody, a few degrees of tastelessness, and a story of coming of age in a place where the people who should care about you don't and those who shouldn't do. Oh, did I forget to mention the rock soundtrack that pervades the series' background music?\n\nIncidentally, the term &quot;Furi Kuri&quot; is Tokyo slang, meaning to feel someone up in a provocative way. Also, the bass guitar in the series looks to be a Rickenbacker, called &quot;Ricks&quot; for short.\n\n\n[url]http://www.absoluteanime.com/flcl/[/url]","torrent":{"xt":"urn:btih:446841af5f98e5e7c435b6236d952e1919547751","amp;dn":"Fooly+Cooly%28Foolie+Coolie+or+FLCL%29+Episodes+1-6+320x240","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446841af5f98e5e7c435b6236d952e1919547751","infoHashBuffer":{"type":"Buffer","data":[68,104,65,175,95,152,229,231,196,53,182,35,109,149,46,25,25,84,119,81]},"announce":[],"urlList":[]}}