{"title":"Solo - Solopeople","uid":3458114,"size":69128821,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:45bda67d4d5f3f929b893e7dc4e311593dc3faf1&amp;dn=Solo+-+Solopeople&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tj76v","files":17,"time":1142509926,"description":"Weet u nog? Songs ?n sounds? Dat bejubelde debuut (Volkskrant: ?Tien zeer fraaie popliedjes?, NRC: ?Van een jaloersmakende kwaliteit?) van Solo, ruim een jaar geleden? Met die hitsingle Mind? Die indrukwekkende optredens in het voorprogramma van Spinvis? theatertournee? Die Stil Concerttournee, waarbij het publiek luisterde via een koptelefoon?\n\nNu is er reeds de opvolger, Solopeople. Van diezelfde J Perkin (alias Michiel Flamman, die enkele jaren geleden debuteerde met Exhibit en voor Birgit de hits I Know en Few Like You schreef) en Simon Gitsels (voormalig toetsenist van onder meer diezelfde Birgit en Mathilde Santing), opgenomen met de band waarmee Solo live optreedt.Andermaal welhaast perfecte popliedjes, dat zijn het. Minstens zo mooi als het debuut, maar nog spannender. Enfin, oordeel vooral zelf. De eerste single Come Back to Me, pakkend en vol verlangen, zal weldra op uw radio klinken.\n\nDe titel verwijst naar tenminste drie nummers op de plaat. J Perkin: ?Ik schreef over drie alleengaanders. Mensen die zich op een bepaalde manier bewust teruggetrokken leven. En alleen blijven, danwel alleen bleven. Erik Satie, Morrissey en Jozef van de Berg.? Toch is Solopeople is geen bittere plaat. Simon: ?De wereld is geen koude plek, zelfs al kies je voor afstand. Uit nummers als Opportunities spreekt hoop: Hands up, hand out your love, receive, return, surrender.?","torrent":{"xt":"urn:btih:45bda67d4d5f3f929b893e7dc4e311593dc3faf1","amp;dn":"Solo+-+Solopeople","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45bda67d4d5f3f929b893e7dc4e311593dc3faf1","infoHashBuffer":{"type":"Buffer","data":[69,189,166,125,77,95,63,146,155,137,62,125,196,227,17,89,61,195,250,241]},"announce":[],"urlList":[]}}