{"title":"(Advance) Hurt - Vol. 1 [2006] (192)","uid":3462748,"size":81949682,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46440306bb62fd4db2f66170409a00648c0aadec&amp;dn=%28Advance%29+Hurt+-+Vol.+1+%5B2006%5D+%28192%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Criznittle","files":15,"time":1143446178,"description":"Hurt - Vol. 1\n\n01. (03:50) Hurt - Shallow\n02. (05:40) Hurt - Rapture\n03. (06:37) Hurt - Overdose\n04. (04:41) Hurt - Falls Apart\n05. (03:34) Hurt - Forever\n06. (05:06) Hurt - Losing\n07. (04:07) Hurt - Unkind\n08. (03:53) Hurt - Danse Russe\n09. (05:27) Hurt - Dirty\n10. (04:21) Hurt - Cold Inside\n11. (09:33) Hurt - House Carpenter\n\nPlaying Time.........: 56:54\nTotal Size...........: 78.14 MB\n\n\n&quot;Why is the band called Hurt?&quot; asks front man J. Loren with characteristic intensity. &quot;Have you heard the CD? Does it seem applicable?\n\n&quot;I felt that was definitely the word,&quot; he continues. &quot;It had to be called that.&quot; \n\nIndeed, this young band and its ambitious debut album, certainly live up to the name. The LP veers between whispering and roaring, melody and brutality, crushing power chords and gentle acoustic moments. The convergence of those extremes -- delivered in irregular time signature with orchestration, no less -- define the ?Hurt? sound. Yet just when it seems that it&amp;#039;s all thunder and lightning, eight songs into the album the lighthearted &quot;Danse Russe&quot; comes soaring in like a break in the clouds, its cheerful melody and gentle acoustic guitars displaying a drastically different side of the band. \n\nTraces of Tool, Nirvana, and mid-period Metallica flicker throughout the album, but Hurt have created a remarkably individual sound for a debut. It is mainstream enough to fit in on rock radio, yet unusual and edgy enough to appeal to the fringes -- and those extremes are echoed in the band&amp;#039;s two core members. \n\nThe songs, singing and guitar playing emanate from one J. Loren -- the 24-year-old product of a strict home in rural Virginia, reared on a steady diet of religion, gospel and classical music and home schooling. He studied classical violin, can play virtually any stringed instrument and, as he puts it, &quot;played many a hoedown,&quot; but rock was forbidden. He never even heard rock music properly until, one day in his teens, &quot;I just happened to be at a friend&amp;#039;s house and I heard Pearl Jam&amp;#039;s &amp;#039;Jeremy&amp;#039; on TV. It stopped me in my tracks. Classical was really the only music I had gotten into like that.&quot; He cites Vivaldi as his strongest influence. \n\nThe yin to J.?s yang is drummer Evan Johns, also 24, who was raised in Hollywood in just about the most rock environment possible: His dad is Andy Johns (who engineered or produced Led Zeppelin, the Stones, Joni Mitchell, Rod Stewart, Free, Television, Cinderella, Van Halen and countless others), his uncle is Glyn Johns (ditto the Who, Stones, Kinks, Eagles, Clapton, Faces -- do we need to go on?) and his cousin is Ethan Johns (ditto Emmylou Harris, Ryan Adams, Kings of Leon and Rufus Wainwright). \n\nWhile that background evokes visions of young Evan doing homework in the middle of scenes from &quot;Almost Famous,&quot; the reality was about half that. &quot;A lot of my elementary years were spent hanging out with Cinderella or Van Halen -- we&amp;#039;d have them over for dinner or the holidays,&quot; he recalls. &quot;And I was always hanging around the studio. The drums looked like the coolest thing, and I bugged my dad like crazy and finally, when I was about five, he bought me and my brother kid-size drums kits.&quot; \n\nNot that his early efforts were encouraged. &quot;When I first started out, my dad told me I was no good and I should just give up. But after awhile he was like, &amp;#039;Hey, you&amp;#039;re not so bad, keep it up.&amp;#039; It just made me try harder -- every day after school for four hours.&quot; \n\nHe started gigging before he was even in his teens. &quot;I&amp;#039;d be in bands with 30- and 40-year-olds, waiting outside until it was time to play because I was underage. Then I&amp;#039;d go home with mom because it was a school night.&quot; He focused on jazz drumming during high school to expand his vocabulary, but plunged back into rock after graduation, playing in a series of &quot;mostly heavy&quot; bands until one day...\n\n&quot;This friend of my dad?s had a CD of some of J.?s songs. He was like, &amp;#039;Andy, this is great just don&amp;#039;t pay attention to the drums, just listen to the singer.&amp;#039; And my dad said, &amp;#039;If you need a drummer you should check out my son.&amp;#039;&quot;\n\nJ., all the while, had been gigging with a succession of different musicians, always under the name Hurt and was growing frustrated. &quot;I&amp;#039;d almost given up on playing music,&quot; he recalls. &quot;I was working for technology companies as a contract consultant, I was engaged and I was very, very sorrowful about abandoning music. Then, I decided to give it one more go...\n\nA few months later in L.A., Evan?s dad?s friend heeded his advice and arranged for J. Loren to be on a plane to L.A. to meet and try some recording together. &quot;I went into the studio with J. and right away, I was like, I&amp;#039;ve gotta get in on this,&quot; Evan remembers. &quot;We started on a trial basis in August 2004, like, &amp;#039;Okay, we&amp;#039;re gonna record these demos and see what happens&amp;#039; -- and I loved it.&quot; \n\nOf course, it wasn&amp;#039;t really that simple. &quot;The first time I met J. it was really weird because we had only talked on the phone, and we were trying to feel each other out from thousands of miles away. And when he came out here, my first impression was, who is this guy? I can&amp;#039;t understand him; he&amp;#039;s so weird and obscure. But when we started playing together, it was like, &amp;#039;Okay, cool -- I know what to do here, I feel comfortable.&amp;#039; And then he turned out to have a heart of gold.&quot; J. and Evan worked up an abundance of material for a few months before plunging into the studio to begin work on two albums the first of which is &quot;Vol. I?. They were assisted initially by ex-Beck bassist, Justin Meldal Johnson. (Two New Jersey-born musicians, guitarist Paul Spatola and bassist Josh Ansley have since joined them.) \n\nGetting J. to discuss the emotions and inspiration behind the songs is no easy feat. One passage from &quot;Rapture&quot; reads, &quot;She swore she heard the voice of Jesus / Telling her &amp;#039;It was wrong to keep it&amp;#039; / And one more thing, it looked like me&quot;; one from &quot;Falls Apart&quot; goes &quot;Our skin tears away as our memories fade with age / And we don&amp;#039;t even know till it&amp;#039;s gone ... Woe is me.&quot; \n\n&quot;I try to convey principles rather than trying to preach my own story, so that people can apply them to their own lives,&quot; he says. He allows that &quot;Rapture&quot; is about the &quot;danger in setting yourself up as god,&quot; that &quot;Danse Russe&quot; was inspired by poet William Carlos Williams and &quot;a two-day experience with a lovely person,&quot; and that &quot;Losing&quot; was written &quot;after I saw Evan&amp;#039;s ability on the drums. I was like [chuckles sinisterly], &amp;#039;Hey buddy, I got somethin&amp;#039; for you!&amp;#039;&quot;\n\nAnd as for the intensity that runs through every thing his band does, J.Loren simply says, &quot;If I&amp;#039;m not going to affect someone in some way, why do anything at all?&quot;","torrent":{"xt":"urn:btih:46440306bb62fd4db2f66170409a00648c0aadec","amp;dn":"%28Advance%29+Hurt+-+Vol.+1+%5B2006%5D+%28192%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46440306bb62fd4db2f66170409a00648c0aadec","infoHashBuffer":{"type":"Buffer","data":[70,68,3,6,187,98,253,77,178,246,97,112,64,154,0,100,140,10,173,236]},"announce":[],"urlList":[]}}