{"title":"SHADOW.VAULT-PHXiSO","uid":3270614,"size":817577759,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:46a77ae37194861d5c953195634a9436c5e2becd&amp;dn=SHADOW.VAULT-PHXiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BeMyGuest","files":57,"time":1104436677,"description":"RELEASE SIZE: 1CD 55@15 \nRELEASE DATE: 12-30-2004 \nPROTECTION  : - \nMETHOD  : BIN/CUE+RAR \nGENRE : Strategy \nDEVELOPER : Mayhem Studios \nRATING  : 9/10 \n\nRELEASE NOTES \n\nShadow Vault \n\n  The sky is blackened by dark clouds and planet Earth is \nnearing its sad end. Human, a creature so inventive, has \nalready tried all the possibilities to avoid his doom. \nUnsuccessfully. Only one way still remains - a time tunnel \nleading back to the year 1958. Contingent, the new world's \ngovernment, didn't hesitate and jumps into the tunnel with \na great army to fight against their own ancestors. Gain the \nplanet at any cost. The primacy of the contingent's modern \nunits is extensive but the situation changes rapidly and \nthe red sun rises above the planet. Nuclear war is in the \nair, a war that no-one expected. There is no way back and \nboth sides are forced to continue fighting. \n\n  Shadow Vault is a Strategy RPG set during a violent time in \nEarth's alternate history. Battle the forces of the Contingent \ngovernment through 20 different levels featuring over 30 unique \ncharacters and units or go against human opponents in 10 \nmultiplayer levels over LAN or internet. Designed for both \ncasual and hard-core strategy players, the games provides \ncountless hours of strategic gameplay without the need of \nstudying a huge manual, but still delivering lots of action \nand strategic possibilities. \n\n\n\n  Features of Shadow Vault: \n\nStylish nuclear war ravaged environment, where buildings and \nstructures can be destroyed or used for cover \n\nUnique unit classes, each with its own special sets of abilities, \nsuch as medics, engineers, snipers'. \n\nUnits improve abilities and acquire new ones as they gain combat \nexperience \n\nOver 30 unique abilities and 40 different actions to enhance and \nupdate your units \n\nHours of strategic gameplay through 20 game levels \n\n30 units and characters to choose from or battle against \n\nEpic story and dynamic storyline that immerses the player into \nthe game \n\nHigh level Artificial Intelligence that reacts to as player's \nstrategy \n\nIntuitive game rules and interface placing emphasis on the \nstrategical experience rather than a steep learning curve \n","torrent":{"xt":"urn:btih:46a77ae37194861d5c953195634a9436c5e2becd","amp;dn":"SHADOW.VAULT-PHXiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a77ae37194861d5c953195634a9436c5e2becd","infoHashBuffer":{"type":"Buffer","data":[70,167,122,227,113,148,134,29,92,149,49,149,99,74,148,54,197,226,190,205]},"announce":[],"urlList":[]}}