{"title":"Steam Down Pack (B3y0nd Full)","uid":3403446,"size":11871936,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:470ab361321b0147537fd5dc502e2ca2e352eacd&amp;dn=Steam+Down+Pack+%28B3y0nd+Full%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"themetalmulisha","files":1,"time":1130716390,"description":"In Honor Of H3llBoSS \n\nH3llBoSS's Steam-Down &amp; Non Steam-Down :: All Steam Games For Free And Online \n\n------------------------------- \nContents: \nA: Steam-Down Pack 10 Full - H3llBoSS\nB: Non Steam-Down Pro\nC: FAQ \n------------------------------- \n\nA:\n-------------------- \nSteam-Down Pack 10 [NEW] and Steam-Down Pack 7 \n-------------------- \n\nSteam-Down Is The Best Way To Get Your Steam Games....Free And Forever \n\nSTEAM-DOWN P10 - H3llBoSS \n\nFeatures: \n\n- Fixes Steam Update Error \n- New launcher that makes it possible to auto-launch steam when you are offline \n- VAC2 Compatible \n- New Steam 3 Skin \n- No more launcher \n- No need for ppatcher and New fixed Steam.dll \n- No Steamengine window \n- No need for regular steam \n- Get all games in the &quot;My Games&quot; list with any account \n- Download all steam games for free \n- Play through the &quot;My Games&quot; list without any problems \n- Play third party games without any problems \n\n* Ticket Expiration Bypass Method: Not Available/Not Included \n* You May Delete &quot;Steam.exe&quot; Since Its Not Needed \n* No need to change the steam.cfg. You are offline steamdown will recognize it but if you want to enforce offline mode just put a &quot;#&quot; before &quot;BootStrapperInhibitAll=enable&quot; \n* If you get any trouble with the steamdown.exe just run steam.exe \n\nInstallation: \n\n- Run the installer and install it to any folder of your choice. \n- Always start Steam-Down with the Steam-Down EXE and not with the Steam EXE \n- Put your New or Current steam account and password in the login and login. \n- If you allready have downloaded GCF's, put them in the C:Program FilesSteam-DownSteamApps folder before you start Steam-Down so it detects them. \n- The first time you start Steam-Down, it will download platform files promptly from Steam. \n- Your antivirus or firewall programs may not recognize the running programs, so always give access to them. \n\nOn some antivirus scan, SD releases packages can reveal &quot;Type_Win32&quot;, &quot;Trojan_Type&quot; virus etc. Don't be stupid, it's not a virus or anything else like that. Just some packers/cryptors which have same binary signature. \n\nThings To Know Before Using: \n\n-Do Not use your real Steam account with Steam-Down unless you want to take the risk of it being banned. Make a new account and use that one. \n-When you use Steam-Down, you can only play online when: \n\n1)You use your real account but take a risk of it being banned. \n2)You use your new account and play in a fixed server. \n3)You find a way to fix the Invalid Ticket problem. \n\nSteam-Down gives you complete 100% access to the games. You can play the Single Player portion, through LAN or through fixed servers without a problem. Basically, you can play anywhere except in the Valid online servers. The Invalid Ticket Fix is being worked on, so be patient. \n\n\nB:\n-------------------- \nNon Steam-Down \n-------------------- \n\nNon Steam-Down Pro \n\nAll Games Work Online In Non Steam Servers \n\nNon Steam-Down Pro Features: \n\n- Ability to download and update games (need Steam-Down) \n- Added third party games auto-detection \n- GCF Aato-detection \n- Automatic fixed server updated in favorites \n- Launch options enabled for games \n- Added dedicated server tools for both Source and HL1 \n- Automatic fixed server list update \n- News Feed section \n- Fixed Server Browser \n- Master Server Patch \n- X-fire Compatible \n- Adds Fixed Servers Automatically \n\nInstallation: \n\n1 - Close your steam client. \n2 - Install to your steam folder (steam-down ,six, steam, etc) \n3 - Run Non Steam-Down EXE \n4 - The first time you play a game, it will take some time to install some GCF files. \n5 - Install third party games to SteamAppsuserHL1root or SteamAppsuserHL2root, depending on the mod of-course.\n\n\nIf you get wierd errors when you run the program, Download Visual basic runtime SP6 Code: \n\n\nC:\n-------------------- \nFAQ \n-------------------- \n\nSteam-Down: \n\nCan I use my real Steam account when using Steam-Down? \n-Do Not use your real Steam account with Steam-Down unless you want to take the risk of it being banned. Make a new account and use that one. \n\nCan I play online with Steam-Down? \nWhen you use Steam-Down, you can only play online when: \n\n1)You use your real account but take a risk of it being banned. \n2)You use your new account and play in a fixed server (download Non Steam-Down for this). \n3)You find a way to fix the Invalid Ticket problem. \n\nSteam-Down gives you complete 100% access to the games. You can play the Single Player portion, through LAN or through fixed servers without a problem. Basically, you can play anywhere except in the Valid online servers. The Invalid Ticket Fix is being worked on, so be patient. \n\nWhat do I do when I get the error message &quot;Invalid User ID Ticket?&quot; \n-You can't do anything for this because there is no fix for it. If you want to play in a fixed server, download Non Steam-Down. \n\nI used the Steam-Down to have the CS:Source GCF files, but it downloaded only 1GB of it. How can I have the whole GCF file? \n-You must be patient. Go to the monitor screen and wait till the download is 100% complete. \n\nWhen I start CSS, I get 3 errors in the console: \n\n--- Missing Vgui material vgui/steam/games/icon_cs \n--- Missing Vgui material vgui/steam/games/icon_hl2mp \n--- Missing Vgui material vgui/steam/games/icon_dod \n\nAnd when I try to run the game without Steam-Down, it says gameinfo.txt doesn't exist in HL2. \n-The best and easy solution is to delete all the GCF's of the games who are giving you problems and download them again with Steam-Down. The other solution, but complicated: Install GCFscape &amp; Microsoft Framework 1.1 on your computer. Search for the GCF's who have the files that are missing and delete only that GCF and Download it again with Steam-Down. \n\nThere are certain times when I start Steam-Down and the console runs up but it crashes suddenly with error 108. How do you fix this? \n-This error is just saying that the SteamEngine.exe is already running. Go to your task manager, under the processes tab, and close the SteamEngine.exe. Then restart Steam-Down and it should work fine. \n\nNon Steam-Down: \n\nCan you use this installer without having your GCF files put in Non Steam-Down folder? \n-You can use it as long as you have the GCF files. It doesnt matter where,as long as you install the program to where you have them. \n\nWhen I press the PLAY button in the Non-Steam Down menu, I can't see any games there. What am I doing wrong? \n-Your GCF files are probably misplaced. You need them in your Non Steam-Down/steamapps folder. They can't be the shortcuts either. \n\nCould you please explain the NSD folder? I don't have one of those in my SteamApps directory? \n-It means Non Steam-Down. Inside there should be a SteamApps folder with your GCF's. \n\nCould you explain what kind of people can join a fixed server? Legit, Fixed, or Emulators? \n-Everyone can join. \n\nWill my cracked server be visible to legit user's Steam server browser? \n-Yes. \n\nI don't understand this step for creating a fixed server. \n\n&quot;6. Chose LAN and put SV_LAN 1 , and start the server&quot; \n\nI can choose LAN, but where can i find SV_LAN 1? Where can I change this? \n-Just type it into the console by pressing &quot;~&quot;. \n\nI keep getting this error when I try to join a server: \n\n&quot;Server is using different class tables&quot; \n\nHow do you fix this? \n-You should delete your user directory and it will work again. \n\nHow do you get Non-Steam Down to work with downloaded maps? \n-Extract any downloaded map(s) to the &quot;Steam-DownSteamAppsuserhl2roothl2mpmaps&quot; directory.\n\n\nTorrent Brought To You By\n[www.themetalmulisha.com]","torrent":{"xt":"urn:btih:470ab361321b0147537fd5dc502e2ca2e352eacd","amp;dn":"Steam+Down+Pack+%28B3y0nd+Full%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"470ab361321b0147537fd5dc502e2ca2e352eacd","infoHashBuffer":{"type":"Buffer","data":[71,10,179,97,50,27,1,71,83,127,213,220,80,46,44,162,227,82,234,205]},"announce":[],"urlList":[]}}