{"title":"Asp Studio 2005","uid":3460153,"size":3363076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4aa3a4da62b3064be34eefe570faa7ddd871a2ff&amp;dn=Asp+Studio+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jurgeng","files":1,"time":1142881073,"description":"Asp Studio 2005 is a powerful asp project development tool which integrated with ASP code editing and debugging. With no other asp server, you can edit and debug an ASP project with the help of ASP server integrated capable of debugging , after you create an ASP project simply.  &lt;P&gt;\nAdvantages of the software: \n1. Integrated with ASP server: This software is Integrated with an ASP server which has capable of debugging. With no IIS ,you can run and debug the ASP project after creation .(In fact ,your operation system is completely independent of any ASP server .Even in the environments of Windows 98 ,our asp server integrated will also operate normally.) \n2. Edit with code cue function: The edit interface of the software is a editor of source level ,it specially optimizes the ASP programs , which make it competent to list the member functions and their grammar cues of ASP object integrated ,COM object and object user-defined . \n3. Support breakpoints and step to debug: You can start up your ASP project with breakpoints , step and so on . When the server is executing on the breakpoint(or you&amp;#039;re stepping , there are many ways for you to watch the variable values of the current server port .We specially optimize the ASP object integrated , which enables it to show more detailed information on the interface. \n4. Applicable to watch object  user-definded:Even if your variable is a COM object (for example ,the connection of database ,visit to files in the disc) or other object user-defined ,our software can also precisely show the value and state of the breakpoint. \n5. Convenient outer editor interface: The software itself doesn&amp;#039;t support WYSWYG static HTML editing function ,but you&amp;#039;re free to choose HTML editing software preferred , DreamWeave for example , to edit static HTML code. Interactive editing is applicable for the software. \n6. Multi-Codepage editing: The software is able to automatically process all kink of Codepage.","torrent":{"xt":"urn:btih:4aa3a4da62b3064be34eefe570faa7ddd871a2ff","amp;dn":"Asp+Studio+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa3a4da62b3064be34eefe570faa7ddd871a2ff","infoHashBuffer":{"type":"Buffer","data":[74,163,164,218,98,179,6,75,227,78,239,229,112,250,167,221,216,113,162,255]},"announce":[],"urlList":[]}}