{"title":"Aquaria - Luxaeterna (2005)by Astharoth","uid":3377859,"size":124274319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c225919b76914d6698576f05079d55c54fab6c5&amp;dn=Aquaria+-+Luxaeterna+%282005%29by+Astharoth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Astharoth","files":13,"time":1125629665,"description":"The new time arises. And with it comes the energy which flows from its winds, rivers and seas, its people and their hopes, the fountains of pure crystal water urging from the land, ready for a new cycle. This is AQUARIA !\n\nAQUARIA is a gathering of people that perceive the same purpose: to set everyone in a journey of renewal and hope, with the strength and beauty of its songs.\nAQUARIA starts with members that came from a band called UIRAPURU, considered by the specialized media of Brazil and abroad as the &quot;rising stars&quot; of Brazilian power metal. Soon, the group managed to have a good appearance in the media, with interviews and reviews, with only one Demo CD, considered by many as its first album.\nIn Japan, the band gains a cult status, with spontaneous reviews and requests for the recording of the first album, also with proposals from Japanese record labels, but, surprisingly, nothing that really motivated them. It was necessary to take another step further, to change the route, not the main goal. And with a mystical happening, comes the name AQUARIA, with numerous meanings surrounding it. A wide name, full of sonority.\n\nBeside AQUARIA'S saga, a history that also has cycles: the LUXAETERNA saga. This one tells the story abut the genesis of the world. A &quot;Rock Opera&quot;, where each song is an episode of a cosmic myth. The Higher Beings, by the leadership of Uranus, create all the things, and with them, GAIA, supreme goddess and the Earth itself, whom responsibility is the creation of the living creatures. In this ambition, She creates Mankind, provided from free expression. This issue creates doubts among the Higher Ones, not giving them the blessing, because of the possibility of them to be sub judged.In consequence, creatures of bad intentions, observing the doubt of the Gods, start to spread the hate among the people. GAIA was responsible for this and banished from the astral plane, becoming a human. A great battle is started, with a great end for Gaia, who became the Queen of the Earth. \nGreetings Astharoth.","torrent":{"xt":"urn:btih:4c225919b76914d6698576f05079d55c54fab6c5","amp;dn":"Aquaria+-+Luxaeterna+%282005%29by+Astharoth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c225919b76914d6698576f05079d55c54fab6c5","infoHashBuffer":{"type":"Buffer","data":[76,34,89,25,183,105,20,214,105,133,118,240,80,121,213,92,84,250,182,197]},"announce":[],"urlList":[]}}