{"title":"Simpsons Jeopardy!","uid":3415327,"size":6533222,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4c5b1d8964d5302bc5f1224551d8eb756d1a2b7e&amp;dn=Simpsons+Jeopardy%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HangoverMS","files":1,"time":1133290217,"description":"This is a homebrew game I have been working on for a couple of months now and is finally ready for release.\n\nThis game is based on the Simpsons Jeopardy! board game. The only problem with the board game is that it was difficult to play alone. That problem is a thing of the past. Here are some of the features of this game...  \n\n&amp;middot; 1 to 3 human players - the balance made up of computer players.  \n&amp;middot; 20 playable characters from the show. Additional characters can be added via Character Packs  \n&amp;middot; Modeled after the popular &quot;Jeopardy!&quot; game show with regular, Double, and Final Jeopardy!  \n&amp;middot; 200 categories with 5 questions each plus 50 Final Jeopardy questions = over 1000 questions! Easily customizable to add, remove, replace and alter question sets.\n&amp;middot; 5 levels of difficulty for computer players.  \n&amp;middot; High score board.  \n\nThere is no crack or keygen needed. It is a free game and always will be. Also, character packs and question sets will be free as well. I am just a hugh Simpsons fan with a lot of spare time. \n\nI am still setting up my web page, but the address will be http://simpsonsjeopardy.bizhat.com/ when I finally get it set up and running.\n\nEnjoy the game! And feel free to comment here or on the message board: http://simpsonsjeopard.phpbbweb.com/","torrent":{"xt":"urn:btih:4c5b1d8964d5302bc5f1224551d8eb756d1a2b7e","amp;dn":"Simpsons+Jeopardy%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5b1d8964d5302bc5f1224551d8eb756d1a2b7e","infoHashBuffer":{"type":"Buffer","data":[76,91,29,137,100,213,48,43,197,241,34,69,81,216,235,117,109,26,43,126]},"announce":[],"urlList":[]}}