{"title":"Selected Favourites Of Mine (Legal To Download!!!!!!)","uid":3493949,"size":94941753,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4cfd4088cac68227c5225edbcbb99997fc396ebf&amp;dn=Selected+Favourites+Of+Mine+%28Legal+To+Download%21%21%21%21%21%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Clockmender","files":10,"time":1149872507,"description":"A LEGAL TORRENT FOR A CHANGE\n\nThis is a broad based selection of the music I have been working on on the PC. Every track has been played on a TMK88 Midi Keyboard or an Electric Bass Guitar (made by me), through an E-MU 0404 Sound Card into various music software packages, e.g. Sonar, Cubase, etc. I have used some of my favourite instruments including a Grand Piano and a peach of a Scream Lead Guitar (modified from the standard by me).\n\nRecognition should go to the original Artists/Composers (where known) and to &quot;Erik&quot; (this may or may not be his real name!) who helped with the Techo track. I don&amp;#039;t think I owe any copyright fees to any of these people because they are:\n\nA)   Long Dead.\nB)   Too rich already.\nC)   Unlikely to see this stuff.\n\nor the music track is:\n\nA)   Not quite the same as the original.\nB)   An utterly crap rendition of their masterpieces in their opinion.\n\nPhew - that should keep the Thought Police off my case.\n\nThe Track List is:\n\nComfortably Numb      (Pink Floyd)    - Just a classic\nErik Techno           (Anoymous/?)    - Thanks to Erik)\nFur Elise             (Beethoven)     - Nice easy one to learn (ha ha)\nMaple Leaf Rag        (Scott Joplin)  - What he is best known for\nNo Regrets            (Scott Walker)  - Features Scream Lead Guitar!\nSee The Light         (Clockmender)   - You will probably not like this!\nTake My Breath Away   (Berlin)        - I like the Bam Bam Synth on this\nThe Entertainer       (Scott Joplin)  - This made him famous\nTubular Bells         (Mike Oldfield) - This is the &quot;Introduced Instruments&quot; bit\nWhiter Shade Of Pale  (Procul Harem)  - Another classic\n\n\nNotes:\n\n\n1)   Caveat Emptor!\n\n2)   Don&amp;#039;t be too frightened to download these as there are no vocals. This is\n     because I cannot sing and I can&amp;#039;t find anyone locally who can!\n\n3)   They are not in any particular order (other than Aplhabetic) so you can\n     arrange them how you like.\n\n4)   If you like the music - drop me an email at TPB and I may be encouraged to do \n     some more, oh and tell your mates!.\n\n5)   If you don&amp;#039;t like it - well I&amp;#039;m sorry to have wasted your bandwidth and you\n     can always delete it immediately. You may NOT however, send me insulting mail \n     because you don&amp;#039;t like it!\n\n6)   Have fun with these - If you would like the Midi Files to play with yourself -\n     again mail me at TPB with an email address and I will gladly send them to you.\n\n\n\nKeep up the good work and lets all make the pirate bay a better, safer and tiny bit more legal place to be (snigger snigger).\n\n\nCheers shipmates!\n\n\nClockmender\n\n\nPS I think I own the copyright to these tracks and I hereby give permission to any TPB user to download, copy, play, modify or otherwise use these files. (this is a little joke at guess who&amp;#039;s expense)\n\nPPS Why don&amp;#039;t some more users publish some legal material - I&amp;#039;m sure it will enhance the good standing of The Pirate Bay within the Legal Authorities/copyright owners ,etc. etc.","torrent":{"xt":"urn:btih:4cfd4088cac68227c5225edbcbb99997fc396ebf","amp;dn":"Selected+Favourites+Of+Mine+%28Legal+To+Download%21%21%21%21%21%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cfd4088cac68227c5225edbcbb99997fc396ebf","infoHashBuffer":{"type":"Buffer","data":[76,253,64,136,202,198,130,39,197,34,94,219,203,185,153,151,252,57,110,191]},"announce":[],"urlList":[]}}