{"title":"Karthago - s/t (Great Heavy Prog Rock, Germany 1971)(256)","uid":3309323,"size":68263829,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d57e41aad5f1d880ce6b9c7c842ece2b1198030&amp;dn=Karthago+-+s%2Ft+%28Great+Heavy+Prog+Rock%2C+Germany+1971%29%28256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brainticket","files":13,"time":1112233444,"description":"&amp;quot;Karthago were founded in Berlin by Joey Albrecht (originally from Hannover) and Gerald Luciano Hartwig. Since 1968 they had performed together in clubs as the duo Blues Machine. In 1970 they engaged the Bolivian percussionist Thomas Goldschmitt (mainly hand percussion) and soon landed a recording contract with BASF. Just a month before the recordings of their first album began, two additional members were added to their line-up: Ingo Bischof and Wolfgang Brock. Karthago was recorded in October 1971 at Audio Tonstudio, Berlin with Dieter Zimmermann producing and Stan Regal engineering. It was released in a spectacular, inventive and expensive six part fold-out cover with several die cuts! Certainly a lavish package, recalling the multicoloured and psychedelic Santana album designs - but actually outdoing them! Karthago's sound was graced with excellent heavy guitar work and the funky, gutsy vocals of J. Albrecht, recalling the Jimi Hendrix Experience and the heavy progressive funk band Funkadelic. The best tracks in this style were &amp;quot;Why Don't You Stop Buggin' Me&amp;quot; and &amp;quot;String Rambler&amp;quot;. Others, like the catchy little instrumental &amp;quot;Nos Vamos&amp;quot;, had a more distinct Latin character, very much like early Santana. In my opinion, this is a very underrated album! Few other German bands recorded music in this particular style. &amp;quot;-CDAP\n\nA very different sound for a German band. This is essentially heavy blues rock with prog touches and a real Latino/Santanaesque sound. This sound is most effective on the last track Nos Vamos and is due mostly to Goldschmitt's hand-percussion.\nVocals are in accented English. A very good band which adds another dimension to the Krautrock scene.\nKeyboardist Ingo Bischof would later become a member of Kraan(75) and Ringo Funk of Jeronimo/Atlantis would join Karthago as drummer for their last series of concerts and live album in 1976.\nEnjoy!\nbrainticket\n","torrent":{"xt":"urn:btih:4d57e41aad5f1d880ce6b9c7c842ece2b1198030","amp;dn":"Karthago+-+s%2Ft+%28Great+Heavy+Prog+Rock%2C+Germany+1971%29%28256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d57e41aad5f1d880ce6b9c7c842ece2b1198030","infoHashBuffer":{"type":"Buffer","data":[77,87,228,26,173,95,29,136,12,230,185,199,200,66,236,226,177,25,128,48]},"announce":[],"urlList":[]}}