{"title":"Xbox - RLT - Ultimate Medal Of Honor Pack","uid":3428262,"size":6526964465,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:4f2e3348c3cbc0f9152677b8ccfdd073ddea0d67&amp;dn=Xbox+-+RLT+-+Ultimate+Medal+Of+Honor+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shady78","files":12,"time":1136529343,"description":"ALL Games\nNTSC\n\nive been asked to upload  all these games so i decided to do it in one pack\n\n\nthis is all medal of honor games for xbox\n\n\n\n\nMedal Of Honor Rising Sun\n\nLink &lt;a href=&quot;\nhttp://xbox.gamespy.com/xbox/medal-of-honor-rising-sun/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xbox.gamespy.com/xbox/medal-of-honor-rising-sun/&lt;/a&gt;\n\n\nMedal of Honor: Rising Sun (Xbox) \n\n\nThe acclaimed Medal of Honor series expands with a new story that takes place in World War II, from 1941 to 1945. Rising Sun for Xbox, PS2, and GameCube, stars Marine Corporal Joseph Griffin on a mission to stop Japanese forces from taking control of the Pacific Theatre. Major battles including the infamous Pearl Harbor attack have been recreated with intense realism. Ten heroic levels are spread across five major historic WWII missions. Open level environments allow for multiple paths to victory, where players can fight alone or with a squad. Up to four players can fight head-to-head in ten multiplayer modes, and the all-new Co-op mode allows two players to fight along side one another. \n\n\nGame Info\n\nDeveloper EA Los Angeles  \nPublisher Electronic Arts  \nGenre Shooter \nRelease Date November 11, 2003  \nESRB Teen  \nGameSpy Score  (Read Review)  \n\n\n\nMedal Of Honor Frontline\n\nLink &lt;a href=&quot;\nhttp://www.xbox.com/en-US/games/m/mohfrontline/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xbox.com/en-US/games/m/mohfrontline/&lt;/a&gt;\n\n\nFeatures\nIn Medal of Honor: Frontline, you'll go behind enemy lines as Lt. Jimmy Patterson to take part in a series of challenging missions that are vital to Allied victory over the Third Reich.\n\nYour duties range from storming Omaha Beach as a member of the heroic D-Day assault to stealing the HO-IX flying wing, an experimental Nazi jet fighter so powerful it could turn the tide of World War II.\n\nAlong the way, battle for control of Nijmegen Bridge (a strategic choke point in the Allied drive into the heart of Nazi Germany), track your Nazi nemesis aboard and atop a speeding armored train, and fight valiantly for freedom over fascism.\n\nThe Medal of Honor team continues to deliver the most authentic WW2 experience on any gaming platform.\n\nEmbark on 20 levels of gameplay: Spread across 6 major missions, all based on real World War II events and all adding up to one complete and uninterrupted storyline.\nEnjoy a wide variety of characters: Including German, British, and American troops, as well as Dutch civilians.\nWeild 20 authentic WWII weapons: Including the Colt .45, Springfield Sniper Rifle, Panzerschreck rocket launcher, MG42 mounted machine gun, and fan favorite, theBrowning Automatic Rifle.\nEncounter an array of enemy vehicles: Including Panzer and Tiger tanks, trucks, motorcycles with sidecars, and armored railway scout cars.\nExperience a variety of vehicles: Including a player-driven, motorized rail car, a train, and amine cart.\nEnjoy an astonishing A.I.: For both the enemy andAllies.\nEncounter intense, non-combat-based scenarios: Such as a disguised, weaponless infiltration of an officer's pub, brimming with Gestapo to make contact with a Dutch Resistance operative.\nListen to more than 70 minutes of original orchestral music: By acclaimed Medal of Honor composer Michael Giacchino.\n\nDeveloper: Electronic Arts\nPublisher: Electronic Arts\nGenre: Action\nRelease Date: 11/1/2002\nConsole: Xbox\nPlatinum Hit\n$49.99\nGame Rating: T (Teen)\nViolence\n\nPlayers 1-4\n\n\n\nMedal Of Honor European Assault\n\nLink &lt;a href=&quot;\nhttp://www.xbox.com/en-US/games/m/medalofhonoreuropeanassault/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xbox.com/en-US/games/m/medalofhonoreuropeanassault/&lt;/a&gt;\n\n\nFeatures\nMedal of Honor European Assault? is the latest video game from Electronic Arts' acclaimed Medal of Honor franchise, credited with pioneering the World War II first-person shooter genre when it debuted in 1999. Against all odds, the leadership choices you make before and during the heat of battle define your legacy as a hero in this highly anticipated addition to the franchise.\n\nIn Medal of Honor European Assault, the story line is the star. The setting is Europe, 1942. These are desperate hours for Allied forces as the Nazi war machine rages across a devastated European landscape. You are U.S. Army Lieutenant William Holt, hand-picked by William &quot;Wild Bill&quot; Donovan to be the first field agent of the newly formed Office of Strategic Services?the OSS.Medal of Honor European Assault makes you the driving force in the struggle to liberate Europe.\n\nAs with the original Medal of Honor, producers sought counsel from numerous expert sources to make certain the game is historically accurate and as realistic as possible. EA's Los Angeles development team continues to work closely with the Congressional Medal of Honor Society to ensure that the game reflects the ideals and integrity of the prestigious Medal of Honor. In addition, Capt. Dale Dye, who served as military technical advisor on the previous titles in the Medal of Honor franchise, continues his efforts with Medal of Honor European Assault to ensure the authenticity of the experience.\n","torrent":{"xt":"urn:btih:4f2e3348c3cbc0f9152677b8ccfdd073ddea0d67","amp;dn":"Xbox+-+RLT+-+Ultimate+Medal+Of+Honor+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f2e3348c3cbc0f9152677b8ccfdd073ddea0d67","infoHashBuffer":{"type":"Buffer","data":[79,46,51,72,195,203,192,249,21,38,119,184,204,253,208,115,221,234,13,103]},"announce":[],"urlList":[]}}