{"title":"Embrace - Dry Kids (B-Sides 1997 - 2005)","uid":3417325,"size":45633694,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f74c7745ecfff5f160dae1a89f28f6bef5f23df&amp;dn=Embrace+-+Dry+Kids+%28B-Sides+1997+-+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fire_Fight1978","files":1,"time":1133716722,"description":"Seen as a companion to the Fireworks: Singles collection, this 18 track b-sides album includes the wonderful b-side singles from both the Hut and Independiente catalogue which should be a must-have for their dedicated fans ? both old and new.\n\nTrack Listing\n\n1. The Shots Still Ringing\n2. Madelaine\n3. Flaming Red Hair\n4. One Big Family (Perfecto Mix ? Long Fade)\n5. How Come (Live)\n6. Dry Kids\n7. Butter Wouldn't Melt\n8. Too Many Times\n9. Blind (Road Version)\n10. Maybe I Wish\n11. Free Ride\n12. Feels Like Glue\n13. I've Been Running\n14. Brothers And Sisters\n15. Milk And Honey\n16. The Way I Do\n17. Love Is Back\n\n\nThe Shots Still Ringing\nThis is a recent b-side from the Gravity single. It has a great melody and strong chorus with very good, imagist lyrics. There isn't much to the arrangement, but the song itself is excellent.\n\nMadelaine\nFrom Looking As You Are this is a powerful ballad, loaded down with psychedelic guitar in the second half. It's really personal in the lyrics, and builds to a heavy emotional climax. An awesome tune, ought to have been a big album number.\n\nFlaming Red Hair\nThis might shock people because it doesn't sound like Embrace at all - it's a big, heavily-sequenced electronic funk thing, lots of laptop noises and big bass, it's a bit like Begging You by The Stone Roses. The chorus is excellent, the lyrics very obtuse and intriguing - it's kind of modern, psychedelic twisted disco. I love it!\n\nOne Big Family (Perfecto Mix - Long Fade)\nA wicked, dub remix of one of their best, rockiest singles - big trumpets, ENORMOUS bass and that great chorus and riff, it's really excellent. I remember dancing to this in clubs back in the day, wicked.\n\nHow Come (Live)\nA cover of the Eminem &amp; D12 tune that they did live on Radio 1, they wrote a whole new melody and chord structure for it rather than try and rap it. It's quite simple, but really good - you wouldn't know it wasn't an Embrace tune.\n\nDry Kids\nMost bands have tunes that define them, signature songs that all the fans know and love. Usually these are early singles and big album favourites - with Embrace you'd count All You Good Good People and Retread as some of those tunes, but Dry Kids is one too. It's short but incredibly sweet and tuneful - piano and guitar overlap so you can't always tell which is which. You can see why they named the compilation after this - it's a fantastic song.\n\nButter Wouldn't Melt\nThis is a Neil Young-ish piano-based song, the lyrics are quite threatening. There's an instrumental passage at the end which is really beautiful. If you think of Embrace as a band who write big, anthemic songs then this might surprise you because it's very delicate.\n\nToo Many Times\nThis is not delicate! The jump from Butter Wouldn't Melt to Too Many Times is amazing - this song clatters and batters and screams, big drums and bass playing a really odd rhythm. The sound is great too - lots of odd percussion and some effects on Danny's voice at times. Richard really plays guitar on this too, it's very manic. I really love it.\n\nBlind (Road Version)\nLike Dry Kids, this is another tune that kind of defines the band. It was originally on their first EP, but this is a different version, with the verses in the order they used to play it live. It's a great tune, really awesome riff and a fantastic, angry, shouted chorus. I love the intro and outro on this version too - it starts like a level crossing noise (?!) and ends with feedback. This might be my favourite song by the band, which is saying something!\n\nMaybe I Wish\nThis was on the Ashes single, and is a big, sing-a-long song that starts very quiet and intimate but ends up massive. Like The Shots Still Ringing there's not much to the arrangement, just a big wall-of-sound by the end of it, but the lyrics and melody again are really good. It's amazing that they just toss out songs like this as b-sides when other bands would kill for them!\n\nFree Ride\nFrom All You Good Good People, this is very short and very minimal, just piano and singing. I think it divides a lot of people - you either think it's beautiful or boring, so it seems. There's a lyric pinched off Rolf Harris according to the liner notes, what's that about! The melody goes quite fast for such a &quot;slow&quot; song too, which is odd.\n\nFeels Like Glue\nI love this song, it's really long, about 9 minutes, and very psychedelic, almost like post-rock or something. The guitars are ace, and the drums and bass and keyboards too. Even though it's a really big, weird psychedelic sound, the melody and chorus are really strong, like they've got a really good pop song and slowed it down and painted loads and loads of layers over it. About six minutes in Danny starts singing the phrase &quot;blue skies&quot; over and over again and the guitars sound like enormous waves and wind, flapping from speaker to speaker - it's amazing.\n\nI've Been Running\nThis is like an old soul song, like Otis Redding, but by the end there are massive guitars. It was on Hooligan. It's really well recorded - I have a nice hi-fi and it sounds like the band are in the room on this song.\n\nBrothers And Sisters\nThis is great, a really energetic, punky song with mad guitars and - I saw them do it live once, amazing! Bonkers lyrics too, I thought he was singing about a dog until I read the words in the sleeve?! One of my favourites.\n\nMilk And Honey\nThis is a typical &quot;Embrace&quot; song as most people think they sound, even though the other tunes here prove that they sound like a lot of things! It's much better arranged than the other big &quot;song&quot; songs here, the strings are ace.\n\nThe Way I Do\nThis is just beautiful, a kind of torch-song vibe. It's quite early, and Richard sings. The piano at the end is gorgeous.\n\nLove Is Back\nThis is another early one, and very stripped-back. It's very intimate sounding and simple, but beautiful.\n\nWaterfall\nThis was on Gravity too, and is kind of a weird, formless pop song. There are some really lovely strings and a beautiful, slightly messy guitar break. There's quite a big chorus too which you don't notice arriving.","torrent":{"xt":"urn:btih:4f74c7745ecfff5f160dae1a89f28f6bef5f23df","amp;dn":"Embrace+-+Dry+Kids+%28B-Sides+1997+-+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f74c7745ecfff5f160dae1a89f28f6bef5f23df","infoHashBuffer":{"type":"Buffer","data":[79,116,199,116,94,207,255,95,22,13,174,26,137,242,143,107,239,95,35,223]},"announce":[],"urlList":[]}}