{"title":"DIVA - PAL DVD","uid":3275854,"size":4531009536,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4fc024806233822cf1c27117e112f3e6e071450d&amp;dn=DIVA+-+PAL+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Beria00","files":11,"time":1105569539,"description":"DIVA - Jean-Jacques Beineix 1981\nProcess under DVD decrypter - no more no less \n\nDIVA is a charming French original that combines intrigue, romance and a delirious soundtrack in a visually stunning and stylish debut from Jean-Jacques Beineix. Frederic Andrei stars as Jules, a postal courier obsessed with Cynthia Hawkins (Wilhelmenia Wiggins) an international opera star who refuses to be recorded, much to the dismay of her adoring public. Jules' passion for the opera diva's angelic soprano leads him to smuggle a recorder into a sold-out Parisian performance to commit her voice to tape. He privately enjoys his recording until he shares his secret with a new friend (Thuy An Luu) and simultaneously finds himself at the center of an international drug and sex scandal and a pirating operation that will do anything to get hold of his precious tape. Suddenly Jules becomes engulfed in scandal and must fight to stay one step ahead of the policemen and high-tech hitmen who are chasing him. Dizzying chase scenes are masterfully shot, culminating in a heart-pounding motorcycle chase through the underground Paris Metro. Jean-Jacques Beineix composes each shot like a still photograph, exploring the visual dichotomy between the high-tech disco aesthetic of 1980s Paris and the classic beauty of Cynthia's opera and the ancient city. The brilliant best-selling soundtrack highlights each stylish frame. DIVA is based on the novel by Delacorta.\n\nDiva, marked the directorial debut of Jean-Jacques Beineix. Co-produced by Galaxie. Shown at the Cannes Film Festival (market) May 15, 1981.\n\nRunning Time: 117 min\nPicture:\nAnamorphic\n1.66\n\nAudio:\nDolby Digital 5.1 - French\n\nSubtitles - Sverige. Suomista.\n\nAdditional Release Materials:\n\nTheatrical Trailer\nInteractive Features:\nScene Access\nInteractive Menus\nBiography \n\nAboute the film on the net:\nhttp://www.imdb.com/title/tt0082269/\nhttp://frenchfilms.topcities.com/nf_Diva_rev.html\nhttp://www.naturalbornviewers.com/archive/d/diva/review.htm\n\n\nHoppas det faller er i smaken... Beria\n","torrent":{"xt":"urn:btih:4fc024806233822cf1c27117e112f3e6e071450d","amp;dn":"DIVA+-+PAL+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc024806233822cf1c27117e112f3e6e071450d","infoHashBuffer":{"type":"Buffer","data":[79,192,36,128,98,51,130,44,241,194,113,23,225,18,243,230,224,113,69,13]},"announce":[],"urlList":[]}}