{"title":"10 Good Canadian Rock/Punk/Blues/Funk albums","uid":3400641,"size":729540542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4fec2b071abc616f778e71320ec4d6aefa1cde23&amp;dn=10+Good+Canadian+Rock%2FPunk%2FBlues%2FFunk+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pisspuck","files":131,"time":1130127354,"description":"I Mother Earth/Dig\n\n  I Mother Earth's first full length release didn't garner many followers at first, the album released at the tail end of heavy metal's peak. The first two singles, Rain Will Fall and Not Quite Sonic established the band as one of Canada's top rock groups, including a Juno Award victory for Best Rock Album. Marketing of IME strengthed in the US with the release of So Gently We Go and IME really took off when hard rockin' Levitate came out. \n\n\n1.\tThe Mothers\t \n2.\tLevitate\t \n3.\tRain Will Fall\t \n4.\tSo Gently We Go\t \n5.\tNot Quite Sonic\t \n6.\tProduction\t \n7.\tLost My America\t \n8.\tNo One\t \n9.\tUndone\t \n10.\tBasketball\t \n11.\tAnd The Experience\t \n12.\tThe Universe In You\n\n\nGinger/Far Out\n\nWhen vocalist/guitarist and founding member Kevin Kane left Canada's acclaimed Grapes of Wrath due to the cliched musical and personal differences, the remaining members -- Chris Hooper (drums), Tom Hooper (vocals, bass, guitars), and Vincent Jones (keyboards) -- carried on with the like-sounding and equally enjoyable Ginger. The band returned to Nettwerk Records (Grapes of Wrath's original label), releasing a self-titled, Canadian-only EP in 1993 and the full-length Far Out in 1994. Far Out was eventually released in the U.S. in 1995. The band followed with Suddenly I Came to My Senses in late 1996 for EMI Canada.\n\nFar Out is a well-paced album that clearly stands alongside the finer moments of Grapes of Wrath, alternating quieter, introspective moments with upbeat rockers and pure Beatle-esque pop.\n\n1.\tFar Out\t \n2.\tSolid Ground\t \n3.\tFeel Like Falling Down\t \n4.\tSaying Sorry Again\t \n5.\tKeep Looking Back\t \n6.\tOn The Road Yet Again\t \n7.\tOcean Drain\t \n8.\tThe Earth Revolves Around You\t \n9.\tMr. Attitude\t \n10.\tDarkside Of My Mind\t \n11.\tThe One Who Fell From Grace On The News\n\nBig Sugar/500 pounds\n\nLed by Toronto's subtle-guitar whiz Gordie Johnson, Big Sugar cover a dizzying number of bases on their second effort. The group kicks out the jams for a pair of mutant, acid blues in &quot;Ride Like Hell&quot; and &quot;I'm A Ram,&quot; stokes a hypnotic, National Steel groove on &quot;Sugar In My Coffee,&quot; wails out a lurching Tex-Mex riff for &quot;AAA Aardvark Hotel,&quot; and fascinates with an open-prairie/R&amp;B fusion on &quot;Wild Ox Moan.&quot; Impossible to pigeon-hole and freshly uncentered.\n\n1.\tRide Like Hell\t \n2.\tStanding Around Crying\t \n3.\tI'm A Ram\t\n4.\tSugar In My Coffee\t\n5.\tAll Over Now\t\n6.\tAAA Aardvark Hotel\t\n7.\tHow Many Times\t\n8.\tDeliver Me\t\n9.\tStill Waitin'\t\n10.\tWild Ox Moan\t \n11.\tRide On\n\nBig Sugar/Big Sugar\n\nBig Sugar, as a &quot;band&quot; was formed in 1991 with Johnson (Infidels, Molly Johnson, Watertown), Cross (Jane Siberry, Don Freed) and Wilkins (Rough Trade, David Wilcox) though the three musicians had worked together at impromptu jam nights for 5 years at the Hotel Isabella. Wilkins and Johnson were also members of a later day version of Downchild. \n\nWith the help of singer Molly Johnson (Alta Moda, Infidels), the band drew the attention of Tom Treumuth's Hypnotic Records who signed them and stuck them in a live-off-the -floor setting to do what they do best - improvise. 50 songs were recorded and 12 were released on their eponymous debut in 1991. \n\n1.\tSleep In Late\t \n2.\tCome Back Home\t \n3.\tMotherless Children\t \n4.\tSo Many Roads (For Clive)\t \n5.\tBemsha Swing\t \n6.\tStardust\t \n7.\tGround Hog Day\t \n8.\tJust About Sunrise\t \n9.\tGoodbye Train\t \n10.\tNowhere To Go\t \n11.\t'Round Midnight\t \n12.\tDevil Got My Woman\t\n\n\nThe Killjoys/Melos Modos\n\nSince Evan Dando seems to prefer bongs nowadays to songs, Killjoys' frontman Mike Trebilcock should be crowned power-pop's new heavyweight champ.\nThe belt would certainly fit. Trebilcock might not be as dreamy as the Lemonheads' Dando, but he pens the crispest, most effortless melodic rock on this side of the Big Star galaxy.\n\nI thought Gimme Five, Killjoys' ultra-solid sophomore record, might have drained Trebilcock's songwriting well. But Melos Modos proves the thing's damn near bottomless.\n\nLike Gimme Five and Starry before it, Melos Modos is as catchy as a soda-pop jingle and as sharply observed as a self-portrait.\n\nTrebilcock continues to write about relationships gone wrong with a richeye for bitter detail and a heart full of resignation.\n\nOn the sonic side, he, bassist Shelley Woods and drummer Gene Champagne have shaken things up, throwing some slower tempos and the occasional country infection into the crunchy, hyped-up guitar mix.\n\nFor example, Sandalwood and 50, a bass-heavy lament that unfurls at the pace of an afternoon nap, might be the best thing Trebilcock's ever written.\n\nAnd that's saying something.\n\nThrough 11 songs, the trio builds up its perfect house of cards and then blows it down with the album-closing Rocketsleep, a mid-tempo gem that degenerates into caterwauling noise.\n\nIt's six minutes of guitar heaven that'll make you forget Dando was ever on pipe\n\n1.\tPerfect Pizza\t \n2.\tBeckon Call-Girl\t \n3.\tHonesty Mistake\t \n4.\tI've Been Good\t \n5.\tSandalwood and 50\t \n6.\tThat's All\t \n7.\tOne Goodbye\t \n8.\tUnpaid\t \n9.\tLucky Me\t \n10.\tCheerleader Type\t \n11.\tWeeds and Worms\t \n12.\tRocketsleep\t \n13.\tHang-Up\n\nMystery Machine/10 Speed (Multimedia track not included)\n\n\nMoving away from the higher volume that marked their first album, 10 Speed also starts to show less reliance on the band's early influences (although the very beginning sure sounds like Husker Du, doesn't it?). It's a solid album pretty much all the way through, with more of the band's own personality. It's also a notable release for another reason: it was one of Nettwerk's initial forays into the world of mixed-media compact discs, and Nettwerk was one of the first labels to try it, meaning, this was one of the first commercially available multimedia audio compact discs. Not all of the copies released to the public had the multimedia portion, however; those who didn't get the multimedia instead got an excellent cover version of Blondie's &quot;Heart of Glass&quot; with Kristy Thirsk of Rose Chronicles on guest vocals.\n\n1.\tCd-Rom\t \n2.\tPound For Pound\t \n3.\tHorn O' Plenty\t \n4.\tBrand New Song\t \n5.\tGouat Eeyesss\t \n6.\tPhantom Tollbooth\t \n7.\tJust A Sec\t \n8.\tSinker\t \n9.\tNeither The Players\t \n10.\tMouser\t \n11.\tChihuahua\t \n12.\tNeath\t \n13.\tPothead\t \n14.\tTime Killer\t \n15.\tOne Hour Action/Drama\n\nBootsauce/ The Brown Album\n\n\nFormed in Montreal in 1989 through a chance meeting between Drew Ling and guitarists Perry Johnson (who'd go under the pseudonym of Pere Fume) and Sonny Greenwich, the original group was rounded out with Alan Baculis on bass and drummer Rob Kazenel. After quickly becoming staples on the Ontario/Quebec circuit they were signed to Vertigo Records, releasing their debut in 1990. Corky Laing was called in, who'd earned a name as the drummer for Mountain and established himself as a renowned producer, working with the likes of Wilkinsons and recording with practically everyone who was anyone. THE BROWN ALBUM was a unique mix of funk and hard-driving rhythms, capturing the airwaves by surprise. The first two singles &quot;Masterstroke&quot; and &quot;Scratching The Whole&quot; paved the way for the all-out assault Canadian radio would endure with the remake of Hot Chocolate's &quot;Every One's A Winner&quot;, and then &quot;Play With Me&quot;. Basically overnight sensations, they hired new drummer Marc Villeneuve and hit the road, including a European tour opening for The Cult. Their debut soon went gold, with the group's image translating well to video as well - scoring them awards from MuchMusic as well as winning a 'best single' Juno for &quot;Every One's A Winner&quot;.\n\n1.\tLet's Eat Out\t \n2.\tScratching The Whole\t \n3.\tSex Marine\t \n4.\tCatastrophe Seas\t \n5.\tEveryone's A Winner\t \n6.\tPlay With Me\t \n7.\tLovin' Pain\t \n8.\tPayment Time\t \n9.\tCatcher In The Raw\t \n10.\tMasterstroke\n\nMonkeywalk/ More\n\n\nMontreal baritone vocalist Bil Ringgenberg and bassist Andrew Frank played in the funk band Seven Sisters from 1982 to 1987. They were growing tired of the British funk sound they'd been playing and moved towards a more R &amp; B feel as Monkeywalk. \n\nIn 1992, the duo released their self-titled debut album which featured the addition of dozens of musicians to flush out their sound by including ex-Triumph guitarist Rik Emmett and Ellen McIlwaine. A tour featuring the duo with three sidemen followed. \n\n1995's 'More' repeated the groove formula with Rik Emmett and Randy Cooke among others adding their veteran faculties, but the disc failed to gain the duo any notoriety or airplay. \n\nIn 1996 they re-invented themselves again as a '90's version of Bourgeois-Tagg under the name Driving Blind. Rik Emmett returned once again to help the duo recreate their vision.\n\n1.\tPanic Temporary\t \n2.\tRelease\t \n3.\tThat's Not Love\t \n4.\tAll I Want\t \n5.\tFaith Luck And Power\t \n6.\tSneaking Suspicion\t \n7.\tEverywhere\t \n8.\tLouder\t \n9.\tMore\t \n10.\tMorning's On Time\n\nDriving Blind/Driving Blind\n\n\nBil Ringgenberg and Andrew Frank have spent a lot of time listening to contemporary pop and rock, and you hear it on their debut album under the name Driving Blind -- the distorted guitar sound of alternative rock, the dry, stuttered percussion (sorry, &quot;rhythm programming&quot;) of hip-hop, the throaty earnestness typical of John Hiatt in Ringgenberg's vocals. Such trendy musical elements are all the more apparent in the duo's spare arrangements, in which each instrument can be heard clearly, but they don't overwhelm the songs. What's curious in these underproduced tracks is that, while they are so much more about feel and groove than they are about meaning, the presentation tends to focus the attention as much on what Ringgenberg is singing about as the soulful way he's singing it.\n\n1.\tCrown\t \n2.\tFly\t \n3.\tHypnotized\t \n4.\tContradictions\t \n5.\tIt Matters\t \n6.\tAnything Can Happen\t \n7.\tLove Dies Laughing\t \n8.\tNext Fool\t \n9.\tBoomerang\t \n10.\tCover Your Eyes\n\nColin James/ Colin James\n\n\nThis Canadian guitarist, singer and songwriter is Canada's answer to the U.S.'s Chris Duarte or Kenny Wayne Shepherd. Colin Munn grew up in Saskatchewan, listening to folk and blues. After learning the pennywhistle and mandolin, he quit school and worked with a succession of bands, among them, the Hoo Doo Men.\n\nWhen he was 19 years old, he moved to Vancouver and joined the Night Shades. About two years later, performing under his changed name, Colin James, he was lucky enough to be noticed by the folks at Virgin Records, who signed him. James's 1988 self-titled debut was the fastest-selling album in Canadian history, and he followed that in 1990 with Sudden Stop, and Colin James and the Little Big Band in 1993. In 1995, James switched over to Warner Music Canada, and released Bad Habits. On Bad Habits, James is teamed with some good company: Bobby King and Terry Evans, Mavis Staples, guitarist Waddy Wachtel, Lenny Kravitz and former Stevie Ray Vaughan and Double Trouble keyboardist Reese Wynan\n\n1.\tFive Long Years\t \n2.\tVoodoo Thing\t \n3.\tDown In The Bottom\t \n4.\tChicks 'n' Cars (And The Third World War)\t \n5.\tWhy'd You Lie\t \n6.\tHidden Charm\t \n7.\tBad Girl\t \n8.\tLone Wolf\t \n9.\tDream Of Satin\t \n10.\tThree Sheets To The Wind","torrent":{"xt":"urn:btih:4fec2b071abc616f778e71320ec4d6aefa1cde23","amp;dn":"10+Good+Canadian+Rock%2FPunk%2FBlues%2FFunk+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fec2b071abc616f778e71320ec4d6aefa1cde23","infoHashBuffer":{"type":"Buffer","data":[79,236,43,7,26,188,97,111,119,142,113,50,14,196,214,174,250,28,222,35]},"announce":[],"urlList":[]}}