{"title":"Necromandus - Orexis Of Death (UK Heavy Prog Rock, 1972) (256)","uid":3312092,"size":57203925,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:505b95a9480f16ca1f6a8e002d2ea9770ea20d30&amp;dn=Necromandus+-+Orexis+Of+Death+%28UK+Heavy+Prog+Rock%2C+1972%29+%28256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"brainticket","files":12,"time":1112659311,"description":"'This is one of the most obscure dark Heavy Progressive bands from the early 70Â´s and sadly this album was never offical released, although Vertigo were showing interest. During 1972 and 1973 they toured a lot with the mighty Black Sabbath in the UK and Tony Iommi quickly took them under his wing, due to the uniqueness of their music and the mystical image. In early 1973 the band entered the Morgan studios and Iommi not only guested on the title track, adding some subtile Jazz-Rock soloing. He also produced the whole album but the circumstances werenÂ´t the easiest for Iommi, because he was totally involved in touring and recordind with Black Sabbath and so he was losing interest after it all, the band fell apart and this album never saw the light of day. It was really a great shame because &amp;quot;Orexis Of Death&amp;quot; offers so much variety. ' - C\n\n'More information has surfaced regarding former NECROMANDUS bassist Dennis McCarten, who died of a kidney illness in London, aged 54. \nDennis McCarten was the very first bass player with Ozzy Osbourne's BLIZZARD OF OZZ band, alongside his NECROMANDUS colleagues, guitarist Barry Dunnery and drummer Frank Hall. \nThe band recorded a number of tracks before Ozzy rejoined BLACK SABBATH for the &amp;quot;Never  Say Die&amp;quot; album. This is all documented exclusively with first-hand accounts in Garry Sharpe-Young's Ozzy Osbourne biography.'- OHB\n\nHeavy prog rock with a Sabbath vibe.\nEnjoy!\nbrainticket","torrent":{"xt":"urn:btih:505b95a9480f16ca1f6a8e002d2ea9770ea20d30","amp;dn":"Necromandus+-+Orexis+Of+Death+%28UK+Heavy+Prog+Rock%2C+1972%29+%28256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"505b95a9480f16ca1f6a8e002d2ea9770ea20d30","infoHashBuffer":{"type":"Buffer","data":[80,91,149,169,72,15,22,202,31,106,142,0,45,46,169,119,14,162,13,48]},"announce":[],"urlList":[]}}