{"title":"Delilah's Gold - Delilah's Gold EP","uid":3376318,"size":33463929,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50e755058b763d0ae2932cb9ae69b58fa4a45807&amp;dn=Delilah%5C%27s+Gold+-+Delilah%5C%27s+Gold+EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bobson1983","files":4,"time":1125335255,"description":"Delilah's Gold are a fairly new band from London. If you like the EP then please buy it from iTunes or from www.delilahsgold.com. Check out the reviews below...\n\nSINGLE OF THE WEEK: &quot;Seductive guitars, slinky bass lines, and subtle string arrangements paint Delilah's Gold, and in particular ?Into The Dust' , into a world of film noir chic where their moroseness may be gloriously basked within.&quot; www.gigwise.com\n\n&quot;Delilah's Gold are a band releasing their debut EP and already sounding like a stadium rock band with all the confidence, polish and self-assuredness that that brings with it. In singer Natalie Valentine they have someone with a voice that sounds custom built for rock stardom and that the band create walls of atmospheric pop speaks volumes for their chances.&quot; ukmusicsearch.co.uk\n\n&quot;Delilah's Gold is an affecting and dramatic band. With great vocals and fantastic arrangements Delilah's gold EP is an incredibly strong debut release.&quot; Glasswerk.co.uk\n\n&quot;These songs were written to melt the coldest hearts.&quot; theplasticashtray.tk\n\n&quot;The first thing you hear when you put in this CD is the stunning vocals, although this band is not just about vocals, as they play some great guitar harmonys. . . I really like this band and if you are looking for something that sounds unique and different then check this band out.&quot; Musicpress.co.uk\n\n&quot;The music has a certain timeless feel to it, and the production is of the highest possible standard. You almost get the feeling that these guys are there already, after such a short time together.&quot; Queep Organic Music","torrent":{"xt":"urn:btih:50e755058b763d0ae2932cb9ae69b58fa4a45807","amp;dn":"Delilah%5C%27s+Gold+-+Delilah%5C%27s+Gold+EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e755058b763d0ae2932cb9ae69b58fa4a45807","infoHashBuffer":{"type":"Buffer","data":[80,231,85,5,139,118,61,10,226,147,44,185,174,105,181,143,164,164,88,7]},"announce":[],"urlList":[]}}