{"title":"MSN Messenger 7 0 0632 Beta Patch","uid":3301118,"size":258558,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:510c4ea96c4cc9ca618d14a8ed325135f78c78a2&amp;dn=MSN+Messenger+7+0+0632+Beta+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stianu89","files":1,"time":1110643749,"description":"Allows you to patch MSN Messenger 7.0.0632 BETA with the following options: enable polygamy, install custom games, remove the (beta) tag, disable nudges, remove add contact label, remove msn search bar, remove banner ad, remove msn today button, fix nickname length, remove white (text ad) space from conversation windows, distinguish Idle from Away status, remove MSN logo (from main and conversation window), remove premium services (what's hot), remove conversation window search button, remove email button, remove my space button, remove all contact card buttons, swap now playing artist and song title, disable nudge protection, remove user is writing message, fix black border around display pictures, remove winks/packs and/or nudges buttons and change handwriting tab images to text.\n\nNEW: multi-language support (currently: English, Dutch, Portugese), enable/remove Toaster for Winamp in Personal Messages, clicking your MSN Display Picture in the main window opens the display picture dialog (like it used to), make conversation text boxes semi-transparent by default, fixed packs button removal bug, made the Idle status feature work for all languages.\n\nScreenshot\nhttp://www.mess.be/_pictures/screenshots/messpatch604.png","torrent":{"xt":"urn:btih:510c4ea96c4cc9ca618d14a8ed325135f78c78a2","amp;dn":"MSN+Messenger+7+0+0632+Beta+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510c4ea96c4cc9ca618d14a8ed325135f78c78a2","infoHashBuffer":{"type":"Buffer","data":[81,12,78,169,108,76,201,202,97,141,20,168,237,50,81,53,247,140,120,162]},"announce":[],"urlList":[]}}