{"title":"Jagd Gruppen 101 - A clinical insight into the West German death","uid":3494276,"size":2248399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5110a7eca0f59eb7b3babb416cc90c86822705ad&amp;dn=Jagd+Gruppen+101+-+A+clinical+insight+into+the+West+German+death&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"red_gonzo","files":1,"time":1149938364,"description":"This amazing book with a full title: I, Omega - Jagd Gruppen 101 - A clinical insight into the West German death squad 1945-86 (2001), represents a unique account and a true story of the infamous West German top secret military unit called Jagd Gruppen 101 (Hunter group 101) designed to speed the reunification of Germany, which was divided after WW2. Created by the Landerhoff organization after the war, its members were trained from their birth to become the ultimate killing machines with a fanatic devotion to Germany and its people. The dramatic story of this German elite force, which can only be compared to the very best military units like the American Delta force or British SAS, is told by its unit&amp;#039;s commander and sole survivor since the unit was betrayed by high political circles inside Germany which still want to erase any evidence of its existence. The unit is responsible for thousands of mysterious deaths all over the world as they would take upon any enemy of Germany, mostly the Soviets and Americans. Experience the lifes of the members of this elite commando unit which fought behind the scenes in order that Germany would be reunited again. 290 pages with some photographs.\n","torrent":{"xt":"urn:btih:5110a7eca0f59eb7b3babb416cc90c86822705ad","amp;dn":"Jagd+Gruppen+101+-+A+clinical+insight+into+the+West+German+death","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5110a7eca0f59eb7b3babb416cc90c86822705ad","infoHashBuffer":{"type":"Buffer","data":[81,16,167,236,160,245,158,183,179,186,187,65,108,201,12,134,130,39,5,173]},"announce":[],"urlList":[]}}