{"title":"Xbox - RLT - Burnout Revenge","uid":3385613,"size":1845906777,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:522ffd1480035eb92aedd095c676b664c3a09340&amp;dn=Xbox+-+RLT+-+Burnout+Revenge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shady78","files":1,"time":1127228321,"description":"Ntsc\nEnglish\n\nnormally i wouldent upload somthing that has been 3 or 4 times and being well seeded but many people have been asking me to do a RLT release cuz they where having various problems with some of the other ones so here it is works 100 percent on my end everybody enjoy\n\n\n\nLink\nhttp://www.xbox.com/en-US/burnoutrevenge/default.htm?level1=enusgames&amp;level2=newgames1&amp;level3=burnoutrevenge\n\n\n\nBurnout Revenge? (winner of the Game Critics E3 2005 Best Racing Game award) isn't about trick chrome rims or gaudy neon lights. You don't spend your time tuning your car and trying to get a driver's license. Get ready for a fast-paced, adrenalin-fueled battle racer with retina-searing speed.\n\nTake the challenge and exact revenge on rush hour traffic, vindictive rival racers, and anything else that gets between you and the finish line. Think you're ready for multi-level tracks, vertical takedowns, and epic crash sequences that put Hollywood to shame? Fight dirty or go down in flames?the only rule is complete automotive anarchy. Burnout Revenge is built for battle.\n\n\n\nFeatures  \n \n \n\nPrepare for carnage: Battling is the only way to advance. Use the new Revenge Meter to track your progress as you reap rewards for playing dirty. \nChoose your car, choose your weapon: Every vehicle is a potential weapon, whether you're ramming an unsuspecting commuter into your rival or orchestrating an explosive multi-car pileup. \nNavigate tricked-out tracks: The multi-level racetracks are loaded with alternate routes, extreme jumps, hard stops, and nasty chokepoints.  \nEngage in car-to-car combat: Smash through traffic and wreak havoc to beat the clock in the fast and furious Traffic Attack mode.  \nGo crazy in Crash mode: This popular game mode is back, overhauled from the ground up to include more destruction and devastation than ever before. \n \n \n \nGame Information  \n \n\nPublisher\nElectronic Arts \n\nDeveloper\nCriterion Games \n\nStreet Date\nSeptember 2005 \n\nPrice\n$49.99 \n\n \nRating\nEveryone\n\n \n\n \n \n \n \n \n \n\n  Players 1-2 \n  HDTV 480p \n  Live Multiplayer \n  \n","torrent":{"xt":"urn:btih:522ffd1480035eb92aedd095c676b664c3a09340","amp;dn":"Xbox+-+RLT+-+Burnout+Revenge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522ffd1480035eb92aedd095c676b664c3a09340","infoHashBuffer":{"type":"Buffer","data":[82,47,253,20,128,3,94,185,42,237,208,149,198,118,182,100,195,160,147,64]},"announce":[],"urlList":[]}}