{"title":"Keller &amp; Schonwalder - Live at Jodrell Bank [E-Newage]","uid":3492495,"size":208059090,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5248930ac455b03814901f0e77995418be9aa0c8&amp;dn=Keller+%26+Schonwalder+-+Live+at+Jodrell+Bank+%5BE-Newage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Paul_E","files":6,"time":1149455943,"description":"Artist     : Detlef Keller &amp; Mario Schonwalder\nAlbum      : Live at Jodrell Bank\nSource     : NMR\nYear       : 2001\nGenre      : New Age Synthesizer\nLabel      : \n\nCodec      : LAME 3.93\nBitrate    : 256K/s  44100Hz  Joint Stereo\nID3-Tag    : ID3v2.3\n\n\nIncluded   : Booklet, Tray, NFO\n\n\n\nTrack Listing\n-------------\n 1. Part 1  (42:30)\n 2. Part 2  (46:57)\n 3. Encore  (18:42)\n\nTotal Playing Time: 108:10 (min:sec)\nTotal Size        : 198.2 MB (207,791,074 bytes)\n\n\n\n======================================================================\nEver since Keller &amp; Schonwalder played their initial concert at Jodrell Bank I have been asked if it would ever be released. Unlike their second performance which is spread over &amp;#039;The Reason Why Vols 1 &amp; 2&amp;#039;, their first gig had never seen the light of day. Well, five years later here it is at last! For this gig they were very much in Klaus Schulze mode with excellent use of syncopation and sequences throughout. The very long (over 42 minutes) &amp;#039;Part 1&amp;#039; gets underway. Slow ominous rhythms strike up as if accompanying a strange satanic ritual. A contrasting melodic tinkling sequence falls into formation as if positive energy is tempering the evil manifestation. Massed ethereal pads swell as the sequence begins to morph. A lead line bursts forward in the eighth minute and the Schulze comparisons become so strong that if I close my eyes it could be the great man himself sitting there (especially from his &amp;#039;X&amp;#039; through to &amp;#039;&amp;#039;Audentity&amp;#039; periods). The ways the sequences change are also dead ringers for his work. If memory serves I even think that the musicians were seated cross-legged on the floor with their instruments around them just as Klaus himself used to do. By the fifteenth minute there is a feeling that things are gradually starting to wind down. The sequence changes once again and a bright piano lead becomes the main feature. A hissing steam train sequence nestles in the middle of the mix as the original sequence disappears completely. By the twenty fourth minute we have descended to drifting atmospherics with just a little piano detail. Another sequence forms over vast string type pads (again like you know who). The pulsations become more hypnotic and higher in the mix as we continue our journey, little melodic touches floating over the top like morning mist being burned off by the sun. By the thirty fifth minute things have become very tranquil again, cello lead taking the major role with just soft pads and shuffling percussive effects to keep it company. Things gradually become fainter and fainter to finish. The sound quality is excellent over this whole double album, I assume being taken directly from the soundboard but there is some audience noise just during the last two minutes of the first track and the very beginning of the second. It is as if a microphone had been switched on to record the live ambience at the end of one set and beginning of the next. It is a very short section and I found it added to the feel of the recording (which I assume was the intention) rather than detract.\n\n&amp;#039;Part 2&amp;#039; begins with two pulsing sequences then in comes a bass rhythm. The sequences surge forward once more and in no time at all we are blasting along at quite a pace. Lead lines flash over the top like laser fire. This is exciting stuff! More rhythm is added as things reach even more blissfully energetic heights. This level of excitement can&amp;#039;t be kept up forever however without incurring injury so in the twelfth minute the intensity subsides to a gently pulsating brew. You do get the impression though that the power elements are simply regrouping and indeed that is the case as by the eighteenth minute things are belting along again (a bit like a combination of &amp;#039;Drive Inn&amp;#039; and &amp;#039;Are You Sequenced?&amp;#039;) By the twenty fifth minute things calm down to a nice head nodding pace controlled by two restrained rhythmic loops through which uplifting pads soar. A melodic sequence emerges morphing this way and that- lovely stuff. This section itself builds to a climax then subsides to a fizzing throb and soft tinkling loop. Things become increasingly moody and spectral, sighing effects drifting from the speakers. Lead lines take their turn to come and go- once again all very Schulzian as we float along in a blissed out state.\n\nThe audience demand more so we get the aptly titled &amp;#039;Encore&amp;#039;. Breathy / windy atmospherics get things going but this is going to be no atmospheric finish. A sequence rumbles forth slowly rising in the mix and a ticking percussive loop bounces off the top. Insistent drums then join in the fun as does yet another sequence, this time sounding rather Baumannesque as if off the &amp;#039;Trans Harmonic Nights&amp;#039; album. What a combination! More rhythmic flourishes take us close to a wonderfully manic overload. The lead lines also start to go ape. The is soooo good! What an awesome finish. I am delighted that we can listen to this concert once again. It brings back memories of an awesome evening. (DL) \n\n\n","torrent":{"xt":"urn:btih:5248930ac455b03814901f0e77995418be9aa0c8","amp;dn":"Keller+%26+Schonwalder+-+Live+at+Jodrell+Bank+%5BE-Newage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5248930ac455b03814901f0e77995418be9aa0c8","infoHashBuffer":{"type":"Buffer","data":[82,72,147,10,196,85,176,56,20,144,31,14,119,153,84,24,190,154,160,200]},"announce":[],"urlList":[]}}