{"title":"The Chameleons - Why call it anything?","uid":3460897,"size":95211337,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:529600aeb837901247ed4d69a0b6f6257851764e&amp;dn=The+Chameleons+-+Why+call+it+anything%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TommyJoker","files":10,"time":1143018934,"description":"The Chameleons - &quot;Why Call It Anything?&quot;(2001)\n\nMore info at: &lt;a href=&quot;\nhttp://www.thechameleons.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thechameleons.com/&lt;/a&gt;\n\nAfter various live appearances and the engaging acoustic retrospective Strip, the Chameleons reunited with Strange Times producer Dave Allen to create the eagerly awaited Why Call It Anything, only the fourth real studio collection from the full band and the first such album in 15 years. Happily, Why Call It Anything continues the band&amp;#039;s well-deserved reputation, the more so because for all the unmistakable marks of the Chameleons, the rich guitars, and powerful singing, it&amp;#039;s not simply a recreation of any of the previous albums -- like those three, this one stands on its own. In ways, Why Call It Anything is the most traditional-sounding Chameleons album yet, one that bears clear evidence of the members&amp;#039; various solo and group pursuits throughout the 1990s, a new emphasis on almost folk-based song structures, acoustic guitars a more regular part of the arrangements. Consider &quot;All Around,&quot; with its killer chorus, softly descending without sounding sad, or the melancholy chime of &quot;Lufthansa,&quot; a haunting number worthy of comparison to &quot;Tears&quot; or &quot;Seriocity.&quot; Then there&amp;#039;s the reggae toasting guest vocal from Kwasi Asante on &quot;Miracles and Wonders,&quot; definitely a first for the band. Those who expect the full electric thrill of hearing Burgess again backed by the Fielding/Smithies duo won&amp;#039;t be disappointed either; there are plenty of new highlights throughout, Lever&amp;#039;s underrated but always excellent drumming \nanchoring things down. There are the lush electric touches on &quot;Anyone Alive?,&quot; the \nstrung-out, mysterious conclusion of &quot;Truth Isn&amp;#039;t Truth Anymore,&quot; or the yearning, quietly epic surge of &quot;Dangerous Land,&quot; arguably the album&amp;#039;s most underrated song. While the huge crunch and cinematic scope along the lines of &quot;Swamp Thing,&quot; &quot;The Heale,r&quot; and &quot;Soul in Isolation&quot; no doubt will be missed by some, the end results still have a worthy loveliness that grows with repeated listening. Through it all, Burgess&amp;#039; warm voice, singing lyrics dedicated to his favored subjects of personal connection in a cold world, constantly makes clear what band this is about and why it has inspired such devotion. \n\n1. Shades  \n2. Anyone Alive?  \n3. Indiana  \n4. Lufthansa  \n5. Truth Isn&amp;#039;t Truth Anymore  \n6. All Around  \n7. Dangerous Land  \n8. Music In The Womb  \n9. Miracles And Wonders  \n10. Are You Still There?  \n\n\nRipped at 224kbps","torrent":{"xt":"urn:btih:529600aeb837901247ed4d69a0b6f6257851764e","amp;dn":"The+Chameleons+-+Why+call+it+anything%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529600aeb837901247ed4d69a0b6f6257851764e","infoHashBuffer":{"type":"Buffer","data":[82,150,0,174,184,55,144,18,71,237,77,105,160,182,246,37,120,81,118,78]},"announce":[],"urlList":[]}}