{"title":"Microsoft Fury3","uid":3409911,"size":364735125,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:54d99d663a6a311a0386ce311173bae2e3b0909d&amp;dn=Microsoft+Fury3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Addley","files":1,"time":1132121403,"description":"Microsoft Fury3\n----------------\nSome People Carry the World on Their Shoulders.\nYou Carry It in Your Sights.\nFury3 features 3 parallel playing fields with multiple missions on 8 unique worlds.\n\nWho says you can't save the world? In Fury3, you have to save eight of them. From the sweltering heat of a tropical world to a toxic chemical wasteland, you'll find plenty of places to vent. And with targets above, below, and on each planet's surface, you'll see why it's fury - to the third power. \n\nTake a shot at the great wide open. Whether it's a red planet or a moon, you'll be gasping for breath as you break the speed of sound - battling enemy fighters above an alien world. \n\nCruise in complete control with six degrees of freedom. You've just broken through the cloud cover and you're diving at a frightening pace. Six degrees of freedom means you can move in a any direction. So you can attack key enemy installations with confidence and control.\n\nCrash through corridors of the underworld! Use shields and weapons - whatever it takes - to maneuver through a labyrinth of tight spots. Stereo sound echoes through this underworld, where a wrong turn could lead to disaster - or strange surprises!\n\nHave an out-of-body experience! Just give the command and get an instant view of your location, your objectives, and hidden tunnels under the planet surface.\n\nStick it to 'em. Fury3 takes full advantage of six degrees of freedom, pushing your joystick to its maximum potential. And with joysticks such as Microsoft SideWinder 3D Pro, you can use the hat-switch control to look in any direction while your ship maintains its original course. \n","torrent":{"xt":"urn:btih:54d99d663a6a311a0386ce311173bae2e3b0909d","amp;dn":"Microsoft+Fury3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54d99d663a6a311a0386ce311173bae2e3b0909d","infoHashBuffer":{"type":"Buffer","data":[84,217,157,102,58,106,49,26,3,134,206,49,17,115,186,226,227,176,144,157]},"announce":[],"urlList":[]}}