{"title":"Pan Y Regaliz (1971 Spanish Prog-Psych)","uid":3399896,"size":49591845,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:552e89970dd9da2100ab05d792e290ad53b8ead8&amp;dn=Pan+Y+Regaliz+%281971+Spanish+Prog-Psych%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"notimetolose","files":11,"time":1129980962,"description":"Pan Y Regaliz (1971 Spanish Prog-Psych)\n\nRipped by Meurglys\nTorrented by notimetolose\n\nMusicians:\nGuill&amp;eacute;n Par&amp;iacute;s (vocals, flute)\nAlfons Bou (guitar)\nArtur Domingo (bass)\nPedro van Eeckout (drums) (he replaced Santiago Garc&amp;iacute;a Cort&amp;eacute;s)\n\nTracks:\n1- One More Day\n2- Waiting In The Munster's Garden\n3- Dead of Love\n4- Thinking In Mary\n5- A Song For The Friends\n6- When You Are So Bring Down\n7- Today It Is Raining\n8- I Can Fly\n9- Magic Colors (single)\n\nFolks, I don't know why nobody has ever torrented this album before. If your ears are wide open to the fresh winds from the Catalonian coast, you're in for a treat! I dedicate this upload respectfully to the masters of the psychotorrent: ChrisGoes (aka ChrisGoesRock), test78, guthlac2, magowl and all those I fail to remember.\n\nAnd now for the smallprint. I translated these Spanish articles myself, and neither English nor Spanish are my first language. The long-winded style of the Spanish writers didn't make my task any easier, so I hope you forgive me if I made a mistake or two.\n\n\nOne of the pioneering Spanish progressive bands, in the wave of the ambient prog-psych. A band with a great instability in their line-up, which kept them from becoming one of the important ones. They stopped playing in the early 80s.\n(J.J. Iglesias, Atropos Magazine)\n\n\nThe first incarnation of this group cut a single at the legendary label 'Els 4 Vents' (The 4 Winds). After that, they decided on a major contract with the new label 'Dimension' and changed their name to 'Pan' and ultimately 'Pan Y Regaliz' (Bread And Licorice) so that people would identify them with their first group.\n\nProblems with a claim of breech of contract (made worse by the fact that the contracts of the under-aged musicians had been signed by their parents) on behalf of their first label 'Els 4 Vents' did not keep them from cutting their record 'Pan Y Regaliz', their first and only one.\n\nWith Pedro van Eeckout on drums they recorded eight songs in English, in a prog-psych style that wasn't common to any Spanish band. Songs like &quot;Dead Of Love&quot;, &quot;Thinking In Mary&quot; and &quot;A Song For A Friend&quot; were made intentionally to be launched as singles, and in the purest style of psychedelic pop with touches of Jethro Tull.\n\nBut songs like &quot;One More Day&quot;, &quot;When You Are So Bring Down&quot;, &quot;I Can Fly&quot; and the experimenting and free-flowing (and favourites of mine) &quot;Waiting In The Munster's Garden&quot; and &quot;Today It Is Raining&quot; make this record very recommendable. The special touch of Guill&amp;eacute;n Par&amp;iacute;s on flute and the style of modulating his voice close to the excellent participations of the other musicians give this record the necessary category to place them in the ranking of the best groups of the era, and could have made any German Krautrock or English progressive group drop dead of envy.\n(Manuel Dachada) \n\n\nThis group's distinctive trademark was the sound of the flute, and they moved on terrains that were far from psychedelia, but still rather close to the progressive. They didn't have a great complexity, but on the other hand their themes had a lot of personality, reaching very intense moments, always featuring the flute of Guill&amp;eacute;n Par&amp;iacute;s. The 9 minutes of 'Today It Is Raining' are their particular psychedelic excursion , and on the album no theme could be as different as 'A Song For The Friends', sung in a style of 1940's musical movies, something like Freddy Mercury did on the first albums of Queen - but before Queen had even started to make music.\n(Alberto Alb&amp;aacute;s)","torrent":{"xt":"urn:btih:552e89970dd9da2100ab05d792e290ad53b8ead8","amp;dn":"Pan+Y+Regaliz+%281971+Spanish+Prog-Psych%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552e89970dd9da2100ab05d792e290ad53b8ead8","infoHashBuffer":{"type":"Buffer","data":[85,46,137,151,13,217,218,33,0,171,5,215,146,226,144,173,83,184,234,216]},"announce":[],"urlList":[]}}