{"title":"911 Revisited: Scientific and Ethical Questions by Steven Jones","uid":3458917,"size":730957182,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55af9a151e943233b671cb0794579b49efdbfbc2&amp;dn=911+Revisited%3A+Scientific+and+Ethical+Questions+by+Steven+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ReVIsed","files":1,"time":1142647977,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from users named &quot;b2pilot187&quot; and &quot;transcout&quot; (they&amp;#039;re probably the same person). Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won&amp;#039;t even read this, because he simply searches for &quot;911&quot; (and now &quot;Alex Jones&quot; too) and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\n\nLecture by Steven E. Jones, Professor of Physics, Brigham Young University, February 1st 2006.\n\nJones has written a paper regarding the September 11 terror attacks which is currently undergoing peer review and pending official publication in scientific journals. The most recent draft is posted on his faculty website at BYU ( http://www.physics.byu.edu/research/energy/htm7.html ). In this paper, &amp;#039;Why Indeed did the WTC Buildings Collapse&amp;#039;, Jones cites evidence supporting the hypothesis that controlled demolition, rather than simply the impact of jet airliners and the ensuing fires, caused the buildings to collapse. In the treatise, Jones presents evidence for the explosive-demolition hypothesis, which has yet to be analyzed in any reports funded by the United States government. Jones notes all three buildings fell symmetrically into their footprints, a phenomenon associated with &amp;#039;controlled demolition&amp;#039; and examined extensively by 9/11 researcher Jim Hoffman, in calling for renewed investigations into the 9/11 attacks. He points out, among other evidence, the speeds of the collapses, the &quot;pulverization of concrete to flour-like powder,&quot; and the presence of horizontal puffs of smoke observed ascending the side of WTC 7, common when pre-positioned explosives are used to demolish buildings. Jones notes that some aspects of the buildings&amp;#039; collapses remain poorly understood and that the demolition hypothesis can quickly resolve much of the debate. A passage in his paper addressing this point:\n\n&quot;...How do the upper floors fall so quickly, then, and still conserve momentum in the collapsing buildings? The contradiction is ignored by FEMA, NIST and 9-11 Commission reports where conservation of momentum and the fall times were not analyzed. The paradox is easily resolved by the explosive demolition hypothesis, whereby explosives quickly remove lower-floor material including steel support columns and allow near free-fall-speed collapses (Harris, 2000)....&quot;\n\nJones also examines the official reports by the Federal Emergency Management Agency (FEMA), National Institute of Standards and Technology (NIST) and the National Commission on Terrorist Attacks Upon the United States (aka the 9/11 commission), which all conclude fires and damage alone caused complete demolition of all three buildings. A central topic within Jones essay is the contention that the condition and nature of the debris which remained following the buildings&amp;#039; collapses was not consistent with the scenarios documented by FEMA and NIST; in particular, along with the observations of molten metal at Ground Zero by Leslie Robertson (WTC structural engineer)and Dr. Allison Geyh (a public health investigator from Johns Hopkins), Jones cites and includes photographic evidence, which he says show molten metal in the debris, and notes the reports on sulfidation of structural steel.\n\nNote: This is the raw footage from camera 1, and not the final production (will be postet later). But everything is here.\n\nFilesize.....: 697 MB\nRuntime......: 02:13:09\nVideo Codec..: DivX5\nVideo Bitrate: ~ 630 kb/s\nAudio Codec..: MP3\nAudio Bitrate: 80 kb/s \nFrame Size...: 720x576","torrent":{"xt":"urn:btih:55af9a151e943233b671cb0794579b49efdbfbc2","amp;dn":"911+Revisited%3A+Scientific+and+Ethical+Questions+by+Steven+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55af9a151e943233b671cb0794579b49efdbfbc2","infoHashBuffer":{"type":"Buffer","data":[85,175,154,21,30,148,50,51,182,113,203,7,148,87,155,73,239,219,251,194]},"announce":[],"urlList":[]}}