{"title":"MOBILedit! 1.98 + serial","uid":3389783,"size":12807546,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:568799d79fce10eaf001b71f16eb587a902b056d&amp;dn=MOBILedit%21+1.98+%2B+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"useros","files":1,"time":1128015760,"description":"MOBILedit! is a unique modular program which allows you to control your mobile phone from the PC via Bluetooth, infrared or cable. You can easily copy photos from your phone or upload your favorite ringtones, logos, MP3's and transfer documents too. You can dial, send SMS's, receive calls, organize contacts, play games and much more. With a simple click, backup all your data, copy them to different mobile phones and manipulate your contacts without even touching the phone. When you receive an SMS, it arrives on your PC in a similar way as an email; simply reply to it or move the SMS to the archive. You will become much more productive as a result. MOBILedit! is designed as an operating system, you can enhance its functionality by adding new plug-in applications and drivers.\n\nSome key features of &quot;MOBILedit&quot;:\n&amp;middot; unique open architecture with phone drivers and installable applications\n&amp;middot; communication via infrared, Bluetooth or cable\n&amp;middot; large quantity of mobile phones supported (virtually all)\n&amp;middot; file system enabling work with multi-media files stored in a phone like ringtones, photos, MP3's, themes, and java applications\n&amp;middot; a powerful editor for phonebooks stored in phones or SIM cards\n&amp;middot; search and dial directly from your computer phonebook quickly\n&amp;middot; send SMS messages quickly from your PC\n&amp;middot; sort, read, and archive your SMS messages on your hard drive\n&amp;middot; archive and AutoBack-up will protect your data in case you lose your phone\n&amp;middot; play games like Chess, Backgammon and many others on your PC through your mobile phone\n&amp;middot; all mobile phone functions will be possible to control, even those yet to be developed\n&amp;middot; powerful printing\n&amp;middot; skinnable design; new look on the net\n&amp;middot; complete MS Outlook support\n\nChanges in Version 1.98:\n- new phones have been added: Sony Ericsson W800i; Motorola V186\n- SMS plugin contains a powerful Auto-response feature and can also automatically move incoming messages to the Archive (Enterprise version only). This allows using MOBILedit! for many new purposes such as a voting server, etc.\n- MMS picture edit available in PhotoEditor\n- SMS export to formats MED, XLS (Excel) and XML has been added\n- MMS export to formats MED and XML has been added\n- MMS export to XLS format including pictures has been added\n- SMS plugin now fully supports long SMS messages, so you can read a split message at once\n- exported .med files can be imported as an offline device if no device is available\n- source device name will be shown for SMS messages in the Archive\n- phonebook export to XLS format has been added\n- fixed error on Samsung during Phonebook reading: &quot;The data area passed to a system call is too small (0000007A)&quot;\n- fixed error on Motorola during SMS reading: &quot;Filename is too long (0000006F)&quot;\n- other minor fixes\n\nHomepage - http://www.mobiledit.com/\n\nSize: 12.2 MB","torrent":{"xt":"urn:btih:568799d79fce10eaf001b71f16eb587a902b056d","amp;dn":"MOBILedit%21+1.98+%2B+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"568799d79fce10eaf001b71f16eb587a902b056d","infoHashBuffer":{"type":"Buffer","data":[86,135,153,215,159,206,16,234,240,1,183,31,22,235,88,122,144,43,5,109]},"announce":[],"urlList":[]}}