{"title":"PS2DVD - 25 To Life [USA]","uid":3433089,"size":1478302474,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:58a81b0b42a2b8189d4d7d56e4bc9fb4abbf9423&amp;dn=PS2DVD+-+25+To+Life+%5BUSA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":15,"uploader":"changoboy","files":31,"time":1137626259,"description":"25 TO LIFE is the first true Cops and Robbers game. Choose your side in this urban action third person shooter. The game delivers intense online game-play for up to 16 players, as well as a rich single player experience. Witness the gritty lifestyles of police task forces or strive to survive as a gangster fighting your way out of the streets. The story unfolds through the eyes of Detective Lester Williams of the local Police Department and Andre Freeze Francis, the street lieutenant of the 22nd St D-Boys, a well established street gang whose greedy philosophy keeps their enemies in fear. Their gritty journeys are conveyed through four intertwined chronicles that culminate into true life lessons. Freeze, a young twenty-something hustler is trying hard to get out the game, stay down with his lifelong crew and avoid his third strike. But when Calderon, Freezes lifetime homeboy, double crosses him on the last Job; it forces Freeze to get revenge, save his only son from a life of crime and survive a series of deadly shootouts. Along the way, Freeze faces-off with Detective Williams and his deadly partner, Maria Mendoza. Freeze must also step to a legion of haters out to kill him?\n\nFeatures: \n\n? Over 40 weapons to choose from including Shotguns, Machine Guns, Stun Guns, and Tear Gas. \n? Build a clan and take it online. Battle with up to 16 players in this intense urban battlefield. \n? Fully customizable characters. Display your ranking by unlocking and customizing your gear. \n? Compelling single player game-play allows you to see the story unfold from the unique perspective of both criminals and law enforcement. \n? Take down your opponents with both lethal and non lethal methods.","torrent":{"xt":"urn:btih:58a81b0b42a2b8189d4d7d56e4bc9fb4abbf9423","amp;dn":"PS2DVD+-+25+To+Life+%5BUSA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a81b0b42a2b8189d4d7d56e4bc9fb4abbf9423","infoHashBuffer":{"type":"Buffer","data":[88,168,27,11,66,162,184,24,157,77,125,86,228,188,159,180,171,191,148,35]},"announce":[],"urlList":[]}}