{"title":"World of Warcraft: The Burning Crusade Preview Trailer","uid":3402522,"size":50681856,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:595b3e250fe6396b14b4ac9ce917ea221e40974c&amp;dn=World+of+Warcraft%3A+The+Burning+Crusade+Preview+Trailer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sparkz","files":1,"time":1130531889,"description":"World of Warcraft: The Burning Crusade Preview Trailer\n\nSeveral years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal to investigate the realms beyond the known world. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought vanquished have returned to renew their terrible Burning Crusade?\n\nWorld of Warcraft: The Burning Crusade is the exciting new expansion to Blizzard's award-winning massively multiplayer online role-playing game. It expands the game by tremendous bounds, adding new races, lands, Battlegrounds, professions and items, and more. Here is just a partial list of what you can expect from the World of Warcraft expansion:\n\n\tAn increase in the level cap to 70\n\tTwo new playable races, including the magical Blood Elves\n\tNew starting zones in Quel'Thalas and beyond\n\tThe entire new continent of Outland, reachable through the Dark Portal\n\tMany new high-level dungeons to explore in Azeroth, Outland, and elsewhere\n\tNew flying mounts in Outland \n\tMany new and dangerous monsters, including epic world bosses\n\tHundreds of new quests\n\tHundreds of new items\n\tA new profession: Jewelcrafting\n\tSocketed items\n\tAnd much, much more...","torrent":{"xt":"urn:btih:595b3e250fe6396b14b4ac9ce917ea221e40974c","amp;dn":"World+of+Warcraft%3A+The+Burning+Crusade+Preview+Trailer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"595b3e250fe6396b14b4ac9ce917ea221e40974c","infoHashBuffer":{"type":"Buffer","data":[89,91,62,37,15,230,57,107,20,180,172,156,233,23,234,34,30,64,151,76]},"announce":[],"urlList":[]}}