{"title":"Talking Dictionary 7.1.0 + crack","uid":3277910,"size":7488573,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:59bb35d7e1154271ce68b8364bf35dff8196005e&amp;dn=Talking+Dictionary+7.1.0+%2B+crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kpis","files":1,"time":1105922375,"description":"Talking Dictionary 7.1.0 \n\nCODEhttp://www.talkingsoftware.gothere.uk.com\n\nThis encyclopaedic program is designed for use by visually impaired and / or disabled computer users. It is a very powerful program using an incredibly detailed dictionary / thesaurus database. Full instructions are included. It is possible to obtain a free demonstration copy of this product so that you can try before you buy. \n\nTalking Dictionary is a speech enabled 250,000 word English dictionary and thesaurus. Like all the talking software products on this site, Talking Dictionary has been designed for use by the non sighted person. All of the controls are easily remembered keyboard shortcuts and it is a very fast and easy program to use. \n\nLike all of the software products on this site, Talking Dictionary is designed to be used as a stand alone program. What this means is that you do not need any kind of screen reading software or anything else to use this program. Your PC must run Windows 95 or greater and you must have a soundcard or speakers. Talking Dictionary has been tested on Windows 95, 98, 98SE, Windows Millenium Edition, Windows 2000 and Windows XP. \n\nTalking Dictionary has many outstanding features, such as a powerful spell checker and the ability to quickly scroll through various word definitions and synonyms. The dictionary also comes complete with a &amp;quot;getting started&amp;quot; tutorial which gives you examples of using the dictionary. Comprehensive help is also built into the product. \n\n\n","torrent":{"xt":"urn:btih:59bb35d7e1154271ce68b8364bf35dff8196005e","amp;dn":"Talking+Dictionary+7.1.0+%2B+crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59bb35d7e1154271ce68b8364bf35dff8196005e","infoHashBuffer":{"type":"Buffer","data":[89,187,53,215,225,21,66,113,206,104,184,54,75,243,93,255,129,150,0,94]},"announce":[],"urlList":[]}}