{"title":"PS2DVD - True Crime Streets New York City [PAL] [MULTI3]","uid":3419564,"size":2021358078,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:5aac632ff7fc416078bd30f1ad6438b39181e94a&amp;dn=PS2DVD+-+True+Crime+Streets+New+York+City+%5BPAL%5D+%5BMULTI3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"changoboy","files":42,"time":1134209714,"description":"Wield the ultimate power as a rogue street cop in New York City. You are Marcus Reed, a former criminal turned cop, using and abusing your authority to hunt down the murderer of your mentor while cleaning up the hoods of New York City, from Harlem to Chinatown. Your undercover investigation leads you through a murderous web of gangs and deceit as you battle crooks, your past, and everything else the city can throw at you.\n \nKey features:\n\nStreet cop life: bust criminals, take down foreign and local gangs, search and seize, extort, interrogate, and dispense justice your way--by the book or indulge in the temptations of the job. \nRule New York City: free-roaming authentic neighbourhoods, GPS-accurate streets and subways, landmark buildings, and countless interiors. \nDynamic environments: unprecedented environmental gameplay--use ovens, stoves, machines, coolers, pots, pans, chairs or anything else you can grab to pound enemies. \nVirtually every aspect of each city block--including people, streets, and buildings--reacts and changes based on your law enforcement decisions and ability to combat crime. \nHigh-speed shootouts: race through the streets of New York in shootouts! \nPull off stunts with motorcycles, sports cars, trucks, buses, and more. \nBrutal combat styles: switch fighting styles on the fly, from street fighting to a variety of martial arts modes, opening up an array of moves and strategies to take down enemies. \nHeavy weaponry: use high-powered police issue weaponry, bats, swords, and other melee weapons, or obtain black market arms like flamethrowers, grenade launchers, and more.","torrent":{"xt":"urn:btih:5aac632ff7fc416078bd30f1ad6438b39181e94a","amp;dn":"PS2DVD+-+True+Crime+Streets+New+York+City+%5BPAL%5D+%5BMULTI3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aac632ff7fc416078bd30f1ad6438b39181e94a","infoHashBuffer":{"type":"Buffer","data":[90,172,99,47,247,252,65,96,120,189,48,241,173,100,56,179,145,129,233,74]},"announce":[],"urlList":[]}}