{"title":"THE OUTLAW DVD # 2","uid":3440837,"size":3025153063,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5d5c3127a0474ed749b4bbb6b3a6d931a10c4689&amp;dn=THE+OUTLAW+DVD+%23+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wallace1957","files":9,"time":1139211576,"description":"THIS IS DVD # 2 of 20 made. I think this one will work!!!\nIn 1998, I started Recording all the Outlaw Channel that I could before this channel decided to scramble and then later went off the air. I recorded around 100 hours of commercial free Country shows such as the Porter Wagner show, The Wilburn Brothers show, Country Caravan, Country Carnival, Pop Goes the Country, The Gospel Jubilee, and others. These shows go back to the late 1950s to the early 1980s. I have converted 20 two hour DVDs from V.H.S. and used ULEAD DVD Maker. These DVDs feature Merle Travis, Charlie Pride, Loreta Lynn, Chet Atkins, Bobby Bare, Ray Price, Young Hank WIlliams Jr., Del Reeves, Jim Ed Brown, and as the DVDs keep coming, The Late Great Jim Reeves, The Florida Boys, The Happy Goodmans, The Original Hinsons, The Kingsmen, And Many others to follow. In the Past, I have uploaded Roy Buchanan and Rory Gallagher but I thought this would be an interesting DVD to try out and see if anybody likes this DVD. BY request this is DVD #2 I do not have any artwork for this. Thanks, Rick from Roy Buchanans HUB","torrent":{"xt":"urn:btih:5d5c3127a0474ed749b4bbb6b3a6d931a10c4689","amp;dn":"THE+OUTLAW+DVD+%23+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5c3127a0474ed749b4bbb6b3a6d931a10c4689","infoHashBuffer":{"type":"Buffer","data":[93,92,49,39,160,71,78,215,73,180,187,182,179,166,217,49,161,12,70,137]},"announce":[],"urlList":[]}}