{"title":"Material Issue: Destination Universe. 90's power pop @192+VBR","uid":3381765,"size":67745001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e525c5c360e6be230f8a597ba6059bc379f5dba&amp;dn=Material+Issue%3A+Destination+Universe.+90%5C%27s+power+pop+%40192%2BVBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pisspuck","files":13,"time":1126408540,"description":"oop power pop trio from chicago\n1 What Girls Want\n2 When I Get This Way(Over You)\n3 Next Big Thing\n4 Who Needs Love\n5 Destination You\n6 Everything\n7 Ballad Of A Lonely Man\n8 Girl From Out Of This World\n9 So Easy To Love Somebody\n10 Don't You think I Know\n11 The Loneliest Heart\n12 Whole Lotta You\n13 If you Should Fall\n\nA shamelessly retro power-pop trio from the American heartland, Chicago's Material Issue was the vehicle for singer/guitarist/songwriter Jim Ellison. One of the few first-rate, highly commercial rock bands with any kind of artistic self-respect that got anywhere in the 90s, their catalog is stuffed with quality tunes. Ellison was an astounding control freak: his writing, production, and guitar playing is meticulous, and he seems to aim for a radio hit on every track. That leaves him with a sound so consistent and conventional it's like Wonder Bread: he constantly reuses generic power chords and distortion, hardly ever veers from the power-trio format, rarely employs outside players, writes obsessively and directly about conventional romantic themes, and reaches over and over again for the same arsenal of dated rock flourishes: wah-wah pedals, gratingly fake British enunciation, drummer Mike Zelenko's insistent twist beats, and bassist Ted Ansani's Beatles-style tenor harmonies.\nNone of this relates at all to 90s indy rock - it's much more in the style of New Jersey's slightly earlier Smithereens. But it is fun, and remarkably well-crafted. Ellison has got to stand as one of the most heart-breakingly sensitive love-song writers of his time - you can easily hear the bleak, sincere heartbreak undergirding every line, no matter how clich&amp;eacute;d. It's not a coincidence that Ellison committed suicide in 1996. And his ear for catchy throw-away hooks is remarkable; I can't think of any rock writer working in the 90s who made this kind of thing seem so effortless. Even if you have trouble telling them apart, his tunes almost always grab your attention.","torrent":{"xt":"urn:btih:5e525c5c360e6be230f8a597ba6059bc379f5dba","amp;dn":"Material+Issue%3A+Destination+Universe.+90%5C%27s+power+pop+%40192%2BVBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e525c5c360e6be230f8a597ba6059bc379f5dba","infoHashBuffer":{"type":"Buffer","data":[94,82,92,92,54,14,107,226,48,248,165,151,186,96,89,188,55,159,93,186]},"announce":[],"urlList":[]}}