{"title":"Redshift - Siren (New Age Space, 1999)","uid":3431731,"size":131805399,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e85f46cddd4b7ec8380ff0b01b2f6942356692b&amp;dn=Redshift+-+Siren+%28New+Age+Space%2C+1999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jamestown1","files":17,"time":1137252930,"description":"NFO-file created by PostAssistant v009\nDate : 1/13/2006  --  Time : 6:39:02 PM\n \nArtist     : Redshift\nAlbum      : Siren\nSource     : CD\nYear       : 1999\nGenre      : New Age / Spacemusic\nLabel      : Distant Sun\n\nCodec      : Lame 3.92 \nQuality    : VBR, average 263kbps, joint stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\n\n\nIncluded   : This Info-File (NFO)\n             Playlist (M3U)\n             Frontcover\n             Backcover\n\nTracklisting\n------------\n01 (05:15) Bleed 1\n02 (03:15) Bleed 2\n03 (04:49) Bleed 3\n04 (09:34) Bleed 4\n05 (05:47) Bleed 5\n06 (11:04) Wraith\n07 (07:59) Bombers in the Desert\n08 (02:43) Siren 1\n09 (02:36) Siren 2\n10 (05:33) Siren 3\n11 (04:27) Siren 4\n12 (03:06) Siren 5\n\nPlaying Time : 66:08\nTotal Size   : 124 MB\n\n\nThe concept behind Redshift is the voyage to where sound and space become indistinct. While the group uses the sounds and stylings that emerged out of the Berlin scene of 1970s Germany, their mission goes beyond mere mimicry and the group produces music which explores the center of the Spacemusic genre as deeply as does the boundaries. \nIn November of 2002, Redshift marked their appearance at &quot;Hampshire Jam 2&quot; by releasing two albums: Halo, a studio work, and Siren, which was recorded live at the 6th Alfa Centauri Festival in Huizen, Holland on 10 April 1999. These two releases show Redshift continuing to refine their distinctive voice in a genre where ego and personality are concepts to overcome on the way to communing with the universe. \n\nHalo is a work hovering at the eternal dusk of dreams and interstellar space. It is a musical experience that offers the sensation of passing through something; perhaps a beam from some far-off galaxy or a shower of cosmic debris. The album is intelligently designed and the wonderful transistions between movements draw the listener along easily. Relying on moods created through texture and atmosphere, Halo also offers a strong melodic content which is matched by extraordinary ever-evolving sequencer cycling. The tight analogue tones dance up and down the octave, in and out of synchronization with a throbbing bass rhythm and create seemingly endless permutations of pulse and flow. Above this torrent floats misty consonant choirs cut by reed thin themes traversing the scales. \n\nSiren is more active; every minute of the disc seems filled with something that demands focus: bright guitar lead lines sober, brittle string pads surround, bold synth melodies search for accompaniment, Rhodes piano meanders melodically and the mellotron flute tugs emotionally at the heart. Siren is Redshift's document of their efforts to bring their music out of the studio and into the world; an artist's communion with their audience. At the center of this endeavor is Mark Shreeve's massive Moog modular synthesizer. With its aged components, quirky handling and legendary lineage, it's hard not to think of this museum piece as an &quot;endowed object&quot;. The more gear oriented attendees imagined that possibly by being at this concert and closely watching the musician/technician at center stage, one would gain some insight, some clue, into how this magical music is made. Throughout the concert, Shreeve was completely absorbed in the choreographed bending, stretching and reaching by which the myriad of dials, switches and patch cables of the monolithic Moog modular synthesizer were adjusted and tweaked - constantly shaping the sound and the relentless forward motion of each piece. Often with his back to the audience, Shreeve worked feverishly, oblivious to those around him. Periodically he would face front, calling up vintage sounds from more modern synths, and re-join his band - adding his part where called for in this multi-faceted realization. \n\nWith Halo and Siren, Redshift offers their version of the nocturne - that of shadows shifting in the darkness - and the neverending mystery of tonality's relationship with consciousness. \n\n- Chuck van Zyl/STAR'S END   16 Januray 2003\n\n\n\n","torrent":{"xt":"urn:btih:5e85f46cddd4b7ec8380ff0b01b2f6942356692b","amp;dn":"Redshift+-+Siren+%28New+Age+Space%2C+1999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e85f46cddd4b7ec8380ff0b01b2f6942356692b","infoHashBuffer":{"type":"Buffer","data":[94,133,244,108,221,212,183,236,131,128,255,11,1,178,246,148,35,86,105,43]},"announce":[],"urlList":[]}}