{"title":"Buzz Aldrin's Race Into Space CD Version","uid":3389949,"size":285744966,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5edb451a0137fa43dc4d05abb406ab218603fc8c&amp;dn=Buzz+Aldrin%5C%27s+Race+Into+Space+CD+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Mitjau","files":1,"time":1128034652,"description":"Doubtless one of the most original strategy games I've ever played, Buzz Aldrin's Race into Space is a computer simulation of man's greatest adventure, the race to the moon, based on designer Fritz Bronner's own obscure board game Lift Off!. It recreates all the excitement of every space mission using digitized footage from lift-offs, space walks, lunar landings and splashdowns. As Space Director of either NASA or its Russian counterpart, you have at your disposal the entire space inventories of both the U.S.A. and the U.S.S.R., and can plan and direct every conceivable space mission: sub-orbitals, orbital manned and unmanned; planetary and lunar flybys; LEM tests; lunar passes; lunar orbits; and lunar landings. You get to recruit and train 140 astronauts and cosmonauts and determine which ones have the &quot;right stuff&quot;. You determine which space hardware to research and develop and then you actually schedule and launch individual space missions. Buzz Aldrin's Race into Space offers twenty different approaches to the moon. Do you follow history or cut your own path to glory? Make Pete Conrad's dream come true with a Large-Earth-Orbital Gemini lunar pass mission! Make von Braun's Nova pipe dream a reality! Will this United States land on the moon first? Or will the Russians continue to dominate space and plant the red flag on the moon first? The game excellently captures the feel and complexity of 1960s space programs. Do you forego the crucial test missions because you're lagging behind? Or recruit more &quot;green&quot; astronauts? Configure every flight in detail-- from rocket types to flight plans.\n\nOverall, Buzz Aldrin is an incredible experience that's also educational, but be warned that it is an *extremely difficult* game-- even with the best rockets and astronauts money can buy, you will experience frequent mission failures that seem unreasonable. I bought this game when it came out in 1992, then the CD-ROM version in 1993 (which contains 600MB of rare historical footage, and is worth a find), and the game never left my hard drive since. For strategy gamers and space enthusiasts alike, this is a keeper.\n\nNote: Fritz Bonner, the game's designer, still has some copies of Liftoff!, the board game that BARIS was based on, for sale. Anyone interested should contact Fritz at this e-mail address. Thanks!","torrent":{"xt":"urn:btih:5edb451a0137fa43dc4d05abb406ab218603fc8c","amp;dn":"Buzz+Aldrin%5C%27s+Race+Into+Space+CD+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edb451a0137fa43dc4d05abb406ab218603fc8c","infoHashBuffer":{"type":"Buffer","data":[94,219,69,26,1,55,250,67,220,77,5,171,180,6,171,33,134,3,252,140]},"announce":[],"urlList":[]}}