{"title":"Utimaco SafeGuard Easy v3 20 1 93 SR1 MULTiLANGUAGE SUB100-CYGiS","uid":3282121,"size":55391026,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f071acd49fe19487c3b43634874c5f8cfee18ca&amp;dn=Utimaco+SafeGuard+Easy+v3+20+1+93+SR1+MULTiLANGUAGE+SUB100-CYGiS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"propp","files":1,"time":1106825855,"description":"SafeGuard Easy v3.20.1.93.SR1 *MULTiLANGUAGE* (c) Utimaco Safeware AG \n      \n   SafeGuard  Easy provides  total company-wide  protection for  sensitive\n   information on laptops and workstations. Boot protection, pre-boot user\n   authentication  and  hard  disk  encryption  using  powerful algorithms\n   guarantee  against unauthorized  access and  hacker attacks.  SafeGuard\n   Easy  is  both simple  to  install and  operates  transparently in  the\n   background.\n\n   SafeGuard  Easy  not only  supplies  vital boot  protection  on Windows\n   platforms,  but also  protects sensitive  data using  strong hard  disk\n   encryption.\n   \n   Using SafeGuard Easy, unauthorized  access to sensitive information  on\n   laptops or desktops is effectively prevented, because:\n   \n   Without  correct  authentication,  all  data  remains  encrypted  (boot\n   protection).\n   \n   Unauthorized persons are prohibited  from accessing the system  because\n   pre-boot authentication (PBA) requires  the authentication of the  user\n   before the operating system is  started. PBA cannot be manipulated  and\n   therefore guarantees maximum security.\n   \n   Many other protection programs are ineffective because they permit  the\n   readout of  the keys  or passwords  from the  hard disk. SafeGuard Easy\n   prevents this by generating the code key required for boot-up from  the\n   typed  password.  Even  hard  disk  analysis  tools  become ineffective\n   against SafeGuard Easy.\n   \n   Unlike other solutions which encode only selected files or directories,\n   SafeGuard Easy encodes the entire content of the hard disk. This  means\n   that all the information on the hard disk is protected - regardless  of\n   where the data is stored.\n   \n   Utimaco Safeware  uses powerful  algorithms and  encryption methods  to\n   ensure that  operating processes  are executed  efficiently and without\n   delays.\n   \n   SafeGuard Easy  provides boot  virus protection  to resist  boot sector\n   viruses - hazardous sabotage tools that operate by interfering with the\n   Master Boot Record and allowing hackers to gain control over the PC.\n   \n   SafeGuard Easy lives up to its name within all organizations regardless\n   of their size.  The software can  be installed conveniently  throughout\n   the  company  using  configuration  files  without  user  intervention.\n   SafeGuard Easy also allows user-specific privileges to be defined (e.g.\n   disabling disk encryption).\n   \n   A  secure  challenge/response   procedure  is  available   to  re-issue\n   passwords that have been entered incorrectly or forgotten.\n\n   \n   Characteristics\n   The most significant features of SafeGuard Easy are:\n   \u0007 Boot protection - allows boot-up  of the operating system only  after\n     correct authentication\n   \u0007 Strong hard disk encryption to protect information \n   \u0007 Encryption of external data media (e.g. floppy disk, ZIP,JAZ etc.) \n   \n   Easy handling, full scalability,  distribution via network and  central\n   administration  confirm  SafeGuard  Easy as  the  security  solution of\n   choice for every organization whatever the size.\n\n\n   Pre-Boot Authentication\n   The user  is authenticated  by means  of pre-boot  authentication (PBA)\n   before the system is started and therefore before the operating  system\n   is booted. Neither keys nor passwords are stored on the hard disk.\n\n   \n   Hard Disk Encryption\n   SafeGuard  Easy  encrypts the  entire  hard disk  or  individual parts,\n   irrespective  of the  file system  (e.g. NTFS,  FAT etc.)  - sector  by\n   sector,  including  the  operating  system,  temporary  files  and  all\n   information. SafeGuard Easy effectively  closes the security gaps  left\n   open by arbitrary file encryption.  Data that has been encrypted  using\n   SafeGuard Easy is securely protected from unauthorized access, even  if\n   the hard disk is removed.\n   \n   \n   Algorithms\n   SafeGuard  Easy  supports  the  newly  designated  advanced  encryption\n   standard, AES, with  256 and 128  bit key length,  Rijndael 256 bit  as\n   well as  IDEA 128  bit. This  powerful and  globally accepted algorithm\n   guarantees maximum protection.\n   \n   \n   Encryption of External Data Media\n   SafeGuard Easy supports the secure exchange of data between  individual\n   company offices by  using configurable data  media encryption (such  as\n   floppy disk, ZIP, JAZ etc.).","torrent":{"xt":"urn:btih:5f071acd49fe19487c3b43634874c5f8cfee18ca","amp;dn":"Utimaco+SafeGuard+Easy+v3+20+1+93+SR1+MULTiLANGUAGE+SUB100-CYGiS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f071acd49fe19487c3b43634874c5f8cfee18ca","infoHashBuffer":{"type":"Buffer","data":[95,7,26,205,73,254,25,72,124,59,67,99,72,116,197,248,207,238,24,202]},"announce":[],"urlList":[]}}