{"title":"Audio Editor Gold 8.4.0","uid":3465043,"size":7716266,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f3e7fcfe530577afc94a9a979df7df65b9aacb9&amp;dn=Audio+Editor+Gold+8.4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cristy","files":4,"time":1143923692,"description":"Audio Editor Gold is an advanced and powerful, full-featured digital audio editing software. You can use it to record your own music, voice, or other audio, edit it, mix it with other audio or musical parts, add effects like Reverb, Chorus, and Echo, and master it so that you can burn it to a CD, post it on the World Wide Web, or e-mail it. It provides an intuitive, easy-to-use interface and enables you to perform a lot of operations without any difficulties! Audio Editor Gold supports all major audio file formats. If you&amp;#039;re using audio for anything - Websites, PowerPoint presentations, Flash animations, It will take your creations to the next level!\nUse Audio Editor Gold to record your own music, voice or other sounds, import and export lots of audio files formats, including Windows PCM (WAV), MP3, Ogg Vorbis, WMA 9 and AIFF, play it, mix it, edit audio files visually using Cut, Copy, Paste and applying more than 20 effects and filters, including: Cut, Paste, Move, Delete, Fadein/Out, Crossfade, Vibrato, Delay, Normalize, Fade, Flanger, Amplify, Invert, Insert Silence, and more.\n\nFeatures:\n- Open, create, and save audio files in any of the supported formats (can also save any portion of a loaded file to disk as a new file); \n- Display audio data waveform (Zoom Full, Zoom In, Zoom Out, Zoom Vertical); \n- Record audio data from a microphone or any other available input device (You can record audio from DVD / VCD / CD Player, Tapes\nand LP&amp;#039;s, MP3 Player, RealPlayer, Windows Media Player, Web Page, Internet Conversation, Internet News, Internet Radio Station and more); \n- Edit audio files visually (Cut, Copy, Delete Selection, Delete Silence, Paste, Paste From File, Mix, Mix From File); \n- Apply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize, Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.); \n- Apply different filters to any selected portion of audio files (BandPass Filter, FFT Filter, HighPass Filter, HighShelf Filter,LowPass Filter, LowShelf Filter, Notch Filter); \n- Convert an audio file from one format to another; \n- Use marker to locate the selected p","torrent":{"xt":"urn:btih:5f3e7fcfe530577afc94a9a979df7df65b9aacb9","amp;dn":"Audio+Editor+Gold+8.4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3e7fcfe530577afc94a9a979df7df65b9aacb9","infoHashBuffer":{"type":"Buffer","data":[95,62,127,207,229,48,87,122,252,148,169,169,121,223,125,246,91,154,172,185]},"announce":[],"urlList":[]}}