{"title":"Jesse Winchester - Talk Memphis (1981/VBR)","uid":3392233,"size":53759531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5fbc97ba07ca9591c98c0bb06cfc0dbd9db99dca&amp;dn=Jesse+Winchester+-+Talk+Memphis+%281981%2FVBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Reride","files":12,"time":1128463587,"description":"Having rushed to make Nothing but a Breeze and A Touch on the Rainy Side and getting his two least impressive albums for his trouble, Jesse Winchester spent two and a half years woodshedding before returning to the record racks with Talk Memphis. For the album, he returned to his hometown and worked with producer Willie Mitchell, best known for his Al Green records. It wasn't as unlikely a matching as might be imagined; Winchester had always had a soulful, flexible voice as ready as Green's to take off into the upper registers to express emotion. And Memphis-style R&amp;B had always been an element, along with country, folk, pop, and gospel, in Winchester's sound. On his early albums, his lighthearted style had been in the service of an embattled vision, but gradually that darkness gave way, to the point that he began to seem lightweight. Talk Memphis put his effervescence and musicality to good use, resulting in his first Top 40 hit, the catchy &quot;Say What,&quot; and the rest of the album was just as easy on the ears, with the title track providing a suitably gritty Memphis-soul sendoff. But that wasn't enough to break the album beyond the bottom rungs of the charts, and after seven albums in 11 years, Winchester left the world of major-label record-making. ~ William Ruhlmann, All Music Guide","torrent":{"xt":"urn:btih:5fbc97ba07ca9591c98c0bb06cfc0dbd9db99dca","amp;dn":"Jesse+Winchester+-+Talk+Memphis+%281981%2FVBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fbc97ba07ca9591c98c0bb06cfc0dbd9db99dca","infoHashBuffer":{"type":"Buffer","data":[95,188,151,186,7,202,149,145,201,140,11,176,108,252,13,189,157,185,157,202]},"announce":[],"urlList":[]}}