{"title":"ClipMate Ver 6.5.11.545 - Clipboard Enhancer","uid":3391984,"size":5228989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5fe58c4aa91e0d8b533095b042378eb3c9727029&amp;dn=ClipMate+Ver+6.5.11.545+-+Clipboard+Enhancer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rounder","files":5,"time":1128385367,"description":"ClipMate Ver 6.5.11.545 - Clipboard Enhancer\n\nBlurb from the developer:\nThe native clipboard in Windows is great for cutting and pasting a single item at a time, but if you want to move a series of items, or save items for later use, then you need ClipMate.\n\nRather than working with one piece of clipboard data at a time, ClipMate enhances the native clipboard functionality by remembering all items (both text and graphic) that are copied to the clipboard and storing them in 'collections' for later pasting. With ClipMate as a Windows companion, users will never accidentally lose a piece of clipboard data again. ClipMate's new relational database can hold dozens, hundreds, or even thousands of clips - of all formats including Text, Graphics, and HTML. And with ClipMate's new SQL-based search engine, you'll be able to find your data, and the new Shortcut feature keeps your most-frequently used clips right at your fingertips. \n\nClipMate makes you more productive by making the windows clipboard work better. It adds the functionality that Windows leaves out, starting with the ability to hold more than one item. (The regular Windows clipboard holds one item at a time) \n\nClipMate holds THOUSANDS of 'clips' for days, weeks, even years if you need it to.And you can organize, edit, re-format, print, combine, search, and manage your data.  You can even encrypt sensitive information like credit card numbers. We've even thrown in a spellchecker with thesaurus. \n\nDo you have a need to keep often-used (or seldom remembered) scraps of data around for easy pasting? Do you often need to move many pieces of data from one application to another?  How about answering questions on a mailing list or help desk?  Do you wish there was an easier way to make screen captures or prints? Or an easy way to clean up those &gt;&gt; marks and BAD FORMATTING in a great joke that arrived by e-mail before you pass it on? \n\nIf you don't do much copying and pasting - maybe there's a reason for that!  The regular clipboard is LAME (underpowered).  Don't give up on cut 'n' paste until you've tried it with ClipMate. You'll find new ways to use the clipboard, because it finally makes sense.\n\nIf you've ever misplaced something that you know you copied days earlier, if you've ever been overwhelmed by data, or if you've ever had to read data from one application as you typed it into another because cut 'n' paste would take too long, then relief is at hand.\nEnd blurb...\n\nhttp://www.thornsoft.com/clipmate6.htm\n\nPS. This provided version will not sneak out on the internet for serial key validation. And, btw, it's for sure the best clipboard enhancer at the moment.\n\n","torrent":{"xt":"urn:btih:5fe58c4aa91e0d8b533095b042378eb3c9727029","amp;dn":"ClipMate+Ver+6.5.11.545+-+Clipboard+Enhancer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe58c4aa91e0d8b533095b042378eb3c9727029","infoHashBuffer":{"type":"Buffer","data":[95,229,140,74,169,30,13,139,83,48,149,176,66,55,142,179,201,114,112,41]},"announce":[],"urlList":[]}}