{"title":"Shapeshifer - Riddum Wise LP [OGG]","uid":3495536,"size":70137501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6198483ae2315ae758d7f7fa8b4231864fc782c0&amp;dn=Shapeshifer+-+Riddum+Wise+LP+%5BOGG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"richms","files":11,"time":1150336935,"description":"Drum and Bass - \n\n\nNew Zealands Finest Release their Second Album. The Album is a Definite Progression from the Groups First Album &quot;Realtime&quot;, with an Emphasis on Funky Dancefloor Grooves, While Maintaining Strong Musical Elements. - Amazon.com\n\nOn listening to the first few bars of opener &quot;Shakedown&quot;, it becomes quickly apparent that Shapeshifter have taken a huge step up in terms of production and composition since their debut &amp;#039;Real Time&amp;#039;, its slinky groove and deep atmospherics are all class, recalling the subtle work of Total Science. &quot;Phenomenon&quot; treads similar ground, a solid groove this time touched up with jazz elements and a certain house influence. The album also features some strong vocal cuts, check Lady 6&amp;#039;s contribution to the Bukem-like &quot;When I Return&quot;, a world class slice of soulful D&amp;B, &quot;Been Missing&quot; features tour emcee and full time member P-Digsss, who updates Common into his own language with some fine lyrics and emotional delivery, and finally Dallas (Fat Freddy&amp;#039;s Drop) in his Joe Dukie alias sings all sweet like Luther Vandross on the sublime &quot;Long White Cloud&quot;, which has to be one of the best examples of NZ D&amp;B meets R&amp;B yet. Shapeshifter show themselves to be very adaptable throughout, with the more dancefloor orientated material also excellent, &quot;Tha Hybrid&quot; is perfectly suited to its title, crashing through your speakers like a soundclash between Dillinja and London Elektricity. &quot;Skateland Killa&quot; is another banging cut that works for the mind and feet, while the group even pull off a disco influenced cut with the awesome groove of &quot;Dynaflex&quot;. Anyone that has witnessed this group live know just how much effort and talent these guys put into their music, and with &amp;#039;Riddim Wise&amp;#039; they have come up with what is arguably NZ&amp;#039;s best Drum &amp; Bass album release so far - what makes it really special however is the fact that it is a Drum &amp; Bass album that would standout anywhere - and as a result Shapeshifter have an exciting future ahead of them. Recommended. Shipping 1st March. - nzmusic.com","torrent":{"xt":"urn:btih:6198483ae2315ae758d7f7fa8b4231864fc782c0","amp;dn":"Shapeshifer+-+Riddum+Wise+LP+%5BOGG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6198483ae2315ae758d7f7fa8b4231864fc782c0","infoHashBuffer":{"type":"Buffer","data":[97,152,72,58,226,49,90,231,88,215,247,250,139,66,49,134,79,199,130,192]},"announce":[],"urlList":[]}}