{"title":"The.Power.Of.Nightmares.NTSC.DVD-R","uid":3505879,"size":4385824768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:61e372e982926ff2b70c8da1d0b036bfef61db67&amp;dn=The.Power.Of.Nightmares.NTSC.DVD-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BhangWalla","files":1,"time":1153540822,"description":"This film explores the origins in the 1940s and 50s of Islamic Fundamentalism in the Middle East, and Neoconservatism in America, parallels between these movements, and their effect on the world today.\n\nFrom the introduction to Part 1 (Baby It's Cold Outside): &quot;Both [the Islamists and Neoconservatives] were idealists who were born out of the failure of the liberal dream to build a better world. And both had a very similar explanation for what caused that failure. These two groups have changed the world, but not in the way that either intended. Together, they created today's nightmare vision of a secret organized evil that threatens the world, a fantasy that politicians then found restored their power and authority in a disillusioned age. And those with the darkest fears became the most powerful.&quot;\n\nThe Power of Nightmares was first broadcast on BBC Two in three hour-long parts on consecutive Wednesday evenings in the autumn of 2004. The series was rebroadcast in late January 2005 on three consecutive nights, with the final part updated to reflect the Law Lords ruling from the previous December that detaining foreign terrorist suspects without trial is illegal.\n\nThis DVD is of the updated version of January 2005, and is NTSC, no region; many PAL DVD players will play NTSC DVDs, but the reverse is not true, so NTSC it is. It was created with the MPEG2 files available at http://www.archive.org/details/ThePowerOfNightmares with a menu added for good measure.","torrent":{"xt":"urn:btih:61e372e982926ff2b70c8da1d0b036bfef61db67","amp;dn":"The.Power.Of.Nightmares.NTSC.DVD-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61e372e982926ff2b70c8da1d0b036bfef61db67","infoHashBuffer":{"type":"Buffer","data":[97,227,114,233,130,146,111,242,183,12,141,161,208,176,54,191,239,97,219,103]},"announce":[],"urlList":[]}}