{"title":"Alex Jones - Police State 2 - The Take Over (2002)","uid":3416398,"size":731983872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61fc4c574361d4ca68939eb793cf72b29bfbf856&amp;dn=Alex+Jones+-+Police+State+2+-+The+Take+Over+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ReVIsed","files":1,"time":1133501540,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; (and now &quot;Alex Jones&quot; too) and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nThe corrupt central government has already implemented the first stages of an oppressive Police State -- MARTIAL LAW IS HERE!\nAlex Jones exposes the problem-reaction-solution paradigm being used to terrorize the American people into accepting a highly controlled and oppressive society. From children in public schools being trained to turn in their peers and parents, to the Army and National Guard patrolling our nation's highways, Police State: The Takeover reveals the most threatening developments of Police State control in our age.\n\nGenre: Documentary \nVideo Codec: DivX 5 \nVideo: ~799 kbit/s\nRuntime: 122 Min \nAudio Format: ~96 kbit/s MP3 CBR  \nFrame Size: 352x240 \nFramerate: 29,970 fps \nLanguage: English\n\nThe 'used FourcCC' in the .avi header is DX50. Hence, this file will play back on MPG4 (i.e. DivX5) compatible DVD-players.","torrent":{"xt":"urn:btih:61fc4c574361d4ca68939eb793cf72b29bfbf856","amp;dn":"Alex+Jones+-+Police+State+2+-+The+Take+Over+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61fc4c574361d4ca68939eb793cf72b29bfbf856","infoHashBuffer":{"type":"Buffer","data":[97,252,76,87,67,97,212,202,104,147,158,183,147,207,114,178,155,251,248,86]},"announce":[],"urlList":[]}}