{"title":"Blue Frog v1.5.0.1072 - Active Spam Deterrence System","uid":3409395,"size":6511185,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63b7e406a76152c6208f2e1ca54f8245c327a9a4&amp;dn=Blue+Frog+v1.5.0.1072+-+Active+Spam+Deterrence+System&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ythan","files":5,"time":1132008828,"description":"Blue Security takes an innovative approach to reducing the amount of spam received by its customers ? the members of the Blue Community.\n\nBlue Security maintains a list of members' e-mail addresses in the Do Not Intrude Registry and allows members to safely and effectively complain about spam they receive and request to opt out of spam mailing lists.\n\nThis approach creates an incentive for commercial email senders to respect the Do Not Intrude Registry and stop sending unsolicited e-mail to members of the Blue Community.\n\nIf spam messages are sent to Blue Community members, in violation of the Registry, Blue Security identifies the merchant's Web site advertised in the messages and issues an initial request asking the merchant to stop sending spam to the community.\n\nIf these requests are not resolved and the community continues to receive spam advertising the merchant's Web site, Blue Security develops a script that includes a set of instructions how to submit an opt-out complaint on the merchant's Web site.\n\nThis script is then received by Blue Security's client, the Blue Frog, installed on the members' desktop computers. Blue Frog executes the script and automatically posts opt out complaints on the merchant's Web site.\n\nEach user's Blue Frog will post opt out requests only regarding spam messages he or she received, such that the total number of requests posted by each user does not exceed the number of spam message he or she received.","torrent":{"xt":"urn:btih:63b7e406a76152c6208f2e1ca54f8245c327a9a4","amp;dn":"Blue+Frog+v1.5.0.1072+-+Active+Spam+Deterrence+System","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63b7e406a76152c6208f2e1ca54f8245c327a9a4","infoHashBuffer":{"type":"Buffer","data":[99,183,228,6,167,97,82,198,32,143,46,28,165,79,130,69,195,39,169,164]},"announce":[],"urlList":[]}}