{"title":"Age Of Empires III [DEMO]","uid":3380950,"size":383598662,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64ba86db49f8145cbab8bbae54be8cf9d695044c&amp;dn=Age+Of+Empires+III+%5BDEMO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"changoboy","files":4,"time":1126233538,"description":"Age of Empires 3 desembarca en Madrid de la mano de Bruce Shelley \nA pocos meses de su lanzamiento, que tendr&amp;aacute; lugar el 4 de noviembre, Age of Empires 3 ya presenta un aspecto envidiable, lo suficiente para que Bruce Shelley, dise&amp;ntilde;ador de la saga, haya podido presentar el juego en la sede madrile&amp;ntilde;a de Microsoft. Poco a poco nos desgran&amp;oacute; lo que ya sab&amp;iacute;amos, que el aspecto gr&amp;aacute;fico del juego es absolutamente impresionante, y muchos otros detalles a&amp;uacute;n desconocidos, como peque&amp;ntilde;os toques de rol encaminados a aumentar la diversi&amp;oacute;n.\n\nEn una abarrotada sala de prensa, Bruce Shelley comenz&amp;oacute; explicando algo que ya ten&amp;iacute;amos claro: Los chicos de Ensemble Studios han dirigido todos sus esfuerzos para conseguir un aspecto gr&amp;aacute;fico excelente. Se han dotado de la &amp;uacute;ltima tecnolog&amp;iacute;a gr&amp;aacute;fica y han incluido por primera vez el motor f&amp;iacute;sico Havok (famoso por su inclusi&amp;oacute;n en Half Life 2) en un juego de estrategia en tiempo real. El resultado excede con creces nuestras expectativas y se puede contemplar en todo su esplendor cuando los ca&amp;ntilde;ones atacan a la infanter&amp;iacute;a. Ante el bombardeo, &amp;eacute;stos saltan por los aires con gran realismo incluso perdiendo el sombrero y su arma en el aire. Los efectos acu&amp;aacute;ticos, el humo que sale de las casas, las sombras en tiempo real, el derrumbe real y diferente de cada edificio, las animaciones? Todo es nuevo y extremadamente realista. Sin duda, lo mejor que hemos visto en estrategia en tiempo real. \n\nLa segunda gran novedad de Age of Empires 3 es la creaci&amp;oacute;n de una caracter&amp;iacute;stica nueva: La ciudad natal. Al elegir un imperio se nos asignar&amp;aacute; una ciudad que ser&amp;aacute; nuestra capital y que ser&amp;aacute; la que nos mande ayuda militar y v&amp;iacute;veres para combatir en Am&amp;eacute;rica. Aqu&amp;iacute; es donde encontramos toques de rol, puesto que a lo largo del juego conseguimos puntos de experiencia que nos dar&amp;aacute;n acceso a cartas. Hay 100 cartas diferentes y en el juego crearemos una baraja de 20 como m&amp;aacute;ximo que no servir&amp;aacute; para desarrollar diferentes aspectos de nuestro imperio, como por ejemplo el comercio o la caballer&amp;iacute;a, seg&amp;uacute;n nos interese. Con la baraja decidimos lo que deseamos que haga nuestra ciudad natal y de ella depender&amp;aacute; la ayuda que obtengamos. Cuanto m&amp;aacute;s juguemos, m&amp;aacute;s fuerte ser&amp;aacute; la ciudad natal, porque cada vez conseguiremos nuevas cartas. Bruce Shelley asegur&amp;oacute; confiado en que este nuevo sistema aporta m&amp;aacute;s jugabilidad y diversi&amp;oacute;n al juego y que incluso se convertir&amp;aacute; en un minijuego atractivo por s&amp;iacute; solo.\n\nNo han desaparecido de Age of Empires 3 elementos como la recolecci&amp;oacute;n de recursos o el comercio. Sigue siendo importante aqu&amp;iacute;, como en los otros juegos de la saga, tener una econom&amp;iacute;a saneada, por lo que habr&amp;aacute; que poner &amp;eacute;nfasis en el comercio. Comenzaremos con senderos, luego evolucionaremos a carromatos, a diligencias y, por &amp;uacute;ltimo, el ferrocarril ser&amp;aacute; el sistema de comercio m&amp;aacute;s r&amp;aacute;pido y el que m&amp;aacute;s puntos de experiencia y recursos nos proporcionar&amp;aacute;. \n\nEl juego se inicia en 1492, con la conquista del Nuevo Mundo, y acaba en 1850, fecha en la que el desarrollo hist&amp;oacute;rico del armamento se dispara. En el modo de juego para un jugador nos encontraremos con una inmensa campa&amp;ntilde;a con 24 escenarios en el que seguiremos las aventuras a lo largo de varias generaciones de una familia que emigra al mundo reci&amp;eacute;n descubierto. El completo modo multijugador es el que har&amp;aacute; las delicias de los m&amp;aacute;s expertos, quienes encontrar&amp;aacute;n en el editor de escenarios una potente herramienta con la que podr&amp;aacute;n crear incluso los escenarios que podemos ver en el videojuego. \n\nAge of Empires 3 es pol&amp;iacute;ticamente correcto. Por ejemplo, no hay esclavitud y tampoco se puede acabar con los indios americanos. No se trata de hacer un retrato hist&amp;oacute;rico sino entretener. Con los indios americanos solo se pueden realizar alianzas, que ser&amp;aacute; muy &amp;uacute;tiles para generar nuevos guerreros, comerciar e incluso aprender nuevas tecnolog&amp;iacute;as.\n\nPocos d&amp;iacute;as despu&amp;eacute;s del lanzamiento del videojuego podremos hacernos tambi&amp;eacute;n con la edici&amp;oacute;n de coleccionista, que llega con un impresionante libro de 210 p&amp;aacute;ginas llego de arte y dise&amp;ntilde;os conceptuales de toda la saga, un DVD de ?making of?, la banda sonora original (que por cierto est&amp;aacute; muy bien y puede ser escuchada en la web oficial), un enorme p&amp;oacute;ster, una gu&amp;iacute;a exclusiva y un completo manual del juego.","torrent":{"xt":"urn:btih:64ba86db49f8145cbab8bbae54be8cf9d695044c","amp;dn":"Age+Of+Empires+III+%5BDEMO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ba86db49f8145cbab8bbae54be8cf9d695044c","infoHashBuffer":{"type":"Buffer","data":[100,186,134,219,73,248,20,92,186,184,187,174,84,190,140,249,214,149,4,76]},"announce":[],"urlList":[]}}