{"title":"Hitler - The raise of Evil [2003] +","uid":3274827,"size":1469491200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64f0c654d45836af573cc5303bdd1b97a07d3e7b&amp;dn=Hitler+-+The+raise+of+Evil+%5B2003%5D+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Playball","files":2,"time":1105313661,"description":"Starring Robert Carlyle as the Nazi dictator, Hitler: The Rise of Evil is a lavish made-for-TV two-parter that traces Adolf Hitler s early life, including his boyhood in Austria and impoverished period as a struggling artist in Vienna, culminating in 1934, by which time he had assumed the chancellorship of Germany. We bear witness to the rhetoric, ruthlessness and obsessive determination that propelled him to power, despite the best efforts of opponents like Matthew Modines campaigning journalist. His inadequate but despotic relationships with women, such as his tragic half-niece Geli Raubal, are also examined. \nCarlyle fares very well in what is traditionally considered the invidious task of bringing Hitler to dramatic life, conveying him plausibly as an impenetrably evil man, complex but irredeemable. However, this drama fails to explain just how and why such a pathetic, psychotic, unattractive individual such as Hitler could make such an immediate, profound impression on, for example, Ernst Hanfstangl and his wife Nina (ER s Julianne Margulies). Disproportionate attention is paid to Hitlers relationship to this American-born couple, perhaps as a sop to US audiences. In contrast, the social, cultural and political context of inter-war Germany is skimpily depicted here, making Hitlers ascendancy seem almost absurd\n\nMore info:\n&lt;a target=&quot;_blank&quot; href=&quot;http://www.play-film.com/playfilm/vis_nyheter.asp?id=44&quot;&gt;http://www.play-film.com/playfilm/vis_nyheter.asp?id=44&lt;/a&gt;","torrent":{"xt":"urn:btih:64f0c654d45836af573cc5303bdd1b97a07d3e7b","amp;dn":"Hitler+-+The+raise+of+Evil+%5B2003%5D+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f0c654d45836af573cc5303bdd1b97a07d3e7b","infoHashBuffer":{"type":"Buffer","data":[100,240,198,84,212,88,54,175,87,60,197,48,59,221,27,151,160,125,62,123]},"announce":[],"urlList":[]}}