{"title":"Rainbow - Bent Out Of Shape 1983 (EAC-APE-cover)","uid":3276322,"size":258236996,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:662e85584fc9cc64607f70a8922e3300e8639990&amp;dn=Rainbow+-+Bent+Out+Of+Shape+1983+%28EAC-APE-cover%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ritchie","files":1,"time":1105661893,"description":"With Joe Lynn Turner on board, Rainbow tried one crossover record and one no-frills hard-rock record -- which meant that Bent out of Shape, their third album with Turner, provided a fine opportunity to get a little arty. Not that the band has turned into Genesis or even returned to the mystical pretentions of their early work; they have merely broadened their horizons. Ironically, that means that they've retreated, at least partially, to the radio-ready sound of Difficult to Cure, but this time, they aren't just trying for a crossover hit. As producer, Roger Glover has widened their sonic horizon without losing sonic muscle, making sure that the album is, at its core, hard rock. His production works, since the record hits pretty hard even when it gets a little fruity, which it does quite often -- the stately, silly church organs that &amp;quot;Can't Let You Go,&amp;quot; the fugue-like cadences of &amp;quot;Fire Dance&amp;quot;), the mock-classical instrumental &amp;quot;Anybody There.&amp;quot; Those instrumental flourishes highlights Bent out of Shape's true strength, which is its sonics -- the record sounds good and the music flows well. However, beneath that surface, there's not much there there -- the songs don't have strong hooks, or are memorable in and of themselves. With that in mind, it's not entirely surprising that this is the last studio record Rainbow cut (although they would later reunite in the '90s), but it's not a bad way to go out. It sounds good and has some prime Ritchie Blackmore performances, plus it rocks pretty hard -- all essential ingredients for a good Rainbow record, even if this time it adds up to a record that's merely solid, not remarkable.","torrent":{"xt":"urn:btih:662e85584fc9cc64607f70a8922e3300e8639990","amp;dn":"Rainbow+-+Bent+Out+Of+Shape+1983+%28EAC-APE-cover%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"662e85584fc9cc64607f70a8922e3300e8639990","infoHashBuffer":{"type":"Buffer","data":[102,46,133,88,79,201,204,100,96,127,112,168,146,46,51,0,232,99,153,144]},"announce":[],"urlList":[]}}