{"title":"A Christmas Story","uid":3420524,"size":733853696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67267d88da749d5e248ec3748f6e45d4feb7e4ea&amp;dn=A+Christmas+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DiosX","files":1,"time":1134441570,"description":"It's 1940, in the northern Indiana town of Hulman. 9-year-old Ralph &quot;Ralphie&quot; Parker wants only one thing for Christmas -- an official Red Ryder carbine-action 200-shot range model BB rifle with a compass in the stock. Between his younger brother Randy and having to handle school bully Scut Farkus, Ralphie doesn't know how he'll ever survive long enough to get the BB gun for Christmas. When Ralph asks his mother for a Red Ryder BB gun for Christmas, she says, &quot;No, you'll shoot your eye out&quot;. When Mrs. Shields, Ralph's teacher at Harding Elementary School, assigns the class to write a theme about what they want for Christmas, Ralph sees a golden opportunity to express his desire to have a Red Ryder BB gun. Ralph gets a C+ on the theme, and Mrs. Shields has written &quot;You'll shoot your eye out&quot; on the theme. Ralph's next plan is to ask Santa Claus for a Red Ryder BB gun, and how does Santa respond? By saying &quot;You'll shoot your eye out, kid.&quot; By this time, Ralph has had enough of that. When Scut Farkus and his sidekick Grover Dill start in on Ralph while he's on his way home from school that day, Ralph knocks Grover Dill to the ground, beats Scut's face bloody, and then pounds Scut's head on the snow-covered ground several times. Ralph thinks he'll never get the BB gun for Christmas now. And all of the other kids are going to be getting what they want for Christmas. But someone may have planned a surprise for Ralph.","torrent":{"xt":"urn:btih:67267d88da749d5e248ec3748f6e45d4feb7e4ea","amp;dn":"A+Christmas+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67267d88da749d5e248ec3748f6e45d4feb7e4ea","infoHashBuffer":{"type":"Buffer","data":[103,38,125,136,218,116,157,94,36,142,195,116,143,110,69,212,254,183,228,234]},"announce":[],"urlList":[]}}