{"title":"Concerns about Israel Being the Cause of 9-11","uid":3418793,"size":8874104,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:683784d9789903b86146fa282b5839bf88f73c52&amp;dn=Concerns+about+Israel+Being+the+Cause+of+9-11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1134039595,"description":"During the 9-11 Commission's question-and-answer period, a man stood up and wanted an answer to a question that is on many Americans' minds: Why does the government refuse to address its biased support of Israel as being one of the primary motivating factors of the terrorists?\n\nIt is well known that Osama bin Laden and many others who attack America do so in response to America's continued support of Israel--one of the few un-democratic nations in the Mid-East that treats all non-Jews as second-class citizens and often builds its massive Apartheid Wall right through non-Jewish homes, bulldozing them down whenever the Israelis so please. Nevertheless, the American government is seemingly oblivious to this cause-and-effect madness--never willing to admit that its support of the terrorist state of Israel is what makes Americans the targets of those who oppose Israel's actions. \n\nIn a question-and-answer period shown on C-Span, one man bravely stood up and asked some questions that government insiders dared not answer. Lee Hamilton, a member of the 9-11 Commission, was tongue-tied as a patriotic American dared to ask why Congress continues to act like sycophants and cater to all the whims of the AIPAC plutocracy.","torrent":{"xt":"urn:btih:683784d9789903b86146fa282b5839bf88f73c52","amp;dn":"Concerns+about+Israel+Being+the+Cause+of+9-11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"683784d9789903b86146fa282b5839bf88f73c52","infoHashBuffer":{"type":"Buffer","data":[104,55,132,217,120,153,3,184,97,70,250,40,43,88,57,191,136,247,60,82]},"announce":[],"urlList":[]}}