{"title":"5 Good blues/ hard rock albums","uid":3399834,"size":365220778,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6a46627a981d16b854b780fc09ebc70f80818a71&amp;dn=5+Good+blues%2F+hard+rock+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pisspuck","files":76,"time":1129957582,"description":"Platinum Jive. The rock/funk synthesis is even more seamless, resulting in heavy music that drives hard and with great invention ? including ample spicy sonic details provided by flutes, horns and deftly arranged backup vocals. There's a rap number (&quot;Bona Fide,&quot; with Schoolly D) and a soul croon called &quot;Simply Barry,&quot; but mostly Platinum Jive rocks and roils, from the slamming opener &quot;Lion's Mouth&quot; through the trippy &quot;Your Days Are Numbered&quot; and the relentlessly rhythmic &quot;The Liquor Talkin'.&quot; Kudos also to the packaging, a hilarious sendup of greatest-hits albums that even lists fictional solo records by the individual Big Chiefs (Henssler's is called The Sexual Intellectual). The group's outside activities ? including the irreverent Motorbooty magazine, which Dancey edits ? tend to put a bit of time between Big Chief's releases, but the next one can't come too soon.\n\nBig Chief:Platinum Jive\n1)Lion's Mouth\n2)Takeover Baby\n3)John's Scared\n4)MD 20/20\n5)Map Of Your Failure\n6)Bona Fide\n7)Armed Love\n8)Philly Nocturne\n9)Locked Out\n10)All Down Hill From Here\n11)The Liquor Talkin'\n12)Sick To My Pants\n13)Clown Pimp\n15)Simply Barry\n16)Lot Lizard\n\n\n\nBacked by the former Badlands rhythm section of drummer Jeff Martin and bassist Greg Chaisson, vocalist/guitarist Mike Onesko and guitarist Scott Johnson blast blues/rock tracks reminiscent of such classic acts as Cream, Jimi Hendrix and Gary Moore\nBlindside Blues Band/Self Titled\n1)Bad Premonition\n2)Renegade\n3)Hit The Highway\n4)Blues In My Soul\n5)Flying\n6)Back Against The Wall\n7)Powerful Thing\n8)Burning Cities\n9)Early Grave\n10)Winner Takes All\n\n\nStraight ahead rock &amp; roll in the Southern tradition, with plenty of indie-rock energy to boot, is what has kept Dash Rip Rock going since 1984. A trio of vocalist/guitarist Bill Davis, bassist Ned &quot;Hoaky&quot; Hickel and drummer Chris Luckette, the group formed in 1984, originally with Fred LeBlanc on drums, though he left in 1989 (after the Mammoth label LPs Dash Rip Rock and Ace of Clubs) to found Cowboy Mouth. The duo then recruited Luckette and recorded 1990's Not of This World with producer Jim Dickinson. After the concert record Boiled Alive!, Dash Rip Rock left Mammoth Records and released 1993's Tiger Town on Doctor Dream. Two more label switches, from Sector 2 to Naked Language, preceded the release of 1995's Get You Some of Me (after which Luckette left the band) and 1996's Dash Rip Rock's Gold Record. Pay Dirt followed in 1998. ~ John Bush, All Music Guide\n\nDash Rip Rock: Boiled Alive\n1)Intro/Don't Wanna Stop\n2)Leave Me Alone To My Bottle\n3)Bum for Egypt (bumfuck egypt)\n4)White Lightinin'\n5)Hell's Scared\n6)Big Daddy Like Whisky\n7)Save The Whales\n8)Jambalaya\n9)longest Bridge In The World\n10)Pussywhipped\n11)Johnny Ace\n12)DMZ\n13)Endeavor\n14)Rich Little Bitch\n15)Fastest Song\n16)Delta Dawn (intro)\n17)Delta dawn\n18)Mud Island\n19)Shake That Girl\n\n\nIn Your Face is former David Bowie guitarist Earl Slick's third album, an eleven instrumental, two vocal (interestingly, both covers with guest vocals by Ron Young) CD, that will dazzle you with super guitar work, slinky slide playing, and solid energy. In Your Face was Slick's first instrumental effort, and came about as a result of a jam with bass player Kirk Alley and a conversation in 1984 with Terry Bozzio (whose drum playing on this album helps make it so appealing).? A superb guitarist, Slick's style is all his own, and yet reminiscent of Jeff Beck and Stevie Ray Vaughan. The CD is one of Slick's personal favorites, and song highlights include &quot;Surfer Junkie Dude&quot; and &quot;Tank&quot; (plus &quot;Across The River&quot; for you harp fans). Instrumental Guitar (Electric/Hard Rock/Blues), total running time, 48:08 - Earl Slick @ iTunes!\n\nEarl Slick:In Your Face\n1)In Your Face\n2)Pick n Shovel\n3)Surfer Junkie Dude\n4)Bottleneck\n5)Slow Down Slicky\n6)A Change Is Gonna Come\n7)Austin Boogie Blues\n8)Ghost Town\n9)Manic Depression\n10)Tank\n11)Across The River\n12)Howard Hughes\n13)Lullaby For A Redhead\n\n\nIf you recognized the title, maybe you already know. If you don't, then you owe yourself a CD to cherish. Rock denizens who survived the 70's (yeah, the 70's, man!) will remember a brief flash of pure brilliance from Texas known as STRAY DOG. The rest of you know the music from shows like Wonder Years done by the master himself, Snuffy Walden, one of the members of the original trio.\n\nWell, the first album (and a slew of live cuts) is out on CD and available on eBay. I won't plug the auction, you can find it. It's so fine to sit back and remember how fantastic that band was. No rules, no pretentions, just hard as nails rock and roll from a time when the whole world was starting to sound like Saturday Night Fever. \n\nGet your copy while you can. \n\nStray Dog: Fasten Your Seatbelt\n1)How It Is (The Sacred Mix)\n2)Tramp (Fat &amp; Sassy Mix)\n3)You Know\n4)Crazy ('bout to Lose My Mind Mix)\n5)The Journey\n6)Drive My Car\n7)Tramp/Dog's Blues (live)\n\n","torrent":{"xt":"urn:btih:6a46627a981d16b854b780fc09ebc70f80818a71","amp;dn":"5+Good+blues%2F+hard+rock+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a46627a981d16b854b780fc09ebc70f80818a71","infoHashBuffer":{"type":"Buffer","data":[106,70,98,122,152,29,22,184,84,183,128,252,9,235,199,15,128,129,138,113]},"announce":[],"urlList":[]}}