{"title":"Resplendent Registrar Manager 4.0 Final (Retail)","uid":3399587,"size":2051619,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6af01a6f905fc1375bcf71d35bc9ea4d53a311bd&amp;dn=Resplendent+Registrar+Manager+4.0+Final+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"useros","files":1,"time":1129912301,"description":"Resplendent Registrar offers a very complete and safe solution to administrators and power users for maintaining the registry on both their desktops and remote computers on their network.\n\nApart from common features, like those offered by the native Windows registry editors (regedit.exe and regedt32.exe) this program offers a solution for backing up and restoring registries, fast background search and replace, a bookmark editor with categories which supports key coloring and adding descriptions to registry keys and values, detailed property pages, tools for easy navigation. The program offers multi-level undo so all registry changes can be individually undone.\n\nWhen running on Windows XP, 2000 or NT, the software offers a registry defragmenter, a registry monitor which logs&amp;nbspl changes made to the registry by external programs as well as security editors which allow you to set access restrictions on your registry keys.\n\nTake control of your system configuration\n\nThe Windows registry is the key to all hardware and software configuration. This powerful and reliable registry manager will help you get the most out of your system.\nFor each Windows operating system, there are hundreds of registry tweaks and registry key descriptions included to help you find your way in the forest of system tweaking and optimization.\n\nPowerful and complete collection of tools\n\nResplendent Registrar includes the right collection of power tools which will do the right job in any registry editing situation.\n\nIncrease safety with a reliable registry backup system\n\nReliable registry backup and restore features will give you the security that new hardware or software installations will not become irreversible in the case of a failure.\nOn top of that, every registry operation performed with the program can be individually undone.\n\nRepair broken Windows configurations\n\nRegistry file editors allow you to edit the registry files which make up the systems registry image on disk. This feature has been a life saver to many administrators who managed to recover broken Windows installations.\n\n\nMaintain remote systems easily\n\nGet complete control of your network by using the remote features of Resplendent Registrar. Each remote registry will be opened in a separate window and will give you the same power and flexibility as on the local registry.\n\nKeep your registry clean and healthy\n\nThe registry defragmentation tool will reclaim wasted space and keep your registry running smoothly.\nThe advanced registry search, replace and delete tool will help you to find and destroy unwanted registry entries quickly.\n","torrent":{"xt":"urn:btih:6af01a6f905fc1375bcf71d35bc9ea4d53a311bd","amp;dn":"Resplendent+Registrar+Manager+4.0+Final+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af01a6f905fc1375bcf71d35bc9ea4d53a311bd","infoHashBuffer":{"type":"Buffer","data":[106,240,26,111,144,95,193,55,91,207,113,211,91,201,234,77,83,163,17,189]},"announce":[],"urlList":[]}}