{"title":"(Spirit Of) Christmas - Lies To Live By 1974","uid":3392482,"size":96453481,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b4230ae55e47b051fd9996ea502e546b457929b&amp;dn=%28Spirit+Of%29+Christmas+-+Lies+To+Live+By+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"buzzard","files":8,"time":1128518652,"description":"Christmas (Spirit Of) - Lies To Live By 1974\nBack in! Long forgotten progressive/psychedelic masterpiece from Canada, that was originally released in 1974, is really the third album by Christmas and features Reign Ghost guitarist Bob Bryden. A majestic concept album, that still sounds contemporary and vibrant with some excellent musicianship and lyrical ideas.. \n\nsize:          91.9 mb\nbitrate:      320\n\n\nChristmas (and Spirit Of Christmas)\nPersonnel:\nBOB BRYDEN \tgtr, vcls, keyb'ds \tA \tB\nROBERT BULGER \tlead gtr \tA \tB\nTYLER RAIZENNE \tbs \tA \tB\nRICH RICHTER \tdrms \tA\nHELGE RICHTER \tdrms \t\tB\nPRESTON WYNNE \tlead vcls \t\tB\n \nALBUMS:\n1(A) \tCHRISTMAS \t(Paragon 18) \t1970 R4\n2(A) \tHERITAGE \t(Daffodil 16002) \t1970 R3\n3(B) \tLIES TO LIVE BY \t(Daffodil 10047) \t1974 R2\n\nNB: (1), (2) and (3) all counterfeited on vinyl in Europe in the eighties. (2) reissued on CD (Laser's Edge LE-1009) 1993, with their first 45 as bonus tracks, and again (Unidisc AGEK 2166) with three bonus tracks. (3) also reissued on CD (Laser's Edge LE 1) 19?? and again (Unidisc AGEK 2167) 199?.  \n\nCassette:\n1.CHRISTMAS LIVE AT MASSEY HALL \t( ) \t1990\n\nNB: This limited edition cassette, made circa 1990, contains a live concert from 23rd September, 1971 in Toronto, Ontario and also both sides of the first Christmas 45 (Daffodil 1002) and the 'A' side of their last 45 (Daffodil 1056). Also on album (RTA 777) 199? R1 and on CD (Unidisc AGEK 2168) 199?.  \n\n45s:\n1.Don't Give It Away/Farewell Sweet Lovin' \t(Daffodil 1002) \t1970\n2.Point Blank/Goin' To Oklahoma \t(Daffodil 1008) \t1971\n3.I'm A Song (Sing Me)/A Part Of Our Heritage \t(Daffodil 1010) \t1971\n4.Graveyard Face/Stay Dead Lazarus \t(Daffodil 1056) \t1974\n \n\nLed by Bob Bryden, who had earlier played in the Toronto, Ontario-based Reign Ghost, Christmas played in Oshawa, Ontario, between 1970-74. In the later years they were known as Spirit Of Christmas. When they formed on Christmas Day in 1969 their average age was just 17.\n\nChristmas is best described as a progressive underground band. They were originally known as Black Christmas. The first album consists of three Bryden compositions characterized by lovely vocals and guitar work and two instrumentals composed by the whole band. One of these, the ambitious Jungle Fabulous, accounts for all of side 2. This album is their rarest artefact.\n\nHeritage consists of heavy progressive underground rock and has its moments, particularly on Zephyr Song, April Mountain, which has some fine guitar work, and the title track. All the songs on the album were written and arranged by Bryden.\n\nLies To Live By is really their finest moment and arguably one of the best albums to come out of Canada in the 1970s. Very imaginative progressive rock. Almost every track is excellent and this album is strongly recommended. \n\nREVIEW:\n&quot;Lies To Live By&quot; is essentially the 3rd album release by the Canadian band Christmas. After the release of the Heritage album, Christmas was beset with management and label problems over the direction of the band's next album. The music scene in Canada was in disarray and bands such as April Wine, The Guess Who, BTO and Chilliwack had hits with commercial hard rock songs.\nThe Heritage album was a start in the right direction and the label wanted the band to continue with hard rock but make it more &quot;radio friendly&quot;. Christmas had other ideas about where there music was heading. In 1973 a new album was recorded that was a radical change from the hard rock sound of Heritage. The album ended up being tied up in legal wrangles and was not released until 1975 when the band decided on a name change to The Spirit of Christmas to avoid legal complications associated with the &quot;Christmas&quot; name and to release the album.\nThis time out (The Spirit of) Christmas went totally towards a guitar fronted progressive sound complete with mellotron, a chamber orchestra , special effects, intricate piano work and lush backing choruses. In the similar vein of such acts as Genesis, Gentle Giant, and Yes, &quot;Lies To Live By&quot; was a total departure in sound from anything recorded by a Canadian band to date. The six songs on the album are broken into conceptual chapters each with a different theme that intertwines through out the song while half of the songs clock in at close to nine minutes or more. &quot; \nLies To Live By&quot; was an instant hit with critics and progressive music fans world wide.\nDespite the critical acclaim of the album, Daffodil Records was in trouble and the album did not receive the promotion and support it deserved. Soon after release of the album, the label folded and with it the hopes of (The Spirit of) Christmas . Now left without a label the band also decided to call it a day and broke up also.\nIn the late 80's and 90's the &quot;Lies To Live By&quot;album became a highly sought after collector's item with originals changing hands for hundreds of dollars. As a direct result of the interest in the band's early albums, Christmas reformed in the mid 1980's for a couple of local concerts. Still regarded as one of the best progressive rock albums to come out of Canada, this release by Unidisc is a straight reissue of the original album at a budget price complete with original artwork but unfortunately it contains no bonus tracks.\n(By Keith Pettipas. CanEHdian.com, 2000) \n\n[IMG]http://img77.imageshack.us/img77/2594/cover6ua.jpg[/IMG]\n\nTrack Title\t\n1. All The Wrong Roads\t \n2. Stay Dead Lazarus\t \n3. Voice In The Wilderness\t \n4. War Story\t \n5. Factory\t \n6. Beyond The Fields We Know\nBob Bryden (vcls,gtr), Robert Bulger (ld gtr), Tyler Raizenne (bs), Helge Rich Richter (drms), Preston Wynn (vcls, clvs,gtr)\n","torrent":{"xt":"urn:btih:6b4230ae55e47b051fd9996ea502e546b457929b","amp;dn":"%28Spirit+Of%29+Christmas+-+Lies+To+Live+By+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b4230ae55e47b051fd9996ea502e546b457929b","infoHashBuffer":{"type":"Buffer","data":[107,66,48,174,85,228,123,5,31,217,153,110,165,2,229,70,180,87,146,155]},"announce":[],"urlList":[]}}