{"title":"911 - Evidence to the Contrary REDUX 2006","uid":3432662,"size":201658278,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:6ccf48ec3ec0ac03b5059d359f3633edd231bc92&amp;dn=911+-+Evidence+to+the+Contrary+REDUX+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1137481514,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from users named &quot;b2pilot187&quot; and &quot;transcout&quot; (they're probably the same person). Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; (and now &quot;Alex Jones&quot; too) and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\n\ngsfjr77 wrote &quot;It is a new year and many new developments have occurred in the unfolding case for September 11.\n\nSeptember 11: Evidence to the Contrary REDUX 2006 is the film that brings it all together.\n\nWith an all new intro featuring Tucker Carlson and The Lone Gunman Pilot, this video promises to deliver the case. Included in this video is the meat of &quot;Are the Criminals frightened&quot;, &quot;Loose Change 2E&quot;, &quot;911 Eyewitness&quot;, and &quot;Martial Law 911&quot;, broken up with commercials from Reopen911.org and the news clip from FOX that featured &quot;Loose Change 2E&quot;.\n\nWith all new music by Paul Oakenfold.\n\nYou will find that the information contained in this is a superior compilation of 911 evidence that the buildings had explosives in them. This 86:24min video is a great intro for anyone seeking answers about that day.\n\nSHARE THIS FILM.\n\nMore to come... Spread the TRUTH.....KEEP ON SEEDIN'!!!\n\n[THANK YOU ConCen FOR HOSTING THIS TORRENT]\nSEEDED and PRODUCED BY THE LONE LANTERN SOCIETY\n[ www.lonelantern.org ]\n\nTime (duration): 86:24\nNumber of files: 1\nFile size: 192MB\nVideo codec: WMV\nAudio codec: ?\nResolution: ?\nRipper/Encoder (if known) Lone Lantern\nSource (if known, ie: VHS, DVD, TV) Truth&quot;","torrent":{"xt":"urn:btih:6ccf48ec3ec0ac03b5059d359f3633edd231bc92","amp;dn":"911+-+Evidence+to+the+Contrary+REDUX+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ccf48ec3ec0ac03b5059d359f3633edd231bc92","infoHashBuffer":{"type":"Buffer","data":[108,207,72,236,62,192,172,3,181,5,157,53,159,54,51,237,210,49,188,146]},"announce":[],"urlList":[]}}