{"title":"Hoagland's Mars (Vol. 3) - The Moon and Mars Connection (1994)","uid":3376509,"size":1519562076,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6cd3d0eb464d23127d7663cfaa09a842dcc806aa&amp;dn=Hoagland%5C%27s+Mars+%28Vol.+3%29+-+The+Moon+and+Mars+Connection+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":2,"time":1125366497,"description":"On June 2, 1994 at Ohio State University, Richard C. Hoagland presented publicly for the first time the results of his (then) 2-year &quot;lunar extension of the independent Mars Investigation&quot; -- using NASA's own images from the Lunar Orbiter, Surveyor and Apollo missions to the Moon. Armed with dramatic new advances in current computerized technology brought about by the Space Program itself, Hoagland reveals in this video the official images that, over thirty years ago, captured the stunning, light reflecting remnants of an apparent, ancient lunar dome -- stretching over &quot;Sinus Medii,&quot; the dark &quot;sea&quot; located in the center of the full Moon.\n\nThis computerized analysis has also revealed scores of additional features now only explainable by some kind of &quot;intelligent design,&quot; including: a &quot;tetrahedral&quot; light pattern attributable to structural remains still present in the floor of the crater Ukert; a complex of identically sized, precisely aligned, impossible &quot;double craters&quot; caught on the highly eroded floor of the crater Murchison (now strongly suspected to be the actual footings of the north-western edge of this &quot;Sinus Medii dome&quot;); to say nothing of a one and a half mile tall, glass-like, &quot;geometric shard&quot; photographed by an unmanned Lunar Orbiter in 1967, casting an imposing shadow out across the horizon of Moon. This, and a host of other, equally inexplicable &quot;artifacts&quot; discovered on these official lunar photographs unexplainable by any known geology or photographic process increasingly demonstrate to one and all the reality of artificial constructs on the Moon which NASA apparently &quot;forgot&quot; to tell us.\n\nGenre: Lecture \nVideo Codec: DivX 5 \nVideo: ~ 998 kbit/s\nRuntime: 177 Min. \nAudio Format: ~128 kbit/s MP3 VBR  \nFrame Size: 640x464 \nFramerate: 29,970 fps \nLanguage: English","torrent":{"xt":"urn:btih:6cd3d0eb464d23127d7663cfaa09a842dcc806aa","amp;dn":"Hoagland%5C%27s+Mars+%28Vol.+3%29+-+The+Moon+and+Mars+Connection+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd3d0eb464d23127d7663cfaa09a842dcc806aa","infoHashBuffer":{"type":"Buffer","data":[108,211,208,235,70,77,35,18,125,118,99,207,170,9,168,66,220,200,6,170]},"announce":[],"urlList":[]}}