{"title":"HBO Real Time with Bill Maher: Episode 61, Sept 23 - 59min MP4","uid":3389190,"size":40610210,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6da760b886780c10f0c5281cb47b45592b3dc260&amp;dn=HBO+Real+Time+with+Bill+Maher%3A+Episode+61%2C+Sept+23+-+59min+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tilt-a-whirl","files":1,"time":1127899671,"description":"Recorded on ATi 9600 Pro AIW to .mpg, then encoded to .mp4 with Nero Digital\nProfile: Mobile AVC\nAudio: LC AAC - 40kbit/s\nRunning time: 56min 58sec\nNote:  I figured a show like this isn't really appreciated for it's visuals anyway so I'd just try and make it as small as possible.  Let me know if you could see any reason to make it a bigger (higher quality) file.\n\nEpisode 61\nPremiered September 23, 2005\nGuests: Willie Nelson, Rep. David Dreier, Christopher Hitchens, Katty Kay, George Galloway, Andrea Mitchell\n\n\nOn Hurricane Rita\n\n&quot;There is another storm now, as you know, Rita, about to devastate the Gulf Region again. President Bush said our prayers go out, to the executives at Chevron.&quot; ? Bill Maher\n\n\nOn Vice President Cheney\n\n&quot;The other event that has people on edge this weekend, Vice President Cheney will undergo surgery for an aneurysm. And while he is under anesthetic, a man named George Bush will be in charge.&quot; ? Bill Maher\n\n\nOn the Jet Blue Emergency Landing\n\n&quot;We had a little disaster excitement ourselves here: The Jet Blue Airliners. An airliner full of passengers had to make an emergency landing because the landing gear got stuck, and the irony is, the crew said it could easily have been fixed if someone on board just had a pocketknife.&quot; ? Bill Maher\n\n\nOn Foreign Oil Dependency\n\n&quot;We have two cars, my wife and I, that run on vegetable oil. She has a Volkswagen. I have a Mercedes. They've never had anything in them expect 100% vegetable oil. Our bus is run on 100% soybeans. So there's no reason for us to be so dependent on foreign energy.&quot; ? Willie Nelson\n\n\nOn Margaret Thatcher\n\n&quot;In the 20 years or so I've been in the House of Commons, by far the best performer at Prime Minister's Questions, was Mrs. Thatcher, who more than half of the country hated. But she could wipe the floor with the opposition leader before breakfast.&quot; ? George Galloway\n\n\nON American Leadership\n\n&quot;In this country, a smart leader is suspect. That's just the way it is. Even George Bush's father, who was a lot smarter than the son, had to sort of prove that he wasn't that bright.&quot; ? Bill Maher\n\n\nOn Critiquing the U.S.\n\n&quot;We're not running our country down when we criticize it. We're trying to make it better.&quot; ? Bill Maher\n\n\nON GEORGE BUSH\n\n&quot;His eyes are so close together he could use a monocle.&quot; ? Christopher Hitchens\n\n&quot;Christians believe in the Prophets, peace be upon them. Bush believes in the profits and how to get a piece of them.&quot; ? George Galloway\n__________________________________\n\n\nThis is just an expirement to see if there's any interest in these.  If you like it, seed it.  It's not that big.  Comments welcome.","torrent":{"xt":"urn:btih:6da760b886780c10f0c5281cb47b45592b3dc260","amp;dn":"HBO+Real+Time+with+Bill+Maher%3A+Episode+61%2C+Sept+23+-+59min+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da760b886780c10f0c5281cb47b45592b3dc260","infoHashBuffer":{"type":"Buffer","data":[109,167,96,184,134,120,12,16,240,197,40,28,180,123,69,89,43,61,194,96]},"announce":[],"urlList":[]}}