{"title":"Desmond Child - Discipline","uid":3376056,"size":75698176,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e6425d4cd774cf7a3269413a1b232edb6817187&amp;dn=Desmond+Child+-+Discipline&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Alocacoc","files":10,"time":1125274328,"description":"DESMOND CHILD\n\nDISCIPLINE\n1991\n\nTRACK LISTING\n1. The Price Of Lovin' You\n2. Discipline\n3. I Don't Know Wanna Be Your Friend\n4. Love On A Rooftop\n5. You're The Story Of My Life\n6. According To The Gospel Of Love\n7. Do Me Right\n8. Obsession\n9. The Gift Of Love\n10. A Ray Of Hope\n\nRockdetector Biography\n\nFormer DESMOND CHILD AND ROUGE maestro DESMOND CHILD, having re-emerged as a serious songwriter thanks to his continued friendship with KISS' PAUL STANLEY and the brace of songs he co-wrote for the New York outfit's 'Animalize' album continued the relationship on the subsequent KISS album, 'Asylum', in 1985. This time DESMOND CHILD co-penned a mammoth five tracks, including 'Uh! All Night' and 'Who Wants To Be Lonely'.\n\nChild continued to work with KISS on the 'Crazy Nights' record and also co-penned both previously unreleased songs on the 'Smashes, Thrashes And Hits' compilation album. But it was to be his link-up with BON JOVI's JON BON JOVI and RICHIE SAMBORA in 1986 that would push the man's name into the limelight as the trio co-wrote 'You Give Love A Bad Name' and 'Livin' On A Prayer' for the 'Slippery When Wet' album in 1986.\n\nThe success of the BON JOVI material led to Child becoming an in-demand 'song doctor'. AEROSMITH worked with the man on the 'Permanent Vacation' album and Child's input led to the veteran Boston band scoring huge chart hits with 'Dude (Looks Like A Lady)' and 'Angel'.\n\nChild would continue to work with both AEROSMITH and BON JOVI on their ensuing 'Pump' and 'New Jersey' albums respectively and would also work on resurrecting CHER's career with contributions to her Geffen album 'Cher'. One of the songs the singer / actress recorded for the album was a cover of DESMOND CHILD &amp; ROUGE's 'Main Man'.\n\nwork continued at a prolific rate, his name appearing in the credits on material recorded by JOHN WAITE, JIMMY BARNES, JENNIFER RUSH, BILLY SQUIER, MICHAEL BOLTON, BONNIE TYLER, ROBIN BECK and even ALICE COOPER.\n\nChild was heavily involved in the soundtrack album for the Wes Craven movie 'Shocker'. Not only did he produce MEGADETH's cover of ALICE COOPER's 'No More Mr. Nice Guy', Desmond even performed on the album himself, taking a place in the studio band dubbed the DUDES OF WRATH alongside the likes of PAUL STANLEY.\nOther production/writing work included SOUTHGANG's 'Tainted Angel', RATT's 'Detonator' and KANE ROBERTS' second solo outing. Often, as with RATT, Child would work under the pseudonym of Sir Arthur Payson.\n\nElektra offered Child a solo deal and Desmond couldn't resist the opportunity to record his own album. 'Discipline' subsequently involved a huge cast of characters that included playing and writing contributions from RICHIE SAMBORA alongside bandmate Tico Torres, TOTO's STEVE LUKATHER, DEF LEPPARD's Vivian Campbell, KANE ROBERTS, JOAN JETT and the ROUGE girls.\n\nWhilst Child has maintained a songwriting partnership with the likes of BON JOVI and AEROSMITH, more recently the man has written with British Pop sensation ROBBIE WILLIAMS and amazed fans with a co-write on DREAM THEATER's 'Falling Into Infinity' album.\n","torrent":{"xt":"urn:btih:6e6425d4cd774cf7a3269413a1b232edb6817187","amp;dn":"Desmond+Child+-+Discipline","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6425d4cd774cf7a3269413a1b232edb6817187","infoHashBuffer":{"type":"Buffer","data":[110,100,37,212,205,119,76,247,163,38,148,19,161,178,50,237,182,129,113,135]},"announce":[],"urlList":[]}}