{"title":"Dominion Tank Police Manga (1986) (Masamune Shirow) [ENGLISH]","uid":3270822,"size":29526938,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:6eb20f89ed098039a89a3a2ea3a0957c6cb42fb2&amp;dn=Dominion+Tank+Police+Manga+%281986%29+%28Masamune+Shirow%29+%5BENGLISH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"eez","files":4,"time":1104474911,"description":"&lt;img src=&quot;http://img132.exs.cx/img132/7691/dominionmangathcrmx8ee.jpg&quot; alt=&quot;Image Hosted by \nImageShack.us&quot; /&gt;\n\n&lt;B&gt;This is the original Masamune Shirow manga, Dominion (1986), in English. &lt;/B&gt; Description from &lt;URL&gt;http://www.geocities.com/Tokyo/Towers/1073/dominion.htm&lt;/URL&gt;: Masamune Shirow on Dominion Passages taken from Intron Depot 1 Â©1991 Shirow/Seishinsha  Of all of Masamune Shirow's policewoman series, Dominion is by far the lightest and least serious, despite that brooding title. It's a short story, only one volume in all, that first ran in Hakusensha Publishing's dearly departed magazine Comi Comi. The short temper and Type A personality of police tank commander Leona Ozaki and the daily events of her Newport Police Station (Hyogo Prefecture, Shinhama City) are depicted in loving slapstick (fortunately there isn't area unit like this in Japan). Shinhama City and Newport Ward don't really exist. In theory they're part of an imaginary artificial island called Waterfront floating off the coast of Hyogo Prefecture near Kobe. It seems Waterfront is a long construction stretching as far as the Kii Peninsula. One interesting thing about it is that it doesn't go all the way to the ocean floor -- it floats above it.  The centerpiece of Dominion was the pocket tank Bonaparte T-1, virtually an extension of Leona herself. Bonaparte's name was meant to be a take-off on both &quot;Napoleon&quot; and the Japanese pronunciation of the German &quot;Leopard&quot; tank. The driver lay almost prone on the bottom armor of the hull, with Leona's seat covering him like a tortoise shell. Small as it was, it weighted a good five tons, and the treads could leave any road in serious need of repair. Bonaparte fired a variety of stun and gas canisters. However, Leona always kept three illicit high-velocity AP rounds in a special &quot;good luck&quot; bag at her feet.  I should mention that all four videos were original stories written by the animation staff and differ a bit from my own Dominion universe. Not to worry -- if it's interesting, what more can you ask? (Actually, I liked their Brenten a lot).  These scans are in *.gif format with the average resolution being 680x1000.","torrent":{"xt":"urn:btih:6eb20f89ed098039a89a3a2ea3a0957c6cb42fb2","amp;dn":"Dominion+Tank+Police+Manga+%281986%29+%28Masamune+Shirow%29+%5BENGLISH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eb20f89ed098039a89a3a2ea3a0957c6cb42fb2","infoHashBuffer":{"type":"Buffer","data":[110,178,15,137,237,9,128,57,168,154,58,46,163,160,149,124,108,180,47,178]},"announce":[],"urlList":[]}}