{"title":"Dragon NaturallySpeaking V8","uid":3294396,"size":692362718,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6f0a46b07589ca3bef99830e8ff63d403a8d2b04&amp;dn=Dragon+NaturallySpeaking+V8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cully","files":2,"time":1109225771,"description":"Dragon NaturallySpeaking V8\n[img]http://www.scansoft.com/images/dns8_promofront.jpg[/img]\n\nWhat's New in 8\n\nDragon NaturallySpeaking 8's record breaking accuracy improvements make using speech recognition easier than ever before. Version 8 also includes powerful command creation features, allowing the software to meet the needs of any user. Complete mobility is available through the most popular handheld devices, including more digital recorders and PDAs. Plus, Dragon NaturallySpeaking 8 fully supports enterprise deployments, from a native MSI installer to complete workstation roaming. Whether you're looking to reduce transcription costs, use a PC hands free, create documents faster or just have more fun with your PC, Dragon NaturallySpeaking 8 is the product for you.\n\n    * A Breakthrough In Accuracy\n      Expanded language models and improved acoustic training techniques deliver up to 99% accuracy. Dragon NaturallySpeaking 8 boasts one of the largest accuracy increase of any release in the history of Dragon NaturallySpeaking.\n\n    * Enterprise Ready\n      Dragon NaturallySpeaking 8 makes your user profile available anywhere on the network, and automatically synchronizes updates and adaptations centrally. Use the new Native MSI Installer to install Dragon NaturallySpeaking through a network to multiple client machines.\n\n    * Support For More Devices\n      Now you can dictate into a Palm Tungsten, as well as a digital recorder or Pocket PC, and have your recording transcribed by Dragon NaturallySpeaking 8 when you synch with your PC.\n\n    * Instant Formatting\n      With Smart Formatting, you can specify how Dragon NaturallySpeaking formats dates, measurements and acronyms to meet your requirements. You can even establish the specific configuration of any word, such as capitalization or spacing.\n\n    * Improved Commands\n      With Smart Text &amp;amp; Graphics Shortcuts, you can instantly fill out entire templates with unique information. And with Smart Commands, you can change the action of a voice command depending on the location of the cursor.\n\n    * Custom Vocabulary Tools\n      The simplified Vocabulary Builder makes customizing your vocabulary faster, easier, and more powerful. And an improved Vocabulary Editor makes it easier than ever before to fine tune custom vocabularies.\n\n    * Easier to Use with a Handheld Device\n      With Multiple Acoustics you can now use a single vocabulary for your microphone and handheld device profiles.\n\n\ninfo @ hxxp://www.scansoft.com/naturallyspeaking/","torrent":{"xt":"urn:btih:6f0a46b07589ca3bef99830e8ff63d403a8d2b04","amp;dn":"Dragon+NaturallySpeaking+V8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f0a46b07589ca3bef99830e8ff63d403a8d2b04","infoHashBuffer":{"type":"Buffer","data":[111,10,70,176,117,137,202,59,239,153,131,14,143,246,61,64,58,141,43,4]},"announce":[],"urlList":[]}}