{"title":"WE8I PC, Eddie Crow's World Cup Patch","uid":3375780,"size":249528879,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f1701f9c82f72b40c1ec1d3bba7e7bab270f20c&amp;dn=WE8I+PC%2C+Eddie+Crow%5C%27s+World+Cup+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WolfHook","files":1,"time":1125187547,"description":"WORLD CUP 1930-2006 &quot;ALL TIME BEST&quot; by EddieCrow\n\n\nCOVER:\n\n\nPLATAFORMS:\nWE8I PC     - Released\nPES4 PC     - Released\nWE8I XBOX - Released\nWE8LE PS2  - Released\n\nIMPORTANT:\n-This patch does NOT contain the Master League.  With the objective of incorporating more than 3000 new players and reordering the entire database to input more than 150 newly created teams, all of its players were independently redesigned, including those of the Master League.  As a result this section of the game has been disabled. \n\n-This patch is fully a classic and legendary alternative to the original.  Furthermore, because of the global reach of its contents, all text files are in English\n\nCONCEPT:\n-To take full control of the All-Time Greatest in a head to head match and determine once and for all which team is the best in World Cup history.  Will it be Brazil 1970, England 1966 or Italy 1938?  How about those heavily favorites who lost like Brazil 1958, 1982, 1998, Hungary 1938 &amp; 1954, Holland 1978 or Italy 1990?  Better yet, take the underdogs who shocked the world with their triumphs like Uruguay 1950 and France 1998 and see if they duplicate their feat.  Only you will determine the outcome.\n\nSTRUCTURE:\n\n-All 57 National Teams currently in the fight for a spot in the 2006 World Cup, with the most current rosters, kits, lineups, appearances and updated shoe packs\n\n- The 103 World Cup squads that made history by placing in the top 4 places from 1930 to 1982, the first 6 places from 1986, first 10 places from 1994 and 1998 and the first 20 of 2002.  Consequently, with this concept there was not enough room to import other legendary squads.  However, the 6 spaces in the preset Classic Teams were utilized to import those legendary teams like Spain 34, Peru &amp; Mexico 70, Denmark and Spain 1986, Cameroon and Colombia 1990.\n\n- The 30 most important clubs in the history of the sport.  Being such a polemic topic, clubs were decided upon based not only in local and tournament and league accomplishments, but also Champions League, Copa Libertadores, and Intercontinental Cup feats.  In addition, these clubs include the most important players of each era.\n \n-Finally, the 12 most important teams in the history of Mexican Professional Soccer, with its concept of induction based on historical clubs, champion of champions, dynasties, and legendary squads.\n\n\n\nThis patch is an original creation of one person.  Therefore, the selection of teams was a personal decision based on the aforementioned criteria.  Many more teams were worthy of inclusion, but the pre-existing space/data limitations of the game make us seem apparently unjust.\n\nFEATURES:\n\n-All teams have lineups and formations authentically consistent with their times, thus avoiding a mixture of players of different eras on the same team.\n\n-More than 800 new kits for all each and every team with correct number type and neck definitions.\n\n\n\n-Classic boots of each era specifically assigned to all players in the game.\n\n\n\n-Newly created Faces for the most important players in history and updated for each era.\n\n\n\n-Corresponding banners and flags to each and every team.\n\n-Redesigned stadiums to accurately depict those of every World Cup Final, from 1930-2006 with the correct names.  Updated club stadiums also included.\n\n\n\n-Classic referee kits and the creation of Pierluigi Collina.\n\n-Correct call names for every team\n\n-Official Balls from every World Cup since 1970.\n\n\n\n- In-game music tailored to bring World Cup nostalgia and other popular soccer themes.\n\n- Trophy girl outfits were transformed and a few Mexican Surprises are included:  Galilea Montijo and Mar Castro, the celebrated ?Ms Chiquitibum?.\n\nCREDITS:\n\nSome elements that make up this patch were obtained from sites like WEmexico, WEmaniacs, Evo-Web, PESsoccerworld, Socceraccess, Dekazeta, Pro-Edit, Poroevolutionsoccer, WinningEleven, WEbrasil, Frenchevolution, PESinsight, PESfan, Soccergaming, WEman, Edgegaming, WEkel and WEshareit.\nDue to the magnitude of this project, it is difficult for me to mention each and every one of the creators who published their works in the aforementioned sites.  Therefore, as to not make anyone who contributed feel left out, let this patch be a tribute to all, with my sincere respect and admiration for your enormous talent.\n\nSpecial Shout Outs:\nMauras, Joseguiri, Ikedarkk and Bebeto, whose Published patches conformed the idea to launch this audacious project.\nAnd to the spontaneous and direct cooperation of those who kindly extended their help:\nBruno and Alejandro Casillas,\nJuNior, Calymantemoc,Daragon and Futix76\n\nSPECIAL THANKS TO:\nCalymantemoc for his support and the cumbersome conversion to PS2\nJuNior for his conversion to X Box\nWEmexico for their hosting and patience.\nONCE for his talent and Cover Designs.\nAnd finally Futix76, for his patience, interest, and splendid screenshots, audio and video.\nWolf_Hook for uploading the torrent.","torrent":{"xt":"urn:btih:6f1701f9c82f72b40c1ec1d3bba7e7bab270f20c","amp;dn":"WE8I+PC%2C+Eddie+Crow%5C%27s+World+Cup+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1701f9c82f72b40c1ec1d3bba7e7bab270f20c","infoHashBuffer":{"type":"Buffer","data":[111,23,1,249,200,47,114,180,12,30,193,211,187,167,231,186,178,112,242,12]},"announce":[],"urlList":[]}}