{"title":"Il Baricentro - Sconcerto (Italian JazzProg 1976 debut)(256)","uid":3307247,"size":80590838,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f6304cd1352c885cf80ef66d7de187db6a3387c&amp;dn=Il+Baricentro+-+Sconcerto+%28Italian+JazzProg+1976+debut%29%28256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brainticket","files":10,"time":1111915336,"description":"&amp;quot;Coming from the ashes of Festa Mobile this band from Bari (where their name comes from) and based in Rome chose a very different musical style, concentrating on an instrumental jazz-rock that was very popular in Italy during the mid/late 70's.\n\nBoth their albums, released by EMI in 1976 and 1978, show strong influences by the likes of Weather Report or Mahavishnu Orchestra, mixed with a mediterranean feel that's more evident in Trusciant [their second album-brainticket]. \n\nAfter the second album the group disbanded, and reformed for a short while as a trio in 1983-84 with a disco-inclined self produced single. Brothers Boccuzzi have not left the music, still playing as sessionmen.&amp;quot;-IP\n\n\nKeyboard dominated jazz prog, rather light-weight, which can often stray into a funk territory of its own kind (you can hear the seeds of their 80s disco single, I'm sure). The drummer and bassist are really skilled here and provide a tight, but mobile, backbone, I think, but I can imagine they were really overlooked due to the brothers on dual keyboards. Admittedly, I wasn't crazy about this album at first but it grew on me over time and I think it is well worth adding to a collection even if it isn't one of the frequent listens. \n\nApparently the original vinyl is still rather common and cheap in Italy...?\n\nEnjoy!\n\nBrainticket","torrent":{"xt":"urn:btih:6f6304cd1352c885cf80ef66d7de187db6a3387c","amp;dn":"Il+Baricentro+-+Sconcerto+%28Italian+JazzProg+1976+debut%29%28256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6304cd1352c885cf80ef66d7de187db6a3387c","infoHashBuffer":{"type":"Buffer","data":[111,99,4,205,19,82,200,133,207,128,239,102,215,222,24,125,182,163,56,124]},"announce":[],"urlList":[]}}