{"title":"Ps2-Prince of Persia - The Two Thrones by. polakÂ© a.K.a smash83Â©","uid":3422207,"size":2666326665,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:702298eb09b1ad1253beeedd79d6aed260d7898b&amp;dn=Ps2-Prince+of+Persia+-+The+Two+Thrones+by.+polak%C2%A9+a.K.a+smash83%C2%A9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polakÃ‚Â©","files":1,"time":1134936767,"description":"m dritten Abenteuer des mutigen Prinzen kommt's ganz dick: verw&amp;uuml;stete Stadt, verkehrte Zeit und b&amp;ouml;ser Zwilling.\n\nHerausgeber: Ubisoft\nEntwickler: UbiSoft\nErh&amp;auml;ltlich ab: Sofort\n\nEin weiteres Jahr ist seit dem letzten k&amp;ouml;niglichen Auftritt durch die Sanduhr gelaufen und schon ist der persische Prinz wieder da. Nachdem er sich in &quot;Prince of Persia: Warrior Within&quot; von seiner dunkleren Seite gezeigt und dabei seine Zukunft gerettet hat, kehrt der Thronanw&amp;auml;rter jetzt mit der vollbusigen &quot;Empress of Time&quot; nach Babylon zur&amp;uuml;ck. Allerdings bleibt sein Einfluss auf die Zeit nicht ungestraft: Seine Heimat ist niedergebrannt und sein alter Widersacher, der Wesir, ist wieder auferstanden.\n\nEs dauert nicht lange, bis der verschlagene Berater die Macht des Dolchs der Zeit freigesetzt hat - wieder mal. Und dem PoP bleibt nichts anderes &amp;uuml;brig, als die Welt zu retten - wieder mal. Aber diesmal ist er nicht allein.\n\nEin Zwilling kommt selten allein\n\nDas Herumpfuschen an der Zeit hat einen weiteren Prinzen hervorgebracht. Dieser steht unter Sands-Einfluss und ist eine Sandkreatur genau wie der Herr Papa aus dem Original &quot;PoP: The Sands of Time&quot;. Die meiste Zeit des Spiels ist der dunkle Prinz (so nennt man den Guten) nur eine arrogante Stimme im Kopf unseres langhaarigen Helden. Doch an manchen Stellen gewinnt er die Oberhand und ruft eine k&amp;ouml;rperliche Ver&amp;auml;nderung beim S&amp;auml;belrassler hervor, um ihm bei seiner Aufgabe zu helfen. Oder verfolgt er weit sch&amp;auml;ndlichere Pl&amp;auml;ne?\n\nDer liebreizende Prinz wartet mit den bekannten Bewegungsabfolgen auf. Er kann W&amp;auml;nde entlangrennen, Vorspr&amp;uuml;nge erklimmen, an Pf&amp;auml;hlen baumeln, &amp;uuml;ber schmale Balken balancieren und sich sowieso &amp;auml;u&amp;szlig;erst gekonnt durch die L&amp;uuml;fte schwingen. Au&amp;szlig;erdem kann er diagonale Mauerspr&amp;uuml;nge hinlegen, sich &amp;agrave; la Sam Fisher durch enge Spalten zw&amp;auml;ngen und kopf&amp;uuml;ber an Seilen herunterrutschen.\n\nWie schon in &quot;Warrior Within&quot; ist der Prinz mit dem Dolch der Zeit ausgestattet. In der anderen Hand hat er jeweils anderweitige Waffen, die so rumliegen. Das adlige Kampfsystem geht flie&amp;szlig;end und ballettgleich vonstatten. Allerdings k&amp;ouml;nnen wir uns des Eindrucks nicht erwehren, dass es in dieser Ausgabe ein wenig langsamer und stockender abl&amp;auml;uft als bei den Vorg&amp;auml;ngerspielen.\n\nGut geschlichen ist halb gewonnen\n\nIn den ersten beiden Spielen fehlte es ein wenig an Stealth. In &quot;The Two Thrones&quot; gibt es nun massig davon. Kann sich der Prinz ohne gesehen zu werden an einen Gegner heranschleichen, musst du nur noch fix auf die Tasten hauen. So kannst du erfolgreich und vor allem leise einen oder gleich mehrere Gegner ausschalten. Verbockst du die Aktion, wird deine Attacke abgeblockt und du wirst zu Boden geworfen, bevor du dich deinem Gegen&amp;uuml;ber stellen musst. Das passiert hin und wieder, denn die Kamera h&amp;auml;lt nicht immer mit dir Schritt. Du musst allerdings den im entscheidenden Moment aufleuchtenden Dolch sehen, um erfolgreich anzugreifen.\n\nGelingt dir das Anschleichen, wirst du mit einer wunderbar animierten Szene belohnt. Das geht weit &amp;uuml;ber das Schleichen im &quot;Splinter Cell&quot;-Stil hinaus. W&amp;auml;hrend diesen Tempoaktionen zur Gegnerbeseitigung kannst du an einer Br&amp;uuml;stung h&amp;auml;ngen, nach einem langen Mauersprung in der Luft schweben oder sogar kopf&amp;uuml;ber an einer Kette h&amp;auml;ngen.\n\nDie f&amp;uuml;r den Prinzen typischen Zeitmanipulationskr&amp;auml;fte wie &quot;Recall&quot; (Zur&amp;uuml;ckdrehen der Zeit) und &quot;Eye of the Storm&quot; (Verlangsamen des Geschehens) sind auch wieder mit von der Partie. Aber sie scheinen weniger wichtig, da die t&amp;ouml;dlichen Angriffe aus dem Hinterhalt die meiste Aufmerksamkeit verlangen.\n\nAuf die Pl&amp;auml;tze, fertig, tot\n\nDie Spielsequenzen als dunkler Prinz bringen nur bedingt Freude. Einerseits sieht er ziemlich cool aus mit seiner Klingenkette, die du als Waffe oder Enterhaken (Ratchet l&amp;auml;sst gr&amp;uuml;&amp;szlig;en) f&amp;uuml;r schwer zug&amp;auml;ngliche Gebiete nutzen kannst. Andererseits wirkt sich die Verwandlung stets negativ auf die Gesundheit des Prinzen aus und bringt daher Zeitbeschr&amp;auml;nkungen mit sich. Diese obligatorischen Sequenzen gegen die Uhr k&amp;ouml;nnen schnell frustrierend und nervt&amp;ouml;tend werden und sie schm&amp;auml;lern die ansonsten elegante Platform-Action des restlichen Spiels (und seiner Vorg&amp;auml;nger). Wenn uns nach Zeitrennen zu Mute gewesen w&amp;auml;re, h&amp;auml;tten wir WRC gespielt!\n\nZusammenfassend l&amp;auml;sst sich sagen, dass &quot;The Two Thrones&quot; im Vergleich zum wundersch&amp;ouml;n produzierten &quot;Sands of Time&quot; und dem fantastischen &quot;Warrior Within&quot; eher schlecht abschneidet. Die Genialit&amp;auml;t der vorherigen Spiele wird einfach nicht mehr erreicht. Trotzdem l&amp;auml;sst &quot;The Two Thrones&quot; das eine oder andere Action Adventure alt aussehen. Nicht schlecht, aber eben nicht &quot;Sands of Time&quot;.","torrent":{"xt":"urn:btih:702298eb09b1ad1253beeedd79d6aed260d7898b","amp;dn":"Ps2-Prince+of+Persia+-+The+Two+Thrones+by.+polak%C2%A9+a.K.a+smash83%C2%A9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702298eb09b1ad1253beeedd79d6aed260d7898b","infoHashBuffer":{"type":"Buffer","data":[112,34,152,235,9,177,173,18,83,190,238,221,121,214,174,210,96,215,137,139]},"announce":[],"urlList":[]}}