{"title":"Silent Hunter III [DVD][Multilingual EN - DE]","uid":3304974,"size":1795713478,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7057b0df85225e97b25d2ebbd4e35e66bc8497fc&amp;dn=Silent+Hunter+III+%5BDVD%5D%5BMultilingual+EN+-+DE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":4,"time":1111450559,"description":"Command the cunning and deadly U-boats of the North Atlantic and experience\n  the tension-filled atmosphere of a WWII submarine movie. The king of\n  submarine simulations returns with an all-new 3D game engine, new crew\n  command features, and more realistic action than ever before. The game\n  includes a career campaign, patrols that have both single and historical\n  missions, a mission editor, and multiplayer feature. Whether it's stalking\n  destroyers or hiding from depth charges, players will experience their own\n  personal war story. The spectacular graphics, multiplayer options and\n  suspenseful gameplay combine to create the most impressive submarine\n  simulation ever. \n  \n  Features: \n\n  * Command your crew. The crew will take orders and evolve based on the\n    results of each patrol. Commanders must consider morale and fatigue\n    in decision making. A reward system will advance rank, elevate skills,\n    and bestow medals for achievement. \n    \n  * Realistic and immersive environment. Spectacular 3D water modelling,\n    day/night cycles, realistic weather, historically accurate subs, ships,\n    and aircraft, detailed U-boat interiors, and engaging audio represent\n    the ultimate in WWII submarine warfare. \n    \n  * Accessible to players of all skill levels. Includes a 3D interface - \n    what you see is what you use. Players will experience a simplified \n    learning curve that will be easier to handle than standard simulations.\n    Use the naval academy tutorial to learn the basics. Customize the\n    realism settings for play that appeals to a variety of WWII combat fans.\n     \n  * A deadly array of U-boats and weapons. Playable U-boats include type II,\n    VII, IX, and XXI type submarines. Take aim against Allied convoys and\n    battleships. In recreating the great submarine battles of WWII, players\n    will hide in silence just below powerful ships, fire deadly torpedoes,\n    or surface and pound enemy aircraft with the deck gun. \n    \n  * Multiplayer with both cooperative and competitive modes. Join a wolfpack\n    with other live players and take aim against intelligent AI-controlled\n    opponents. Test your skills against other players to determine the ace \n    commander. \n\n","torrent":{"xt":"urn:btih:7057b0df85225e97b25d2ebbd4e35e66bc8497fc","amp;dn":"Silent+Hunter+III+%5BDVD%5D%5BMultilingual+EN+-+DE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7057b0df85225e97b25d2ebbd4e35e66bc8497fc","infoHashBuffer":{"type":"Buffer","data":[112,87,176,223,133,34,94,151,178,93,46,187,212,227,94,102,188,132,151,252]},"announce":[],"urlList":[]}}