{"title":"Boogeyman DVD XViD MP3 SCREENER","uid":3396477,"size":727698100,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70603ee855cf56aae764e830352bf91d02a84f17&amp;dn=Boogeyman+DVD+XViD+MP3+SCREENER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Divxtotal.CoM","files":3,"time":1129321432,"description":"A primera vista, Tim (Barry Watson) es un veintea&amp;ntilde;ero normal y corriente. Tiene un trabajo aceptable y avanza con rapidez en su relaci&amp;oacute;n con su novia Jessica (Tory Mussett). Pero un miedo intenso que le ha estado atemorizando desde su ni&amp;ntilde;ez lo atormenta. Y aumenta d&amp;iacute;a a d&amp;iacute;a. Cuando Tim ten&amp;iacute;a ocho a&amp;ntilde;os todas las noches su padre le contaba un cuento. Muchas de aquellas historias estaban al borde del terror pero Tim y su padre se aseguraban de que el dormitorio estuviera seguro antes de apagar la luz. Hasta aquella fat&amp;iacute;dica noche. Mientras Tim observaba desde la cama, paralizado por el miedo, su padre fue violentamente absorbido por el armario y ya nunca m&amp;aacute;s volvieron a verlo ni a saber de &amp;eacute;l. A Tim le aterroriza que alg&amp;uacute;n d&amp;iacute;a vuelva el 'Boogeyman' y se lo lleve, como antes se ha llevado a muchos otros. Hasta ahora se las ha arreglado para evitarlo. Pero cuando Tim se ve obligado a viajar a casa de los padres de Jessica, todo empieza a desmoronarse. Despu&amp;eacute;s de tener un sue&amp;ntilde;o inquietante con su madre (Lucy Lawless), Tim se despierta sudoroso, acurrucado en el suelo. Suena su m&amp;oacute;vil. Su madre ha muerto. Obligado a regresar al hogar de su ni&amp;ntilde;ez, una imponente y deteriorada casa de estilo g&amp;oacute;tico-victoriano en medio del campo. Tim intenta relajarse y disfrutar de un encuentro con la &amp;iacute;ntima amiga de su ni&amp;ntilde;ez, Kate (Emily Deschanel) y por un momento cree que todo est&amp;aacute; controlado. Pero cuando Tim revive el pasado, vagando por la casa oscura y vac&amp;iacute;a y rebuscando entre fotos viejas, le invaden los recuerdos y vuelve su miedo agobiante. Est&amp;aacute; seguro de ser observado por el mismo ser diab&amp;oacute;lico que le ha aterrorizado toda su vida. Tim se vuelve irracional y se siente enga&amp;ntilde;ado por todos, pero nadie puede salvarlo? ni salvarse. Sabe que el &amp;uacute;nico modo de terminar con la pesadilla es enfrentarse a la presencia maligna de una vez por todas.\n","torrent":{"xt":"urn:btih:70603ee855cf56aae764e830352bf91d02a84f17","amp;dn":"Boogeyman+DVD+XViD+MP3+SCREENER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70603ee855cf56aae764e830352bf91d02a84f17","infoHashBuffer":{"type":"Buffer","data":[112,96,62,232,85,207,86,170,231,100,232,48,53,43,249,29,2,168,79,23]},"announce":[],"urlList":[]}}