{"title":"BNP: Islamic Terror_ The Next Targets.wmv","uid":3375426,"size":38612987,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:70868985a1eaceddef0dbc8d2da89132d7257188&amp;dn=BNP%3A+Islamic+Terror_+The+Next+Targets.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anonymouse666","files":1,"time":1125151759,"description":"BNP Chairman, Nick Griffin discusses with Deputy BNP Leader, Simon Darby the fallout of the 7/7 atrocity and makes critical assessments of where and how the Islamic extremists will strike next. The July attacks on the capital?s transport systems were the opening salvos from the forces of the 5th columnists who have nothing less than the total Islamification of these islands as their ultimate goal. Western ideas such as ?sympathy?, ?pity?, ?trust? which mean something very real and tangible within an extended family, a private social or sports club or a rural and isolated community have been undermined by Britain?s Open Door immigration policy which has allowed nearly 2 million adherents of an alien faith walk in and settle here. Islamics have a very different belief system to the west and many of its leaders are quick to recognise and then exploit for their own ends those inherent weaknesses of the majority population. \n\nNick and Simon discuss the weak and vulnerable aspects of our national infra-structure and try to conclude where the Islamic fundamentalists will strike next and offer practical suggestions to the relevant authorities to minimise the risk to the people of Britain. \n\nOne practical suggestion is a wholesale assessment of those employed in ?sensitive? industries such as power generation, water supply, transportation and sports stadia.","torrent":{"xt":"urn:btih:70868985a1eaceddef0dbc8d2da89132d7257188","amp;dn":"BNP%3A+Islamic+Terror_+The+Next+Targets.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70868985a1eaceddef0dbc8d2da89132d7257188","infoHashBuffer":{"type":"Buffer","data":[112,134,137,133,161,234,206,221,239,13,188,141,45,168,145,50,215,37,113,136]},"announce":[],"urlList":[]}}