{"title":"BS Hacker - Replay","uid":3410994,"size":14836829,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:712861952710cf2ce5fba83dfc93ee79d0d401e8&amp;dn=BS+Hacker+-+Replay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AOTW","files":1,"time":1132348759,"description":"BS Hacker is a unique hacking simulation game. \n\nYou enter the underground world and play the role of a hacker, working against a system that aims to control everything. \n\nHacking games have never been so immersive and complex. \n\nA complete hacker console and game interface will create a perfect hacker environment, while the realism of the game elements will make you wonder if this is real ... or just a game.\n\nThe greatest hacking adventure game returns with new exciting levels and features.\nYou enter the underground world and play the role of a hacker, working on his own or against the system that aims to control everything.\n\nThe game contains 23 levels divided into 5 (Only 2 included in this release) episodes, each one bringing a unique adventure, for you to play:\n\n- Replay : In a future decay, where the Internet is no longer a free resource, try and build up a new alternative network.\n\n- Zero Expansions : When your daily job is no longer what it seems to be ... try and get out, in one piece.\n\nThe game features a complex console based interface, which closely resembles modern operating systems\nand computers, but manages to keep the feeling of a hacker environment.\nThis is not all. With complex modding capabilites, you can always go ahead and create new levels and missions, modify existing ones, or play those that were created by our enthusiast community.\n\nSystem requirements:\nIntel or AMD CPU with at least 300Mhz \n64 MB Ram\n25 Mb diskspace\nAt least DirectX 7.0 installed.","torrent":{"xt":"urn:btih:712861952710cf2ce5fba83dfc93ee79d0d401e8","amp;dn":"BS+Hacker+-+Replay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"712861952710cf2ce5fba83dfc93ee79d0d401e8","infoHashBuffer":{"type":"Buffer","data":[113,40,97,149,39,16,207,44,229,251,168,61,252,147,238,121,208,212,1,232]},"announce":[],"urlList":[]}}