{"title":"F.E.A.R.-DVD+NO-CD+KEYGEN-REPACK-Zimininet.com","uid":3398646,"size":4502228297,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:72b3c00864076bea8e8dabd64a6a5d269c5051cb&amp;dn=F.E.A.R.-DVD%2BNO-CD%2BKEYGEN-REPACK-Zimininet.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dam088","files":4,"time":1129703320,"description":"\nINSTRUCTIONS:\n\nburn  with any app, its still an iso9660 image, even if its made using clonecd.\ninstall.\nthen extract and copy the fear.exe in the directory overtop of the original exe.\n\n\n\nHAVE A READ:\n\nok, my first complaint is about the famous ebay source code. there is something that is just itching me, I am the first to obtain and release this. if any site claims its theres, then they are fuckin noobie liars. just because i didnt scene release it, does NOT mean i didnt release it. the only other site that can re-release it is, and thepirates-ship only. if you do other wise then your fucking lame. also, its source code from '99. its old and utterly useless. i just used it to increase traffic to a site. (we all gotta do our own to get a popular website do we not?)\n\nnow about windows xp scene edition, this is ours and was scene released. in an article on wired, we found that some fagget german site took it as there own, and made 1 part only availible form their site. this isnt even a real part, its a trojan. we may/may no send this out for you again, but just keep in mind, that if you see it released elsewhere in a foreign language, its probably not made by us.\n\nbtw, this release of fear aint by us, from some unkown group. i just thought id get the message across that im sick of all this bullshit spammer crap.\n\n\nanyhoot, we plan on starting all sorts of fun lil projects that we would need help with.\n1. radio station - we do need help dj'ing and setting up various temporary servers.\n2. opennap server, more of an underground file sharing network. accessable using pretty much any client that supports open nap.\n3. ART ART ART AND MORE ART!! we want to build up a portfolio of zimini sigs, wallpapers, themes, ETC\n4. SMF SKINS!!! yeah we had to change our forum software to smf, why? cause we got caught fair and square from ips. its quite stupid we actually used ipb but oh well.\n\nif there is any interest, drop us a line at www.zimininet.com :)","torrent":{"xt":"urn:btih:72b3c00864076bea8e8dabd64a6a5d269c5051cb","amp;dn":"F.E.A.R.-DVD%2BNO-CD%2BKEYGEN-REPACK-Zimininet.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72b3c00864076bea8e8dabd64a6a5d269c5051cb","infoHashBuffer":{"type":"Buffer","data":[114,179,192,8,100,7,107,234,142,141,171,214,74,106,93,38,156,80,81,203]},"announce":[],"urlList":[]}}