{"title":"Bullets over summer (1999) HK drama/action Dvdrip XVID CroakerBC","uid":3294848,"size":736245670,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:736f3d33e2756168bfdc6bb862d98e3d4c7a6763&amp;dn=Bullets+over+summer+%281999%29+HK+drama%2Faction+Dvdrip+XVID+CroakerBC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"croaker-bc","files":4,"time":1109306612,"description":"&lt;img src=&quot;http://www.nndq.com/bullets_cov.jpg&quot;&gt;&lt;P&gt;\nBullets over summer (1999)\nhttp://us.imdb.com/title/tt0214555/&lt;P&gt;\n\nFrom HKflix:\nTwo cops, Mike (Francis Ng) and Brian (Louis Koo), are sent out for surveillance after a dangerous criminal murders several police officers and innocent bystanders. After getting a hot tip from their informant, Mike and Brian go from apartment to apartment asking the tennants for help. No one wants to let the officers use their apartment, but they eventually find an empty place. At least they thought it was empty; an old lady (Helena Law) turns out to be living there and agrees to let them stay, but she turns out to be more than they bargained for... \nLonely and sometimes senile, the granny looks after Mike and Brian as if they were her own children. Mike never knew his parents and spent most of his life in an orphanage, so he welcomed the affection. Mike also has a rare disorder which causes him to lose control of his muscles and temper, which will eventually lead to mental retardation. Brian, who is absolutely girl crazy, is the younger of the two and looks up to Mike. &lt;P&gt;\n\nBoth officers, Mike and Brian, fall in love during their mission. Brian falls for a teenage school girl and Mike shows sympathy for a pregnant laundry woman. Mike finds out that the baby's father abandoned the woman, so he volunteers himself as the foster father (That mental retardation sure kicks in fast). He realizes that raising the child and taking care of the mother will be tough, but he promises to take care of them and he will do whatever it takes. Right or wrong. &lt;P&gt;\n\nCast: Francis Ng, Louis Koo, Michelle Mok, Lam Mei Jing, Helena Law, Wayne Lai, Lo Meng, Law Lan. . .  &lt;P&gt;\n\nMy 2 cents: Again, saw this at Fantasia Festival couple years back. Francis Ng is my fav actor and he is spectacular in\nthis film. The rest of the cast is also great. The movie is more focus on characters development than action. \nBut that doesn't mean there is no violent shoot-outs to spice thing up. Nice moments of comedy make this film all the more enjoyable.\nHighly recommended if you like a good drama/action flick.&lt;P&gt;\n\nSpecs:\nFile  :  699 MB,  duration: 1:28:39,  type: AVI,  1 audio stream\nVideo :  618 MB,  975 Kbps,  23.976 fps,  512*368 (4:3),  XVID (Q-PEL and GMC enabled)\nAudio :  81 MB,  128 Kbps,  48000 Hz,  2 channels,  MP3\nLanguage: Cantonese\nSubs: English, Chinese, Thai\nRipper: CroakerBC&lt;p&gt;\n\nScreencaps:\n&lt;img src=&quot;http://www.nndq.com/bullets1.jpg&quot;&gt;\n&lt;img src=&quot;http://www.nndq.com/bullets3.jpg&quot;&gt;\n&lt;img src=&quot;http://www.nndq.com/bullets4.jpg&quot;&gt;\n&lt;img src=&quot;http://www.nndq.com/bullets2.jpg&quot;&gt;\n","torrent":{"xt":"urn:btih:736f3d33e2756168bfdc6bb862d98e3d4c7a6763","amp;dn":"Bullets+over+summer+%281999%29+HK+drama%2Faction+Dvdrip+XVID+CroakerBC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736f3d33e2756168bfdc6bb862d98e3d4c7a6763","infoHashBuffer":{"type":"Buffer","data":[115,111,61,51,226,117,97,104,191,220,107,184,98,217,142,61,76,122,103,99]},"announce":[],"urlList":[]}}