{"title":"Offline windows update","uid":3493569,"size":14875670,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7434a302a1d50d97d93981c4cd0dc03f136f288b&amp;dn=Offline+windows+update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sisteczko","files":29,"time":1149776311,"description":"This is made by me a simple script utility which enables you to scan Windows (and other supported through MBSA products, like Office) for security vulnerabilities. The utility assumes, that you know the basics of MBSA 2.0 (which isn\\&amp;#039;t difficult).\n\nThe scripts are supposed to be used in the following way:\n1. On the beginning, on the target computer, you should install (one-time only) the MBSA client and possible security updates that are required for this client to run. You can do it by running the file \\&quot;setup.bat\\&quot;. Some machines might need reboot in order to fully apply the \\&quot;WindowsUpdateAgent20-x86.exe\\&quot; update. However computer will not reboot on its own, you have to reboot it manualy.\n\n2. Upload all files to your pen-drive (or just the folder \\&quot;wsusscan\\&quot;) and go to the internet cafe or any computer which is connected to the internet. \n3. Run the file \\&quot;download.bat\\&quot; from the pendrive and wait until \\&quot;wsusscan.cab\\&quot; is downloaded. \n4. Go back to the target computer, and run \\&quot;local_upload &amp; scan.bat\\&quot;, and wait until the security check is done.\nAfter the security check is done, the MBSA client will pop-up. If the scan was successful, you should see the results under \\&quot;view existing security reports\\&quot;. You will have an option to download directly (or copy the link) of the missing security updates.\n\n\nCompatibility:\nThese scripts will work on Polish and English version of Windows XP. They also asume, that user\\&amp;#039;s Local settings are stored on the %systemdrive% (I haven\\&amp;#039;t yet seen a computer where it wouldn\\&amp;#039;t be the case)\n\nNote:\na) The scripts have to temporarily turn on Windows Update service in order to let the MBSA do the scan. It is however disabled after the scan is complete (you don\\&amp;#039;t need Windows Update anymore with this utlity, do you?) \nb) You might still have a chance to download more files through the normal www.windowsupdate.com . But according to MS, the extra files will not be security patches but extra tools/drivers, because MBSA is certified to find all security upodates missing.\n\nCreation date: 8 VI 2006","torrent":{"xt":"urn:btih:7434a302a1d50d97d93981c4cd0dc03f136f288b","amp;dn":"Offline+windows+update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7434a302a1d50d97d93981c4cd0dc03f136f288b","infoHashBuffer":{"type":"Buffer","data":[116,52,163,2,161,213,13,151,217,57,129,196,205,13,192,63,19,111,40,139]},"announce":[],"urlList":[]}}