{"title":"Madcap - Full Discography","uid":3423526,"size":263862864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:766992ea62af55b373082b8356baf08212e14c77&amp;dn=Madcap+-+Full+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jgarrett7","files":35,"time":1135312846,"description":"Stand Your Ground\nMarch 20, 2001\nSide One Dummy\n\n1. Die\n2. Downtown \n3. Going On The Road\n4. Church And State \n5. Lazy Sunday\n6. My Turn\n7. French Quarter  \n8. Bottles Away \n9. Saturday \n10. Autumn \n11. Two Steps Behind\n12. I Hate The Man  \n\n_________________\n\nEast to West\nSeptember 24, 2002\nSide One Dummy \n\n1. Bright Lights, Big City\n2. These Old Feelings\n3. Hometown\n4. New Age\n5. Parental Advisory\n6. Streets Of Belief\n7. Midnight Thoughts\n8. Heaven Or Hell\n9. Situation Breakdown\n10. Desolate Town\n11. You Can't Forget\n12. Better Day  \n\n_________________\n\nUnder Suspicion\nFebruary 24, 2004\nVictory Records\n\n1. Keep Dancin'\n2. Lovesick\n3. Move Forward\n4. Somewhere In The City \n5. Under Suspicion\n6. Youth Explosion\n7. Searching For Ground \n8. Turnaround\n9. It Won't Die\n10. In My Head\n11. Midnight Strikes\n\nHome is where the heart is, and for Madcap, that isn't a house, an apartment or even their tour van - it is in the meaning they derive from writing and recording music, as well in listening to the artists they love. Honesty, passion, faith and persistence are the cornerstones of Madcap's philosophy, and they show an amazing ability to instill those beliefs in songs about love, rebellion, and personal struggle. Madcap began playing punk rock in the style of their idols in bands like The Jam, Buzzcocks and the Clash, but as they have grown, they began incorporating ideas drawn from studying the music of rock artists like Elvis Costello, Bruce Springsteen and U2. &quot;I was listening to some of my favorite bands and thinking about the process of making each album so different from the one before, but always creating classic songs. I wanted to take our band from the simpler power chords of punk into rock songs with more depth.&quot; Johnny explained. \nThe band formed in Southern California in 1999, and began working with Side One Dummy Records, recording two albums for the L.A. label. &quot;East To West&quot; established the band as a force to be reckoned with on the punk scene, non-stop touring reinforced their presence. After some personnel changes, they found the crew that fit perfectly. Bassist Lee, group founder, recruited Johnny from the audience. He became Madcap's manager and eventually learned to play guitar, taking over as front man. They soon recruited drummer Jake, who joined the band while he was a junior in high school. &quot;Jake is only 20, but I think he is one of the most solid players out there.&quot; Lee said, &quot;Things fell into place when we got Ace, he is a great lead guitarist and he just plays with a lot of heart and passion. We finally have the lineup I always envisioned, and when the chemistry is there you can just feel it.&quot; Madcap's next step was to find a label that understood their vision and was prepared to support it. Victory Records stepped in, signed the band, and the final piece of the puzzle was in place. \n\nMadcap settled into a rehearsal space to write, emerging with a collection of songs that would become &quot;Under Suspicion,&quot; drawing from 80's rock, reggae, dub and punk. &quot;Under Suspicion&quot; is a reggae tinged tune with an Elvis Costello vibe, while &quot;Keep Dancin' &quot; is an organ-laced rocker about perseverance, and having fun instead of giving up. &quot;Lovesick&quot; is a heartbreaking love song with an 80's dance groove that showcases Johnny's vocals. &quot;We used a vintage Fairchild compressor for the vocals, which was great, but a little bittersweet because the artist who had used it last was Johnny Cash. I love the way it gives the vocals a little bit of an older sound,&quot; Johnny explained. &quot;Youth Explosion&quot; is a catchy anthem about rebelling against the ruling class. &quot;I was talking to this businessman once, and he kept telling me that I needed to conform or there is no way I could succeed. It's just a big fuck you to anyone who judges others by the way they dress!&quot; laughed Johnny. \n\n&quot;Captain&quot; Ted Hutt was brought in to produce the album. Madcap worked with Hutt on their previous albums and feel a bond with him that makes recording sessions comfortable. &quot;I think he sees a little of himself in us, and we see a little of ourselves in him. That is what is the most important thing when you are working on music, to be able to relate to each other. This record was fun, we had a lot of spontaneous stuff happening like people playing bottles and tin trays for percussion!&quot; said Johnny. The stellar horns of Catch 22 enhanced &quot;Searching For Ground&quot; and friend Rami Jaffee of the Wallflowers contributed outstanding organ to &quot;Keep Dancin,&quot; &quot;Somewhere In The City&quot; and &quot;Under Suspicion.&quot; \n\nMadcap are quickly establishing themselves as one of America's definitive rock bands. &quot;Under Suspicion&quot; is more adventuresome than their previous efforts (2001's &quot;Stand Your Ground&quot; and 2002's &quot;East To West&quot;) however the urgency and the anthems remain. \n","torrent":{"xt":"urn:btih:766992ea62af55b373082b8356baf08212e14c77","amp;dn":"Madcap+-+Full+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"766992ea62af55b373082b8356baf08212e14c77","infoHashBuffer":{"type":"Buffer","data":[118,105,146,234,98,175,85,179,115,8,43,131,86,186,240,130,18,225,76,119]},"announce":[],"urlList":[]}}