{"title":"House of Wax (2005) - Xvid DVDRip incl optional dutch subs","uid":3381479,"size":1467529137,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77a4e1caf49b7eb04733c70b44fc2bdaad3d2756&amp;dn=House+of+Wax+%282005%29+-+Xvid+DVDRip+incl+optional+dutch+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Solarweb.nl","files":5,"time":1126360369,"description":"What begins as a weekend getaway for six friends becomes a terrifying fight for their lives in HOUSE OF WAX, an exciting re-imagining of the 1953 horror classic from Dark Castle Entertainment and producers Joel Silver and Robert Zemeckis.\n\nA road trip to the biggest college football championship of the year takes a turn for the worse for Carly (ELISHA CUTHBERT), Paige (PARIS HILTON) and their friends when they decide to camp out for the night before heading to the game. A confrontation with a mysterious trucker at the camp site leaves everyone unsettled, and Carly has her hands full trying to keep the peace between her boyfriend Wade (JARED PADALECKI) and her hot-headed brother Nick (CHAD MICHAEL MURRAY).\n\nThey wake up the next morning to find that their car has been deliberately tampered with. At the risk of being stranded, they accept a local?s invitation for a ride into Ambrose, the only town for miles. Once there, they are drawn to Ambrose?s main attraction?Trudy?s House of Wax, which is filled with remarkably life-like wax sculptures. But as they soon discover, there is a shocking reason the exhibits look so real.\n\nAs the friends uncover the town?s dark secrets, they are stalked by a demented killer and find themselves in a bloody battle for survival. The group must find a way out of Ambrose?or become permanent additions to the HOUSE OF WAX.","torrent":{"xt":"urn:btih:77a4e1caf49b7eb04733c70b44fc2bdaad3d2756","amp;dn":"House+of+Wax+%282005%29+-+Xvid+DVDRip+incl+optional+dutch+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77a4e1caf49b7eb04733c70b44fc2bdaad3d2756","infoHashBuffer":{"type":"Buffer","data":[119,164,225,202,244,155,126,176,71,51,199,11,68,252,43,218,173,61,39,86]},"announce":[],"urlList":[]}}