{"title":"VA - Norberg 2005 Field Mixes - 2005 HVBR (electro-ambient)","uid":3376551,"size":133339094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7873f84a308da950ad81fb04b28ce3e60b03ca50&amp;dn=VA+-+Norberg+2005+Field+Mixes+-+2005+HVBR+%28electro-ambient%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Musictrade","files":13,"time":1125376808,"description":"Electro-ambient field mixes from Musictrade's field recording project focused around Norberg 2005 electronic music festival in Norberg, Sweden.\n\n\nRelease notes\n\nVA - Norberg 2005 Field Mixes\nMusictrade release MT003\nRelease date: August 30, 2005\n\nTrack listing:\n\n01\tDoc - Airports for Music\t\t12:24\n02\tUnknow Forces - Tre Komma Fem Procent\t06:05\n03\tElectroteque - Climate Changes\t\t05:19\n04\tFrags - Nocturnal Nail Clipping\t\t08:42\n05\tKraftiM - Norkhaberg\t\t\t05:28\n06\tDoc - Looking for Sophie\t\t16:40\n07\tElectroteque - Sleepy Mimer\t\t16:45\n\n\ttotal\t\t\t\t\t71:23\n\n\nSeveral Musictrade members visited Norberg 2004 electronic music festival in 2004 in Sweden. The visitors were inspired both by the versatile and experimental musical lineup of the festival and by its impressive industrial setting (the main venues are massive old iron mine buildings). Of the Musictrade artists present, Electroteque ended up doing an 1-hour DJ gig on the festival but otherwise Musictraders merely enjoyed the music and gathered fresh impressions. \n\nTo Norberg 2005 Musictrade came with a full 3 hour showcase of its own original material, featuring artists Doc (Finland), Unknown Forces (Scotland) and Electroteque (Australia). Besides the showcase and other festival activities the Musictrade crew was also engaged on a special field recording project. The idea was to collect field audio material from different environments and situations and later on share the material and work it into an album. Recordings were made both in Norberg itself during the festival and on various locations around the world visited by Musictraders on their way to Norberg and back home. Plenty of interesting field material was captured, and overall the project was a big inspiration for all involved. It took only a month after the festival for this album to materialize, with contributions from five Musictrade artists.\n\n01\nDoc - Airports for Music\n\nField recording: Electroteque\n\nAmsterdam was one of the stopovers for Electroteque on his long journey from Sydney, Australia, to Norberg, Sweden. This offered him a chance to make a field recording from Schipol airport, and this good quality stereo recording served futher as perfect raw material for Doc, who in his mix treats the airport as a musical instrument, bringing up both the incessant, efficient heartbeat of the sophisticated airport complex and the amazing layers of tonality and poetry hidden in the apparently chaotic mixture of announcements, random discussions, footsteps, machine sounds and ambient noises.\n\n----------\n\n02\nUnknown Forces - Tre Komma Fem Percent\n\nField recordings: KraftiM &amp; Electroteque\n\nIn his characteristically strange and charming way Unknown Forces combines KraftiM's and Electroteque's field material with his own catchy synth riffs and field material based percussion sounds. The result is a lovely dancable track that at the same time carries the special magic of field recordings and ambient spaces.\n\n----------\n\n02\nElectroteque - Climate Changes\n\nField recordings: Electroteque &amp; Frags\n\nThis track is based on field recordings made in Holland and Sweden just before the festival. Electroteque worked out the material in Norberg into this relaxed rhythmical track which he also performed live on his Musictrade showcase gig.\n\n----------\n\n03\nFrags - Nocturnal Nail Clipping\n\nField recording: Electroteque\n\nA Musictrade artist from Sweden, Frags, debutes with this humorous mix illustrating the scary aspects of nocturnal nail clipping activities. Mixing smartly together Electroteque's field recording and sounds from Doc's Solaris track (released earlier on MT001) Frags creates a thick atmosphere of otherwordly audio suspension in a setting where dissected body fragments (albeit periferial) drop one by one down to the floor in the thick of the night - and *hearing* is the only way to know what is going on!\n\n----------\n\n04\nKraftiM - Norkhaberg\n\nField recording: KraftiM\n\nThe other debuting Musictrade artist on this album, KraftiM, comes from Holland. KraftiM's sound is original, personal and powerful, and his Norkhaberg track is a strong piece of electronica pulsating with primitive rhythms and sounds. This music carries deep masculine energy with distant echoes all the way from Tuvan mountains.\n\n----------\n\n05\nDoc - Looking for Sophie\n\nField recording: KraftiM\n\nThis field recording covers KraftiM's walk from the idyllic old town quarters of Norberg (where Musictrade had set up its temporary headquarters) to the Norberg 2005 festival area. In Doc's mix KraftiM's simple but eventful walk is transformed into a pictoresque audio odysseia with mythical undertones. We follow the electronic footsteps of a modern Ulysses into town's marketplace where he dwells for a moment in the comforting tones of a live orchestra. This comfort is soon wiped away as our hero meets a scary Bergmanian character - the Norbergian Solitary Reaper. After this shaking encounter he enters the high-risk Trans-Norbergian Highway Zone which he crosses through with both caution and determination. After leaving the imminent dangers behind he enters the relaxed atmosphere of pristine Nordic country meadows where wild Swedish horses come to greet him. And after the meadows he comes to the festival site itself where after greeting the guardians he steps into the dark and majestic industrial cathedral known as Mimer which he must pass through to reach his final goal. Deep, ghostlike echoes from building's industrial past almost mesmerize him, but applying his willpower he emerges back into daylight and takes the final crucial steps to reach the shrine of female grace known as Sofie's office.\n\n----------\n\n06\nElectroteque - Sleepy Mimer\n\nField recording: Electroteque\n\nOn Sola Muusika (MT001) compilation Electroteque already showed his technical skills and good taste with rhythmic electronic material. On this track he applies his talent into deeper ambient material, and does it very convincingly - with both precision and style. Sleepy Mimer is a suggestive, dreamlike ambient track growing out of the lingering echoes of EMS's (Institute for Electro-acoustic Music in Sweden) profound Mimer performance and digging gradually deeper into the soundworld of the monumental Mimer building with its various interlinked ambient spaces. Coming from the other side of the globe Electroteque has a special eye and ear for arctic madness and he captures some of it very nicely into his ambient loops.\n\n======================\n\nPrevious Musictrade releases:\n\nMT001 VA - Sola Muusika 2005 Musictrade Showcase\nhttp://thepiratebay.se/details.php?id=3343290\n\nMT002 Doc feat. Lena Selyanina - Distant Transmissions, Ambient Reflections on Bach\nhttp://thepiratebay.se/details.php?id=3363887\n\nFor more info, visit http://www.musictrade.info/\n\nEnjoy, Musictrade.","torrent":{"xt":"urn:btih:7873f84a308da950ad81fb04b28ce3e60b03ca50","amp;dn":"VA+-+Norberg+2005+Field+Mixes+-+2005+HVBR+%28electro-ambient%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7873f84a308da950ad81fb04b28ce3e60b03ca50","infoHashBuffer":{"type":"Buffer","data":[120,115,248,74,48,141,169,80,173,129,251,4,178,140,227,230,11,3,202,80]},"announce":[],"urlList":[]}}