{"title":"Dropstich 2005 Snowboarding.3gp","uid":3406133,"size":87215802,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:79024e1bb20b1911e42f0b06dcc3889396b8d6bf&amp;dn=Dropstich+2005+Snowboarding.3gp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Broken Toy","files":1,"time":1131313830,"description":"\tDROPSTITCH ALL GIRLS SNOWBOARD FILM\n\nSUPPORTED BY: BURTON, OAKLEY, NIKITA, SALOMON, BILLABONG, ROXY, VANS\n\nAfter 12 months of filming around the world, the all girls snowboard film &quot;DropStitch&quot; is now complete and available for your .3gp enabled device.\n\n&quot;DropStitch&quot; features some of the world?s best professional snowboarders including Olympic medal winners and International Champions such as Kjersti Buaas, Kelly Clark, Natasza Zurek and Doriane Vidal. DropStitch is directed by World No 3 ranked halfpipe rider Lesley McKenna and photographer Josie Clyde - &quot;The motivation for us to make this film is that we wanted to show people what it is like to be a professional snowboarder. Snowboarding is such a great lifestyle and we hope by making DropStitch we can motivate other girls to get involved in the sport. Now there is a really strong field of international female snowboarders that travel, live and ride together and we felt their efforts, trials and tribulations deserved to be documented&quot;\n\nVIDEO INFORMATION:\nRunning time: 55 min.\nFormat: .3gp\nDimensions: 176x144\nAudio: Stereo\nOriginally encoded for the LG vx8100\n\nContents\n12 rider sections: Featured Riders include Natasza Zurek, Silvia Mittermuller, Jenny Jones, Lisa Filzmoser, Doriane Vidal, Lesley McKenna, Anne Flore Marxer, Tina Birbaum, Kjersti Buaas, Lisa Wiik, Cheryl Maas as well as Friends such as Kelly Clark, Torah Bright, Annie Boulanger Jessica Dalpiaz to name a few.\n\nTrip Sections: USA, New Zealand, Iceland, Czech Republic, Europe\n\nIf you like this video, support the riders and buy it for someone as a gift.","torrent":{"xt":"urn:btih:79024e1bb20b1911e42f0b06dcc3889396b8d6bf","amp;dn":"Dropstich+2005+Snowboarding.3gp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79024e1bb20b1911e42f0b06dcc3889396b8d6bf","infoHashBuffer":{"type":"Buffer","data":[121,2,78,27,178,11,25,17,228,47,11,6,220,195,136,147,150,184,214,191]},"announce":[],"urlList":[]}}