{"title":"ThePunisher.rar","uid":3462306,"size":1708285058,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7ad21b114713b8193f5c4f2ee791c361166ca24c&amp;dn=ThePunisher.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"smashthestack","files":1,"time":1143282475,"description":"\nFrank Castle?s life changed the day his family was murdered. A part of his soul died, too. What was left dedicated the rest of his life to revenge upon the criminal scum of the world. He was reborn as?The Punisher!\n\nIs he a hero? An obsessive madman? His methods are harsh and brutal, striking fear into the darkest hearts of the criminal underworld as he delivers vigilante justice to every thug he can lay his hands on.\n\nThe Punisher walks through a world we all know, a world darkened by war, crime, cruelty, and injustice. He has no superpowers ? only his fierce intelligence, years of combat experience, and an iron determination to avenge the wronged. Where justice ends, Punishment begins!\n\nNow you can get inside the head of the Punisher\n\n    *\n      Become The Punisher, the Marvel vigilante and ultimate anti-hero, in a non-stop action experience.\n\n    *\n      Embrace the Punisher?s tactics by interrogating criminals! Will you break them and gain information?\n\n    *\n      Interactive Environments! Unique ?hotspots? create dozens of environment-specific kills and interrogations that create interactive, cinematic ?Punisher Moments?!\n\n    *\n      Over 101 unique deaths await those that stand in the Punisher?s way.\n\n    *\n      Punisher Armory! Use an upgradeable assortment of guns and weapons to wage an onslaught of two-fisted firepower.\n\n    *\n      Original story from acclaimed Punisher writers Garth Ennis and Jimmy Palmiotti\n\n    *\n      ?Best of Everything Punisher? combines over 30 years of Punisher history, including his greatest enemies and allies!","torrent":{"xt":"urn:btih:7ad21b114713b8193f5c4f2ee791c361166ca24c","amp;dn":"ThePunisher.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ad21b114713b8193f5c4f2ee791c361166ca24c","infoHashBuffer":{"type":"Buffer","data":[122,210,27,17,71,19,184,25,63,92,79,46,231,145,195,97,22,108,162,76]},"announce":[],"urlList":[]}}