{"title":"Vanishing Point - Tangled in Dream [MP3, 192k]","uid":3311493,"size":96456837,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d631da95d4d103510a1eb3a5b1cf5451c5f0ddc&amp;dn=Vanishing+Point+-+Tangled+in+Dream+%5BMP3%2C+192k%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Harakiri576","files":36,"time":1112605766,"description":"Includes lyrics, art, band pics and much more!\n\nReview:\n\n   TANGLED IN DREAM     by Aragorn\n\n   Let's make a little trip down under, 'cause there ara many interesting\n   things to find: impressing landscapes, kangaroos and emus (these are\n   cool!). On the other side, the beer is not as good as in Germany, but\n   we find some phantastic Metal bands over there.\n\n   When I look at VANISHING POINT, then I am sure, their creativity isn't\n   blown away by too much beer. VANISHING POINT is in my opinion the best\n   Progressive Metal export coming from Australia so far! They are not\n   just performing those three-chord-riffs, like the most famous\n   Australian Rock band do; no, their creative and musical potential\n   carries the listener straight into unknown spheres of musical\n   enjoyment. I can only predict a great future to these guys for sure!\n\n   Tangled In Dream is a magnificent and exciting album, that shows\n   everything in between pathos and poetry, gentleness and toughness;\n   tradition and creativity, without being boring for one second! On\n   Tangled In Dream you can hear electrifying and powerful, but also\n   sensible and perfect arranged musical art at its best! This music is\n   awesome and you can't categorise it as easy as other stuff coming out\n   of this musical genre; simply bewitching! The musical spectrum\n   includes everything going from melodic and catchy Rock songs like\n   Bring On The Rain or Father up to wonderful and melancholical ballads\n   like Dancing With The Devil. The hymn on this album (and one of the\n   best songs IÂ´ve ever heard) is surely Never Walk Away, for this track\n   is the perfect combination of emotion, atmosphere and power! Vocalist\n   Silvio Massaro's part in this song is simply brilliant. I definitely\n   do not know any other guy that sings the words &amp;quot;crucify and deny me&amp;quot;\n   the way he does (who the hell said that Pete Steele is an awesome\n   shouter?!?). Also a nice goodie is the hidden track, that includes a\n   cover version of the Pink Floyd classic On The Turning Away. The\n   experiment covering a Pink Floyd song fits perfect!\n\n   What could I say more? This one's a free flight into an\n   68-minutes-lasting trip into unknown musical spheres! If I'd be\n   flexible enough I would bite my ass, for I missed this band in Wacken!\n   For me, definitely one of the ten best albums this year! 10 out of\n   10!!!\n\n   reviewed by Aragorn\n   Å  2000 Walls Of Fire (Germany)\n","torrent":{"xt":"urn:btih:7d631da95d4d103510a1eb3a5b1cf5451c5f0ddc","amp;dn":"Vanishing+Point+-+Tangled+in+Dream+%5BMP3%2C+192k%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d631da95d4d103510a1eb3a5b1cf5451c5f0ddc","infoHashBuffer":{"type":"Buffer","data":[125,99,29,169,93,77,16,53,16,161,235,58,91,28,245,69,28,95,13,220]},"announce":[],"urlList":[]}}