{"title":"The Godfather Triology (swesub)","uid":3278396,"size":4359430916,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7de80ea224472e9f4a346c9e5ca2d83de3a9d5b9&amp;dn=The+Godfather+Triology+%28swesub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"joyern","files":11,"time":1106059532,"description":"http://www.imdb.com/find?q=The%20Godfather;tt=on;nm=on;mx=20\n\nDivx with swedish subtitles files\n\nThe Godfather Triology\n\n\n\nDirected by\n\nFrancis Ford Coppola\n\n\n\nPlot Summary for\n\nThe Godfather (1972)\n\n\n\nThe story begins as &amp;quot;Don&amp;quot; Vito Corleone, the head of a New York Mafia &amp;quot;family&amp;quot;, oversees his daughter's wedding. His beloved son Michael has just come home from the war, but does not intend to become part of his father's business. Through Michael's life the nature of the family business becomes clear. The business of the family is just like the head of the family, kind and benevolent to those who give respect, but given to ruthless violence whenever anything stands against the good of the family. Don Vito lives his life in the way of the old country, but times are changing and some don't want to follow the old ways and look out for community and &amp;quot;family&amp;quot;. An up and coming rival of the Corleone family wants to start selling drugs in New York, and needs the Don's influence to further his plan. The clash of the Don's fading old world values and the new ways will demand a terrible price, especially from Michael, all for the sake of the family.\n\n\n\nPlot Summary for\n\nThe Godfather: Part II (1974)\n\n\n\nThe continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.\n\n\n\nPlot Summary for\n\nThe Godfather: Part III (1990)\n\n\n\nIn the final instalment of the Godfather Trilogy, an aging Don Michael Corleone seeks to legitimize his crime family's interests and remove himself from the violent underworld but is kept back by the ambitions of the young. While he attempts to link the Corleone's finances with the Vatican, Michael must deal with the machinations of a hungrier gangster seeking to upset the existing Mafioso order and a young protoge's love affair with his daughter.","torrent":{"xt":"urn:btih:7de80ea224472e9f4a346c9e5ca2d83de3a9d5b9","amp;dn":"The+Godfather+Triology+%28swesub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7de80ea224472e9f4a346c9e5ca2d83de3a9d5b9","infoHashBuffer":{"type":"Buffer","data":[125,232,14,162,36,71,46,159,74,52,108,158,92,162,216,61,227,169,213,185]},"announce":[],"urlList":[]}}