{"title":"Celebrity Poker Showdown Season 6","uid":3424229,"size":4383458220,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e18eb396b32da271cbcd492bb8c46fba5b4b75f&amp;dn=Celebrity+Poker+Showdown+Season+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"formsoldier","files":6,"time":1135538126,"description":"Here it is! Full Season 6 of Celebrity Poker Showdown.\n\nIt took me a while to finally get a hold of S06E06 ... but a friend of mine in da states capped that for me and uploaded that episode here, and then I added it to my collection and decided to release the full complete season too, as originally planned and promised :).\n\nI'm going to upload Season 7 after this one too. \n\n**BUT** .. I'm missing one game of that season: S07E03 &lt;- if you find it, please let me know as it'll complete my collection - or just upload it as a torrent here thank you.\n\nBut for now, enjoy Season 6!! For all you horny boyzorz, Trishelle the hottie from Real World (an American reality show, I don't know, I'm a Swede) is in this one. If you don't know who she is search for 'Trishelle' on Google pictures. You'll find some nude ones too. Just keep looking and you should find yourself within the masturbation time-zone!\n\nFor those of you who like funny guys instead of hot girls, Howie Mandel, the Canadian comedian is in this one... damn he's funny. That whole episode (episode 2) is funny actually.\n\n----------\n\nAnyway, here are the celebrities in each game for Season 6.\n\nEpisode/Game 1: Jonny Fairplay, Andrew Firestone, Trishelle Cannatella, Charla Philstrom, Omarosa Manigault-Stallworth \n\nEpisode/Game 2: Howie Mandel, Stephen Collins, Peter Dinklage, Meat Loaf, Bryan Cranston \n\nEpisode/Game 3: Ricki Lake, Kathryn Morris, Sharon Lawrence, Caroline Rhea, Kathy Najimy \n\nEpisode/Game 4: Amber Tamblyn, Cheryl Hines, Michael Vartan, Alex Trebek, Anthony Anderson \n\nEpisode/Game 5: Rosie O'Donnell, Mo Gaffney, Penny Marshall, Travis Tritt, Eddie Cibrian\n\nEpisode/Game 6: Championship game between the previous 5 episodes'/games' winners!\n\n----------\n\n****And again, *PLEASE*, anyone, I beg you, if you have Season 7, episode 3, let me know, drop me a private message or something, or just upload it as a torrent! \n\nCheers!","torrent":{"xt":"urn:btih:7e18eb396b32da271cbcd492bb8c46fba5b4b75f","amp;dn":"Celebrity+Poker+Showdown+Season+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e18eb396b32da271cbcd492bb8c46fba5b4b75f","infoHashBuffer":{"type":"Buffer","data":[126,24,235,57,107,50,218,39,28,188,212,146,187,140,70,251,165,180,183,95]},"announce":[],"urlList":[]}}