{"title":"411 VM Vol.13 Issue 2 (skateboard)","uid":3382965,"size":388737804,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:80ad17f7dc356d6495881ee3d46e8a10ae1835fe&amp;dn=411+VM+Vol.13+Issue+2+%28skateboard%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"qwertyasdf","files":1,"time":1126657506,"description":"Studio411 presents 411 Volume 13, Issue 2!!\n\nOUT NOW!! Prepare for an all-out assault as 411 Volume 13, Issue 2 blasts its way into a skate shop near you! The issue comes jam-packed with explosive skating from an all-star lineup. Charging in with an unforgettable Openers segment, the momentum continues with an epic Chaos featuring Jake Nunn, Richie Belton and Emeric Pratt. DVS brings More Skate More with footage from Daewon Song, Kerry Getz, Jeron Wilson and the rest of the DVS team. Kurtis Colamonico and Graham Bickerstaff wreck havoc bringing in the New World Order while Kenny Anderson, Danny Montoya and Mikey Taylor go undercover in Italy to pull off The Italian Job. Finishing it all off, the mind-blowing Chris Haslam and the ever-so-solid Cooper Wilt give you a glimpse of what it's like to be Almost Famous.\n\nThe excitement doesn't stop there! Think you're a good skater? Well Don't Quit Your Day Job, as Landon Mitchell and Anthony Acosta tear up the scene. Billabong takes you on a European Vacation featuring Jereme Rogers, Mike Peterson and the rest of the Billabong team. 411's got all the highlights from the intense 2005 Tampa Pro Contest to quench your thirst. 411 also gives you the Subtitled Chaos, showing you the names of each trick as it goes down.\n\nBut wait! There's more! An interactive Product Guide, a 32-page 'zine with photos and interviews, a free poster and a free CD music sampler make this issue a must-have! So what are you waiting for? Get your copy of 411 Volume 13, Issue 2 now! \n\nhttp://www.411vm.com/","torrent":{"xt":"urn:btih:80ad17f7dc356d6495881ee3d46e8a10ae1835fe","amp;dn":"411+VM+Vol.13+Issue+2+%28skateboard%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80ad17f7dc356d6495881ee3d46e8a10ae1835fe","infoHashBuffer":{"type":"Buffer","data":[128,173,23,247,220,53,109,100,149,136,30,227,212,110,138,16,174,24,53,254]},"announce":[],"urlList":[]}}