{"title":"NightNurse-Stanwyck-Wellman.avi","uid":3287482,"size":623949824,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:810a05a2ddcf8424e5b9c557886d255cd861a1da&amp;dn=NightNurse-Stanwyck-Wellman.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rodanrodin","files":1,"time":1107935209,"description":"72 min.  Xvid, 1030 Kbps,  23.976 fps,  480*364 (4:3) \n\nhxxp://imdb.com/title/tt0022208/\n\nProps to NNON at vintage without whose original svcd post I wouldn't have been able to transcode to avi.\nIt's an old movie so expect a few moments of jerkiness, but it's very few and far between.\n\nOne of the so-called Forbidden Hollywood (pre-code) films, this early 1931 Barbara Stanwyck film moves with a good clip, as usual with Wellman's direction in such films as Lady of Burlesque, also starrring Stanwyck. Wellman is probably best known for Public Enemy (the movie that made a grapefruit into a star) and The Oxbow Incident.\n\nJoan Blondell is Stanwyck's fellow nurse and roommate and would've stolen the show if it were anyone less than Stanwyck in the lead. Clark Gable has an interesting early role as a malevolent presence dressed in black who literally throws Stanwyck against the wall and slugs her unconscious.\n\nBut this is Stanwyck's movie, and everything we love about her is already there except for the voice which is still a bit light. She has a way of looking at a man and sizing him up immediately with a bemused smirk. You can't put one over a street smart dame. A rare film until a dvd is finally issued. \n","torrent":{"xt":"urn:btih:810a05a2ddcf8424e5b9c557886d255cd861a1da","amp;dn":"NightNurse-Stanwyck-Wellman.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810a05a2ddcf8424e5b9c557886d255cd861a1da","infoHashBuffer":{"type":"Buffer","data":[129,10,5,162,221,207,132,36,229,185,197,87,136,109,37,92,216,97,161,218]},"announce":[],"urlList":[]}}