{"title":"Dave Alvin - King of California","uid":3387306,"size":131889152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:812547810a08da06c1376164a7f7537ecafe9cee&amp;dn=Dave+Alvin+-+King+of+California&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"racemate","files":13,"time":1127561446,"description":"From the time the Blasters began making waves on the California rock scene, the standard line always was that Dave Alvin was the group's great songwriter and Phil Alvin was the great singer. And when Dave launched his solo career in 1987, he was frequently saddled with the criticism that he wasn't much of a vocalist compared to his brother. While dozens of blues and roots rock performers have built solid careers without singing any better than Dave Alvin, it's true that on Romeo's Escape and Blue Blvd his rough, flinty voice lacked the natural grace and projection of Phil's work with the Blasters. But on 1994's King of California, Alvin recorded a few new songs alongside a stack of classics from his back catalog (and some well-chosen covers) with a small acoustic combo backing him up. Suddenly freed from having to shout over a high-powered rock band, Alvin proved on this release just how good of a vocalist he really was. While Alvin's natural instrument still shows certain limitations on King of California, when allowed to play with the nooks and crannies of his voice he reveals a subtle but dramatic sense of phrasing and a marvelous feel for the characters he created; he's still no Al Green, but as a musical storyteller he's mighty impressive. Of course, it helps that he has a bunch of superb songs to work with here, including &quot;Barn Burning,&quot; &quot;Fourth of July,&quot; &quot;Border Radio,&quot; and &quot;Little Honey,&quot; and that the great Greg Leisz is on hand to anchor the band, produce the sessions, and play marvelous slide guitar. While King of California was often lumped in with the then-fashionable unplugged craze, in retrospect it was the album where Dave Alvin's abilities as a performer began to catch up with his gifts as a songwriter, pointing the way for his later albums Blackjack David and Public Domain.\nTracks\n\t\t\n\t\n\t\t1 \tKing of California \tAlvin \t4:51\n  \t  \t2 \tBarn Burning \tAlvin \t4:01\n  \t  \t3 \tFourth of July \tAlvin \t4:35\n  \t  \t4 \tGoodbye Again \tAlvin, Flores \t3:58\n  \t  \t5 \tEast Texas Blues \tMoore \t4:07\n \t  \t6 \tEvery Night About This Time \tAlvin \t4:24\n  \t  \t7 \tBus Station \tAlvin \t4:04\n  \t  \t8 \tMother Earth \tMemphis Slim \t3:39\n  \t  \t9 \tBlue Wing \tRussell \t3:43\n  \t\t10 \tLittle Honey \tAlvin, Doe \t5:10\n  \t  \t11 \t(I Won't Be) Leaving \tAlvin \t5:06\n  \t  \t12 \tWhat Am I Worth \tEdwards, Jones \t3:20\n  \t  \t13 \tBorder Radio \tAlvin \t3:51\n\n@ 320 kb/s","torrent":{"xt":"urn:btih:812547810a08da06c1376164a7f7537ecafe9cee","amp;dn":"Dave+Alvin+-+King+of+California","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812547810a08da06c1376164a7f7537ecafe9cee","infoHashBuffer":{"type":"Buffer","data":[129,37,71,129,10,8,218,6,193,55,97,100,167,247,83,126,202,254,156,238]},"announce":[],"urlList":[]}}