{"title":"Project Redstar (Martian Genesis) - Proof of life on Mars (2002)","uid":3396636,"size":732508160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81c143d4f78efb2052e631093bb77bcc36ac5790&amp;dn=Project+Redstar+%28Martian+Genesis%29+-+Proof+of+life+on+Mars+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ReVIsed","files":1,"time":1129345420,"description":"Description &quot;One of the most astounding and incredible videos you will ever see - for it is history in the making. This video offers INCONTROVERTIBLE EVIDENCE of an extraterrestrial base on Mars. This is volume one in a series of three, that probes the depths of the greatest mystery ever to confront the human race. Who built these structures? Why are they so much like those found on Earth in both scale and shape? Why do we have such a mixture of structures, like those found in the Middle East, India, Mexico, South America and Egypt? What are the high technology structures that are clearly seen there as well? More questions are raised than can be answered in a two hour video, which is why VOLUME ONE concentrates on the structures, and offers a deep probe into each of the obvious buildings at this incredible archeological site. Complete with the actual photographs, ink lifts, artist renditions, computer renditions and animations, you will take an astounding tour by air over Tithonia City. This video release is the PROOF POSITIVE that we are NOT ALONE, and that there is an EARTH-MARS CONNECTION. \n\nThe PROJECT REDSTAR - MARTIAN GENESIS documentary PROVES, beyond any shadow of a doubt that Mars was or is inhabited by entities UNKNOWN. See for the first time EVER in recorded history ARTIFICIAL STRUCTURES ON MARS!! This is not a joke, it is not a hoax, it is very real and has very real ramifications to the human race.&quot;\n\nFilesize.....: 698 MB (or 715,340 KB or 732,508,160 bytes)\nRuntime......: 01:59:11 (214,307 fr)\nVideo Codec..: XviD\nVideo Bitrate: 690 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 120 kb/s (60/ch, stereo) VBR \nFrame Size...: 352x256 (1.38:1) [=11:8]","torrent":{"xt":"urn:btih:81c143d4f78efb2052e631093bb77bcc36ac5790","amp;dn":"Project+Redstar+%28Martian+Genesis%29+-+Proof+of+life+on+Mars+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c143d4f78efb2052e631093bb77bcc36ac5790","infoHashBuffer":{"type":"Buffer","data":[129,193,67,212,247,142,251,32,82,230,49,9,59,183,123,204,54,172,87,144]},"announce":[],"urlList":[]}}