{"title":"Syndromeda - Birth of a Black Hole (New Age 1999)","uid":3502459,"size":155620415,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81f6ee069ed7cfe1de374c4908aebb353928ab1d&amp;dn=Syndromeda+-+Birth+of+a+Black+Hole+%28New+Age+1999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Groove Unlimited","files":10,"time":1152610331,"description":"Artist              : Syndromeda\nAlbum               : Birth of a Black Hole\nYear                : 1999\nGenre               : New Age\nCodec               : Lame 3.96\nBitrate             : 256 Kb/s\nStereo/Joint Stereo : Stereo\nCovers              : Front - Back - Inlay\n\n\nTracks:\n-------\n01 - Beyond Dimensions\n02 - Liquid Motions\n03 - The Sky is Open\n04 - Tru the Black Hole\n06 - Love is the Answer (to all the questions of our children)\n\nREVIEW\n\nThe New Age spacemusic realized by Tangerine Dream during the mid-70s and early 80s inspired a generation to listen to and create music differently from what they&amp;#039;d been taught or imagined. We know now that a huge void was created when TD moved on to other areas of musical expression. Of the many groups and artists moved to create music in the mode the Tang&amp;#039;s envisioned is Syndromeda. The latest CD is out on the Groove label and entitled: Birth Of A Black Hole. \nSyndromeda, Belgian synthesist Danny Bundts, creates pattern oriented, rapidly developing, sequencer driven pieces seemingly meant to accompany a fantastic inter-stellar space mission. Conveyed through his music, Syndromeda&amp;#039;s vision is shared by the engrossed listener. Birth Of A Black Hole is cerebral but not in a hypnotic manner. The music is quite active and tightly arranged, changing tempo, moving chords and focusing on melody throughout to keep the listener involved and imagining different urgent scenarios. The presence of the occasional vocoder voice narration adds to the already otherworldy sci-fi vibe. \n\nBirth Of A Black Hole is evocative of space travel beyond the laws of early 21st century physics. It has been made to enjoy while considering distances measured in light years as opposed to miles. Any self respecting traveller beyond the speed of light wouldn&amp;#039;t leave the spaceport without this music blasting in their shuttle cockpit. \n\n\n-------------------\n\nReleases from  the New Age label Groove Unlimited, which includes the back catalog, will now be distributed as free mp3s and lossless audio files. Check your favorite Bit Torrent sites and peer-to-peers for the mp3s, apes and flacs. Load up your Ipods and PCs and enjoy the music. Distribute this New Age Music freely!!! \nMusic wants to be free!! :-)\n-JimmyThaNAzi &amp; ThaKeeStoneKop\n-------------------","torrent":{"xt":"urn:btih:81f6ee069ed7cfe1de374c4908aebb353928ab1d","amp;dn":"Syndromeda+-+Birth+of+a+Black+Hole+%28New+Age+1999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81f6ee069ed7cfe1de374c4908aebb353928ab1d","infoHashBuffer":{"type":"Buffer","data":[129,246,238,6,158,215,207,225,222,55,76,73,8,174,187,53,57,40,171,29]},"announce":[],"urlList":[]}}