{"title":"Benjamin Freedman Warns America (AMAZING Speech - Rare!)","uid":3425144,"size":17380664,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:83d4833062b14ab0da5b81c1645848b3d2c02def&amp;dn=Benjamin+Freedman+Warns+America+%28AMAZING+Speech+-+Rare%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1135752653,"description":"From Rense.com: &quot;Benjamin H. Freedman was one of the most intriguing and amazing individuals of the 20th century. Born in 1890, he was a successful Jewish businessman of New York City at one time principal owner of the Woodbury Soap Company. He broke with organized Jewry after the Judeo-Communist victory of 1945, and spent the remainder of his life and the great preponderance of his considerable fortune, at least 2.5 million dollars, exposing the Jewish tyranny which has enveloped the United States.\n \nMr. Freedman knew what he was talking about because he had been an insider at the highest levels of Jewish organizations and Jewish machinations to gain power over our nation. Mr. Freedman was personally acquainted with Bernard Baruch, Samuel Untermyer, Woodrow Wilson, Franklin Roosevelt, Joseph Kennedy, John F. Kennedy, and many more movers and shakers of our times.\n \nThis speech was given before a patriotic audience in 1961 at the Willard Hotel, Washington, D.C., on behalf of Conde McGinley's patriotic newspaper of that time, Common Sense. Though in some minor ways this wide-ranging and extemporaneous speech has become dated, Mr. Freedman's essential message to us -- his warning to the West -- is more urgent than ever before.&quot;\n\nYou can also read the entire transcript here: \n\nhttp://www.rense.com/general34/amaz.htm","torrent":{"xt":"urn:btih:83d4833062b14ab0da5b81c1645848b3d2c02def","amp;dn":"Benjamin+Freedman+Warns+America+%28AMAZING+Speech+-+Rare%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d4833062b14ab0da5b81c1645848b3d2c02def","infoHashBuffer":{"type":"Buffer","data":[131,212,131,48,98,177,74,176,218,91,129,193,100,88,72,179,210,192,45,239]},"announce":[],"urlList":[]}}