{"title":"ONLY ANGELS HAVE WINGS DVD9 ENG GER SPA ITA","uid":3495494,"size":6880651311,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:84004ee86f135cf5064a4678e25c952d0364b956&amp;dn=ONLY+ANGELS+HAVE+WINGS+DVD9+ENG+GER+SPA+ITA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jousmari","files":13,"time":1150322140,"description":"Director  \tHoward Hawks\nCast \tCary Grant, Jean Arthur, Richard Barthelmess, Rita Hayworth, Thomas Mitchell, Allyn Joslyn, Sig Ruman, Victor Kilian\nLength \t116 min\nDistributor \tSony Pictures\nDiscs \t1\nRegion \t2\nVideo \tPal\n1.33:1 , 4:3\nLanguages \tDolby Digital Mono: English, Spanish, German, Italian\nSubtitles \tArabic, Dutch, Spanish, English, French, German, Greek, Italian, Portuguese, Turkish\nSynopsis\n\nA two-fisted adventure tale set in South America, ONLY ANGELS HAVE WINGS stars Cary Grant as the tough-talking head of an air freight service operating in the dangerous Andes Mountains. Jean Arthur co-stars as a vacationing showgirl competing with Rita Hayworth for GrantÂ´s affections. A potent combination of humor, romance and action, the film was directed by Howard Hawks, the legendary director responsible for Red River, His Girl Friday, Bringing Up Baby, and the original Scarface. A triumph of casting, ONLY ANGELS HAVE WINGS is one of the best examples of Columbia chief Harry CohnÂ´s skill in developing talent. Cary Grant had just been released from his contract with Fox when Cohn, sensing that the handsome leading man was poised for stardom, turned him into ColumbiaÂ´s most durable star. Jean Arthur was an unexpected veteran of 50 films before Cohn &quot;discovered&quot; something in her that previous studios had overlooked. Teaming her with director Frank Capra, he created one of the finest comediennes in Hollywood history. And Rita Hayworth, CohnÂ´s personal protegee, was a pure product of the studio system. Groomed for stardom from the first, ONLY ANGELS HAVE WINGS offered her a chance to learn from the best in the business. And the rest, as they say, is history.\nOther features\n\nInteractive Menus, Scene Access, Black And White Film \n\nDVD9 NO COMPRESSION","torrent":{"xt":"urn:btih:84004ee86f135cf5064a4678e25c952d0364b956","amp;dn":"ONLY+ANGELS+HAVE+WINGS+DVD9+ENG+GER+SPA+ITA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84004ee86f135cf5064a4678e25c952d0364b956","infoHashBuffer":{"type":"Buffer","data":[132,0,78,232,111,19,92,245,6,74,70,120,226,92,149,45,3,100,185,86]},"announce":[],"urlList":[]}}