{"title":"Road to Jenin - Incredible Documentary","uid":3457887,"size":454760542,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8444c8519127ae06cc3872375e9bf9b36ebd8f40&amp;dn=Road+to+Jenin+-+Incredible+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dstorrents","files":1,"time":1142456115,"description":"&quot;The Road to Jenin&quot; reveals the true story of the events of Jenin in April 2002 during Operation Defensive Shield. The producer, Pierre Rehov, addresses the Palestinian false accusations.\n\nThis enlightening DVD documentary establishes clearly how false claims of a massacre committed by Israelis in Jenin were planned in advance.\n\nFurthermore, the documentary shows how the international community was wronged by a Palestinian scheme.\n\nIn the opening scene, see the bloody terrorist bombing of Netanya on Passover Seder which killed more than 20 Israeli civilians. Some men attempt to wash away the river of blood. A woman has lost her husband, her daughter and her son-in-law. In order to put an end to a chain of terrorist violence, the Israeli government launches Operation Defensive Shield.\n\nInterwoven interviews and archive footage recount the events of the battle of Jenin - soldiers slide through narrow streets, facing enemy fire. The fighting is harsh.\n\nIn the last section of the film, the film director, Pierre Rehov, travels to Jenin to interview Palestinians to get their side of the story - but Palestinian are caught in their own lies. For instance, a Palestinian journalist is caught staging a woman giving birth at a checkpoint. A Palestinian doctor shows a wing of the hospital that is suppose to have been destroyed by Israelis. Despite the tense atmosphere and the constant danger, Israeli soldiers assist Palestinians civilians. One soldier opens a can of food for an old lady who blesses him. A few other soldiers bring boxes of food to a Palestinian family and children.\n\nAccording to the U.N., the Palestinians losses amount to 52 -- 40 of whom were fighters; whereas the Israeli Army, Tsahal, lost 23 soldiers. Not even close to the Palestinians&amp;#039; accusation of a massacre.","torrent":{"xt":"urn:btih:8444c8519127ae06cc3872375e9bf9b36ebd8f40","amp;dn":"Road+to+Jenin+-+Incredible+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8444c8519127ae06cc3872375e9bf9b36ebd8f40","infoHashBuffer":{"type":"Buffer","data":[132,68,200,81,145,39,174,6,204,56,114,55,94,155,249,179,110,189,143,64]},"announce":[],"urlList":[]}}