{"title":"[audiobook] Daniel Quinn - Story of B","uid":3295535,"size":350956172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8547aa9eb1cbea921ffaa7ee43025771b1269e53&amp;dn=%5Baudiobook%5D+Daniel+Quinn+-+Story+of+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProjectPure","files":1,"time":1109455816,"description":"The Story of B begins with Jared Osborne, a priest of the Laurentians (an order under an ancient, covert mandate to stand watch against the coming of the Antichrist), being sent to Central Europe to investigate an itinerant preacher known to his followers only as B. When Father Osborne finally tracks B down, he is startled by the power and originality of his teachings. Pressed by his superiors for a judgment, Osborne is driven to penetrate B's inner circle, where he soon finds himself an anguished collaborator in the dismantling of his own religious foundations.\n\nContinuing the visionary journey begun in Ishmael, The Story Of B is a remarkable and provocative novel of intrigue involving the Antichrist and the hidden history of the world. \n\nNote:  This book, in it's print form, contains a list of lectures that have, for whatever reason, been omitted in the production of this audiobook.  My best advice is to purchace the book as a companion for this audiobook, for much of the meat and beans of this book rest in the lectures.  This is not to say that the book is unenjoyable without them, however to capture the full impact of this publication, the lectures are highly recomended. \n\n DOWNLOAD IT NOW!!!!","torrent":{"xt":"urn:btih:8547aa9eb1cbea921ffaa7ee43025771b1269e53","amp;dn":"%5Baudiobook%5D+Daniel+Quinn+-+Story+of+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8547aa9eb1cbea921ffaa7ee43025771b1269e53","infoHashBuffer":{"type":"Buffer","data":[133,71,170,158,177,203,234,146,31,250,167,238,67,2,87,113,177,38,158,83]},"announce":[],"urlList":[]}}