{"title":"Three Stooges 140-149(miss_148)","uid":3398974,"size":915106014,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:857f72bcaa979372b372c3fd8ca358e17f61d26e&amp;dn=Three+Stooges+140-149%28miss_148%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PeterL99","files":19,"time":1129769920,"description":"Dunked in the Deep (1949)\n\n    Director: Jules White\n    Cast: Gene Roth\n\n    The Three Stooges are tricked into becoming stowaways by their neighbor &quot;Borscht&quot;, a spy for an enemy country. Stranded on a freighter on the high seas, they discover that their friend has concealed some stolen microfilm in watermelons they brought aboard for him. After a wild chase, they subdue Borscht and recover the microfilm.\n--------------------------------------------------------------------------------\nPunchy Cow Punchers (1950)\n\n    Director: Edward Bernds\n    Cast: Jock Mahoney, Christine McIntyre, Dick Wessel, Kenneth MacDonald, Vernon Dent, Emil Sitka\n\n    Set in the old west, the Three Stooges are three soldiers assigned to go undercover and spy on an outlaw gang that's terrorizing a nearby town. The bad guys have the Arizona Kid locked up, so the boys set about rescuing him with the help of beautiful Nell, his girl. They free the kid, and he rides to summon help. The Three Stooges, with the help of Nell, manage to subdue the bad guys before the kid arrives with the cavalry.\n--------------------------------------------------------------------------------\nHugs and Mugs (1950)\n\n    Director: Jules White\n    Cast: Christine McIntyre, Kathleen O'Malley, Nanette Bordeaux, Emil Sitka\n\n    The Three Stooges run a furniture store and come into possession of a stolen pearl necklace. Three crooked dames convince the boys that the necklace is theirs, and when the real thieves arrive, the Three Stooges fight to defend the girl's property. The Three Stooges defeat the bad guys and the girls decide to go honest and return the necklace to its rightful owner.\n--------------------------------------------------------------------------------\nDopey Dicks (1950)\n\n    Director: Edward Bernds\n    Cast: Christine McIntyre, Stanley Price, Phil Van Zandt\n\n    The Three Stooges become detectives and go to the aid of girl in the clutches of a mad scientist. The boys arrive at a spooky mansion where the madman is building a mechanical man that needs a human head.  After declining the opportunity to supply a stooge-head for the experiment, they find the girl and escape, only to wind up in a car driven by the headless robot.\n--------------------------------------------------------------------------------\nLove at First Bite (1950)\n\n    Director: Jules White\n    Cast: Christine McIntyre, Yvette Reynard, Marie Monteil\n\n    The Three Stooges reminisce about the girls they met overseas while in the military. As they wait for the girls' ship to arrive, they get drunk and Shemp winds up asleep with his feet in a tub of cement. After sobering up, they free Shemp with a dynamite blast that lands them at the dock where their sweethearts are waiting.\n--------------------------------------------------------------------------------\nSelf Made Maids (1950)\n\n    Director: Hugh McCullom\n    Cast: (No supporting cast, the Three Stooges play all parts)\n\n    The Three Stooges are artists who want to marry their models &quot;Moella&quot;, &quot;Larraine&quot;, and &quot;Shempetta&quot;. The girls' father doesn't approve, so the Three Stooges tickle him into submission.\n--------------------------------------------------------------------------------\nThree Hams on Rye (1950)\n\n    Director: Jules White\n    Cast: Nanette Bordeaux, Emil Sitka, Christine McIntyre\n\n    The Three Stooges are stage hands who also have small parts in a big play. They quickly get on the bad side of the producer. First they fail to prevent a famous critic from sneaking into the audience. Then Shemp accidentally adds a pot holder into a cake they bake as a prop. During the play the Three Stooges (as southern gentlemen) and the rest of the cast spit up feathers during what was supposed to be a serious scene. The critic thinks it's a hilarious satire and the boys are redeemed.\n--------------------------------------------------------------------------------\nStudio Stoops (1950)\n\n    Director: Jules White\n    Cast: Kenneth McDonald, Vernon Dent, Christine McIntyre, Stanley Price\n\n    The Three Stooges are hired by a movie studio as publicity men. Their first assignment is to get publicity for Dolly Devore, a pretty starlet. They fake a kidnapping, but the cops won't believe their story. Then the girl is really kidnapped and the Three Stooges must come to the rescue. Shemp winds up hanging out a tenth story window on an extending telephone.\n--------------------------------------------------------------------------------\nA Snitch in Time (1950)\n\n    Director: Jules White\n    Cast: Jean Willes\n\n    The Three Stooges are carpenters who are re-staining some furniture they've delivered to a boarding house. The plot gets complicated when the boys confront some crooks who are hiding out there. They defeat the bad guys with the help of the varnished furniture which sticks the head crook to a chair.\n--------------------------------------------------------------------------------\nMISSING:\nSlap Happy Sleuths (1950)\n\n    Director: Hugh McCullom\n    Cast: Vernon Dent, Stanley Blystone, Gene Roth, Nanette Bordeaux, Emil Sitka\n\n    The Three Stooges are investigators for the Onion Oil company. The company's service stations are being robbed by a gang of crooks, so the boys pose as gas station attendants to capture the bad guys.\n","torrent":{"xt":"urn:btih:857f72bcaa979372b372c3fd8ca358e17f61d26e","amp;dn":"Three+Stooges+140-149%28miss_148%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857f72bcaa979372b372c3fd8ca358e17f61d26e","infoHashBuffer":{"type":"Buffer","data":[133,127,114,188,170,151,147,114,179,114,195,253,140,163,88,225,127,97,210,110]},"announce":[],"urlList":[]}}