{"title":"Farm Murders in South Africa","uid":3456611,"size":20965358,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8755adc7fae203938b0c08ed2d03a513dee76361&amp;dn=Farm+Murders+in+South+Africa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"harryreems","files":1,"time":1142191374,"description":"Farm Murders in South Africa\n\n\n\nThis is a must see. This excellent (and shocking) documentary was made in South Africa in 2003 and shown on one of the best news programs on South African TV: Carte Blanche. Of course in the politically correct South Africa of today, nobody can seriously assert that Farm Murders are planned and orchestrated by the Government. So the documentary of course, right at the end has to assert that this is not so. Nevertheless, much is shown on this program to indicate clearly, that what we have here is black on white attempted genocide. Officially, the most dangerous occupation in the world is to be a white South African farmer. \n\nThere is footage of blacks singing &quot;Kill the Farmer, Kill the Boer&quot; while government ministers sit in the front row saying nothing. \n\nThis is an excellent documentary showing clearly, tales of horror as blacks take delight in torturing whites endlessly before killing them - and one can see the trauma which results from this. \n\n\nFurther Note: Farm attacks have increased over the years and are now happening at twice the levels before - however, the better security precautions taken by farmers are resulting in annual murder rates remaining more or less the same (about 150 farmers being murdered per annum out of a total number of 60,000 farmers). At at Mid-2003, the death toll of murdered which South African farmers stands at: 1,400. \n\nThe entire documentary is 15 minutes long. It is presented here in a single segment.","torrent":{"xt":"urn:btih:8755adc7fae203938b0c08ed2d03a513dee76361","amp;dn":"Farm+Murders+in+South+Africa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8755adc7fae203938b0c08ed2d03a513dee76361","infoHashBuffer":{"type":"Buffer","data":[135,85,173,199,250,226,3,147,139,12,8,237,45,3,165,19,222,231,99,97]},"announce":[],"urlList":[]}}