{"title":"Gale Garnett &amp; Gentle Reign - Sausalito Heliport 1969","uid":3405453,"size":109330257,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:899c584fdd6cb0b31ad75da986b33980b036a300&amp;dn=Gale+Garnett+%26+Gentle+Reign+-+Sausalito+Heliport+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"buzzard","files":13,"time":1131185563,"description":"Gale Garnett &amp; Gentle Reign - Sausalito Heliport 1969\n\nsize:              104 mb\nbitrate:          320\n\nOn her pair of obscure late-'60s Columbia LPs, Gale Garnett had changed from the fairly middle-of-the-road pop-folk singer of the mid-'60s to one far more aligned with the pop/rock and psychedelia of the times. On the second of these, Sausalito Heliport, she was backed (as she had been on the first) by the Gentle Reign. Unfortunately, the general facelessness and purposeless eclecticism of the material and arrangements remained, leaving one to wonder just what Garnett might have accomplished had she been in a band with truly good songwriters. For the songs here aren't much to rave about, sometimes seeming like awkward attempts to get in on the California psychedelic rock action, with occasional downright embarrassing improvised-sounding lyrics on some of the more ambitious numbers. &quot;There is a flower and it is growing in your head, all you have to do is water it&quot; Garnett solemnly intones in &quot;Water Your Mind&quot;; you can just see Frank Zappa &amp; the Mothers of Invention gagging in the background. The six-minute &quot;Freddy Mahoney&quot; is an out-and-out awful satirical poke at straight family life with woefully unfunny spoken mock-dialogue that goes on and on for minutes after you wonder just how much more you can take of it. Letting it escape from the studio was bad enough; putting it as cut one, side one rates as willful self-sabotage. The rest of the record isn't as bad -- the bittersweet folk-rocker &quot;My Mind's Own,&quot; with its woozy reverberating guitar, is the standout. But on the whole it's mediocre kind-of-psychedelia that happens to have a good lead singer, kernels of half-decent ideas sometimes getting overwhelmed by pointless overlong passages within the same track; &quot;Deer in the City&quot; is nearly surreal in its hairpin turns between pastoral folk-psych and melodramatic orchestrated verses. &quot;Peace Comes Slowly to the Thrashing Fish&quot; is a title worth remembering the next time you're trying to cite some of the most absurd song titles of all time, though. ~ Richie Unterberger, All Music Guide\n\n Gale Garnett and the Gentle Reign (1969)\n Sausalito Heliport\n\nGale Garnett is an artist who will forever be associated with one particular song, We'll Sing in the Sunshine. That type of recognition is not necessarily deleterious, but it does tend to limit perception about the New Zealand born singer and her body of work.\n\nSausalito Heliport is a Gale Garnett album many would never anticipate. As expected her deep, powerful vocals are ever present; however, much of the material is rock... so tracks like This Year's Child are unexpectedly intriguing . In fact, some songs escape the confines of pop and actually encroach into the realm of sike... so much so there's room for speculation about the nature of the trip in The Trip Note Song. \n\nAs with all my recommended spins from this era, there's edge throughout the album which extends even to a ballad like The Mind's Own Morning. And, one suspects the nurturing within Water Your Mind requires a special sunshine. Sausalito Heliport may not be the Holy Grail of female rock, but it's far better than many of that genre's more heralded spins.\n\n[IMG]http://img470.imageshack.us/img470/2479/galegarnettheliportsleeve7dm.jpg[/IMG]\n\n1.  Freddy Mahoney\n 2.  Peace Comes Slowly\n 3.  To the Thrashing Fish\n 4.  Pretty Is Gone\n 5.  This Year's Child\n 6.  Berkeley Barb\n 7.  Water Your Mind\n 8.  My Mind's Own Morning\n 9.  Trip Note Song\n 10. Man In The Middle\n11. Freely Speaking   \n\nGale Garnett \tGuitar, Kazoo, Producer\nRob Fisher \tSynthesizer, Keyboards\nThe Gentle Reign \tSynthesizer, Vocals\nTony Hill \t                   Guitar, Percussion, Noise\nBruce Horiuchi \tOrgan, Piano\nPaul Robinson \tPercussion, Producer\nDick Rosmini \tGuitar","torrent":{"xt":"urn:btih:899c584fdd6cb0b31ad75da986b33980b036a300","amp;dn":"Gale+Garnett+%26+Gentle+Reign+-+Sausalito+Heliport+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899c584fdd6cb0b31ad75da986b33980b036a300","infoHashBuffer":{"type":"Buffer","data":[137,156,88,79,221,108,176,179,26,215,93,169,134,179,57,128,176,54,163,0]},"announce":[],"urlList":[]}}