{"title":"Gone.In.60.Seconds.1974.DVDR-HOBO","uid":3392524,"size":2473259577,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8ba54682f5febfb4e544c4a87b35a5848d48f270&amp;dn=Gone.In.60.Seconds.1974.DVDR-HOBO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Spacepig","files":54,"time":1128524932,"description":"Titel:Gone In 60 Seconds 1974\nSwedish Titel:Bl&amp;aring;st p&amp;aring; 60 sekunder\nSubtitles:None\nRuntime:105 min.\nDirector:H.B.Halicki\nStarring:Eleanor!\n\nPlot Synopsis:\nMaindrian Pace (H.B. Halicki) is a master car thief who heads an elaborate organization of professionals. Using an insurance investigation company \nas a front, Pace and his associates buy junked cars from accident scenes, steal new autos of the same model and color, then switch the serial numbers \nfor resale. It's a lucrative business, but when some shady characters offer them 400,000 dollars to deliver 50 specific luxury vehicles, the challenge \nis too much to pass up. The burglars put on disguises and waste no time in lifting limousines, official racecars, and Rolls-Royces \n(even stopping by a television studio to steal actor Lyle Waggoner's convertible). When Pace discovers that a recently stolen Cadillac has a million \ndollars worth of heroin in the trunk, he destroys the car and the drugs, which infuriates his adversarial partner, Eugene (Jerry Daugirda). \nJust as Pace is stealing a bright yellow Mustang (code-named Eleanor), the Los Angeles police department gives chase, \ntipped off by Eugene's anonymous call. This leads to the meat of the film, a wild 40-minute pursuit which takes Pace and the police through \nfive cities and leads to the destruction of 93 cars. Gone in 60 Seconds was a big hit for first time director/writer/producer/star H.B. Halicki, \nand inspired a big-budget remake in 2000. ? Fred Beldin\n\nReview: \nBeginning with the legend, &quot;H.B. Halicki Mercantile Co. &amp; Junk Yard Presents,&quot; the original Gone in 60 Seconds gets right to the heart of the matter \nas the opening credits roll, listing only the yellow Mustang named Eleanor as its star. Halicki was the owner of a successful body shop and salvage \nbusiness before entering the movie world, and single-handedly created this energetic orgy of car crashes and high-speed chases. Not only did Halicki \nhave control over the artistic and financial aspects of the production, but the maverick moviemaker performed most of the film's spectacular stunts as \nwell, smashing into police cars, garbage trucks, and even a highway light pole. This last unscripted collision was real, bringing the post down across the \nwindshield and almost killing the determined director. Knowing that Halicki was working without a net makes the cataclysmic 40 minute chase that much \nmore hair-raising. Some of the stunts were filmed illegally, without any kind of permits or police escort, and the slightest miscalculation could have taken \nout scores of unsuspecting bystanders. While car chases and crashes had long been staples of action pictures, Gone in 60 Seconds raised the bar and \npaved the way for the grotesque excess of future films like Smokey and the Bandit and The Blues Brothers. Unlike these cartoonish spectacles, \nhowever, Halicki doesn't shy away from the unpleasant aftermath of road accidents, including shots of ambulances helping wounded drivers to safety \nand firefighters battling blazing wrecks. That's not to say that Gone in 60 Seconds is a hard-boiled affair. The overall tone of the film is breezy, and \nMaindrian Pace's fractured morality helps keep the audience on his side. Since the hero restricts his stealing to insured vehicles, it's the insurance \ncompany and not the car owners who get screwed (or so the theory goes). Considering the years that Halicki spent in the auto salvage business, it's \npossible that the criminal plot that drives Gone in 60 Seconds began as a wicked fantasy that he was too honest to actually carry out. Instead, \nHalicki put the caper on film, let the action tell the story, and wound up with a serious drive-in hit. ? Fred Beldin\n\nNO MENUES!THIS IS A CONVERTED AVI!\n\n\nThe Hobo Group's intentions is to rip &amp; release cult &amp; classicmovies mainly from\nthe 60 ,70 &amp; 80:s without any crap or cosmetics for YOU who appriciate to download &amp; watch nonmainstream!\nGreetings from The Hobo.","torrent":{"xt":"urn:btih:8ba54682f5febfb4e544c4a87b35a5848d48f270","amp;dn":"Gone.In.60.Seconds.1974.DVDR-HOBO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba54682f5febfb4e544c4a87b35a5848d48f270","infoHashBuffer":{"type":"Buffer","data":[139,165,70,130,245,254,191,180,229,68,196,168,123,53,165,132,141,72,242,112]},"announce":[],"urlList":[]}}