{"title":"The Matrix Version 7.0 (The matrix 4)","uid":3437809,"size":345714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c8b151e33d67686d435fe3f3c94f03e238b5243&amp;dn=The+Matrix+Version+7.0+%28The+matrix+4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Shiva_3","files":1,"time":1138634111,"description":"Hello my name is Jess and I am a script writer.\n\nI have written a Script based on the Film Trilogy &quot;The Matrix&quot;, It is a continuance story to it. I think the last two matrix films were a bit of a disappointment, but these two film gave me the idea to write the script and turned it in the positive direction.\nI would like you people?s opinion on my vision of the trilogy, and how I have revile the truth of the matrix my own way. You can mail me for further information and the critics at: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a3c8cccbcce3d0cccf8dc7c8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n---------------------------------------\nSummery of my script:\n------------------------------------------\nNeo wakes up again after he was shot by Smith believing now that he is the One. Smith attacks Neo and is kicked away, only this time instead of Neo destroying Smith by getting into him, Neo answers the phone and get?s out of the Matrix.\n\nNext time Morpheus, Trinity, and Neo get connected to the Matrix, something goes wrong. Neo is connected but he is not inside the Matrix. Morpheus and Trinity search the Matrix, but they cannot find where he is, Neither the Oracle can be contacted.\n\nIn the script we reveal the secrets and truth of a lot of different characters and incidents that took place in the Matrix trilogy. Neo meets a man who is even more powerful the himself, he learns the truth that the Merovingian is not that bad after all, and is willing to help Neo in every possible way. He also learns the truth of the Oracle and the architect, that they just were using him.\n\nThese truths that Neo has learned has a consequence as well, he finds out that the Machine mainframe has a plan, a plan to destroy Zion and have the full control over the Matrix. Machine mainframe has grown even stronger then ever.  Neo and the others has only one option to stop all this from happening, They have to attack Machine city with every thing they have, and find the mainframe and reprogram it. But to do that they need a access code which no one has, or knows where to find it.\nPeople of Zion also find a island that has not been concord by machines and has the plan to move up there and start clearing the sky.\n\n- Will Zion and the Matrix be saved?\n\n- Will Neo and his friends find the access codes, and even if they do, has any one\n  in Zion the knowledge of reprogramming the mainframe, after all no human has come\n  near the machine city for centauries. \n\n- If Zion attacks machine city, have they any chance of winning the war anyway?\n\n- Who is this man Neo comes to meet?\n\n- Why is Merovingian so good to Neo suddenly and the Oracle refuse to help Neo and\n  his friends?\n\nThese and many more other questions are answered in my script, Hope to get you peoples feed back.\n---------------------------------\n------------------------------------\nThe original idea and most of the characters are copyrighted by Warner Bros, but the Matrix Version 7.0 story is mine alone.","torrent":{"xt":"urn:btih:8c8b151e33d67686d435fe3f3c94f03e238b5243","amp;dn":"The+Matrix+Version+7.0+%28The+matrix+4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c8b151e33d67686d435fe3f3c94f03e238b5243","infoHashBuffer":{"type":"Buffer","data":[140,139,21,30,51,214,118,134,212,53,254,63,60,148,240,62,35,139,82,67]},"announce":[],"urlList":[]}}