{"title":"Norton Systemworks 2006.iso","uid":3413352,"size":186726400,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d131a3708948f516d4dbeaafe091a66fe07d63f&amp;dn=Norton+Systemworks+2006.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jean harrache","files":1,"time":1132856001,"description":"Enjoy a fine-tuned computer with Norton SystemWorks? 2006. This multi-purpose solution keeps your computer healthy, preventing and solving many common problems. Its antivirus protection?the most trusted on the planet?keeps your computer safeguarded against damaging virus attacks and dangerous spyware. And if trouble does occur, Norton SystemWorks is there to help you recover. \n\n\nKey Features\nAutomatically removes viruses, Trojan horses, and worms. \nScans email and IM attachments for virus threats. \nAutomatically downloads updates to protect against new threats. \nOne-button Checkup scans your entire system for problems at the click of a mouse. \nIMPROVED! Restores your computer to a pre-crash state after system failures and other major problems. \nRecovers individual folders, files, and previous document versions?even if you forget to save them. \nIMPROVED! Cleans up unwanted cookies, cache, and temporary files that slow your computer's performance. \nAutomatically detects and fixes Windows problems. \nDefragments and optimizes your hard drive for better performance. \nNew Features\nOn-going Protection keeps your computer protected from the latest Internet risks by automatically renewing your subscription at the regular subscription price (plus applicable tax).* \nDetects and removes dangerous spyware, keystroke loggers, and other unwanted monitoring software. \nPrevents dangerous spyware programs from taking over your home page and redirecting you to their download sites. \nMonitors new software installations and reverses the process if the installation goes poorly or you decide you don't want the software. \nGives you control over the Windows settings and processes running on your system. \n","torrent":{"xt":"urn:btih:8d131a3708948f516d4dbeaafe091a66fe07d63f","amp;dn":"Norton+Systemworks+2006.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d131a3708948f516d4dbeaafe091a66fe07d63f","infoHashBuffer":{"type":"Buffer","data":[141,19,26,55,8,148,143,81,109,77,190,170,254,9,26,102,254,7,214,63]},"announce":[],"urlList":[]}}