{"title":"XBMC Xbox Media Center 1.1.0 2005-01-17 [Y]","uid":3278299,"size":29904963,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:8d682ad68fe1f0916d9734beecc46837c864e309&amp;dn=XBMC+Xbox+Media+Center+1.1.0+2005-01-17+%5BY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ythan","files":1,"time":1106035952,"description":"17-01-2004 added: some more startuplogging\n17-01-2004 fixed: Minor blackscreen issues when starting videos in some view modes (NB: Zoom is still not functioning in the overlay modes).\n17-01-2004 added: Combination Overlays/Pixel shader method (faster than just overlays, with the same (or better?) quality)\n17-01-2004 changed: Minor tweaks to the pixel shader YV12-&amp;gt;RGB coefficients.\n17-01-2004 removed: Slow overlays method as it gave no improvement in quality\n16-01-2004 changed: mplayer command for postprocessing, no quality changes\n16-01-2004 added: Option to add Film Grain on video\n16-01-2005 updated: Korean language file (Thnx to akoakoako)\n16-01-2005 updated: Polish language file (Thnx to napek)\n16-01-2005 fixed: CDDA playback broken\n15-01-2005 added: [ 1097508 ] Fix for FTP logging, new GetTime/DateFormat functions (Thanks to jarkkom). Logging is disabled by default, xbfilezilla will write a daily logfile to /xbmc/Logs/. To enable logging set &amp;quot;Enable logging&amp;quot; in &amp;quot;FileZilla Server.xml&amp;quot; to 1.\n14-01-2005 changed: extended asx parsing to support entryref tags and different tag-casing\n14-01-2005 added: [ 1097753 ] Updated XBMC masterlock/share lock code (Thanks to slacker)\n13-01-2005 fixed: Album thumbs don't show as icon for folder in listview\n13-01-2005 updated: Finnish language file (Thnx to jutski)\n13-01-2005 updated: Norwegian language file (Thnx to vnmartinsen)\n13-01-2005 fixed: [ 1039490 ] Fan speed reset to full speed on exit on 1.6 Xbox\n11-01-2005 fixed: LPCM audio from ex. Music Video DVD's would only create static.\n11-01-2005 fixed: Button scroller issues on homepage.\n11-01-2005 added: Third rendering method using overlays. Added purely to help find the reason behind the quality improvements gained from the previous overlay method. This new method is identical to the previous overlays method, except it uses mplayers builtin YV12-&amp;gt;YUY2 fast convertor. Further info will be available later today in the thread: http://www.xboxmediaplayer.de/cgi-bin/forums/ikonboard.pl?;act=ST;f=3;t=3916 NB: This output looks identical to my eyes as the output from the pixel shader.\n11-01-2005 changed: Webserver authentication now defaults to BASIC instead of DIGEST. Solves Firefox issues.\n10-01-2005 added: Second rendering method using overlays. Renderers can be switched from the GUI (Video Settings-&amp;gt;Filters). Known Issues: 1080i may not be 100% in terms of Aspect ratio - it hasn't been tested. Renderers cannot be switched on the fly - change will take effect at next movie play. Overlays method is much slower than the pixel shader method - reason is mostly to do with the software YV12-&amp;gt;YUY2 conversion done by mplayer.\n10-01-2005 fixed: [ 1059668 ] OSD and scene skip bug.\n10-01-2005 fixed: Slideshow info shows part of directory instead of filename in osd\n10-01-2005 fixed: subtitles wouldn't display if on CD/DVD\n09-01-2005 updated: Greek language file (Thnx to modon)\n09-01-2005 fixed: fullscreen video view mode info, soften setting for video was not displayed\n09-01-2005 updated: Chinese (Traditional) language file (Thnx to iikii)\n09-01-2005 updated: Chinese (Simple) language file (Thnx to iikii)\n09-01-2005 fixed: Pathes in progress dialog where not correctly shortened\n09-01-2005 changed: minor GUIThumbnailPanel performance tweaks\n09-01-2005 fixed: scanning smb shares the second time doesn't show the add/rescan dialog\n09-01-2005 fixed: audio skips once on startup of videos\n09-01-2005 fixed [ 1090730 ] Playback Of MP3 Files With @\n08-01-2005 fixed: playlist windows, current playing item disappears after using the context menu in it\n08-01-2005 changed: video/music info, smoother update of icons after getting information\n08-01-2005 fixed: thumb cache was not cleared\n08-01-2005 changed: minor GUIListControl performance tweaks\n08-01-2005 changed: minor guiImage &amp;amp; xprfont performance tweaks\n07-01-2005 changed: Removed TITLE mapping to playlist view in My Music and My Videos - it's on the context menu anyway.","torrent":{"xt":"urn:btih:8d682ad68fe1f0916d9734beecc46837c864e309","amp;dn":"XBMC+Xbox+Media+Center+1.1.0+2005-01-17+%5BY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d682ad68fe1f0916d9734beecc46837c864e309","infoHashBuffer":{"type":"Buffer","data":[141,104,42,214,143,225,240,145,109,151,52,190,236,196,104,55,200,100,227,9]},"announce":[],"urlList":[]}}