{"title":"Howard.Zinn-You.Can't.Be.Neutral.on.a.Moving.Train-INFOFALLOUT","uid":3392352,"size":812742863,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e34cd3da5f8da7298205bdb2487eac1202211dc&amp;dn=Howard.Zinn-You.Can%5C%27t.Be.Neutral.on.a.Moving.Train-INFOFALLOUT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"infofallout","files":5,"time":1128481142,"description":"TITLE:         Howard Zinn: You Can't Be Neutral on a Moving Train\n\nSOURCE:        DVD\nRIPPER:        Howie Z.\n\nBITRATE:       1097 kbps\nAIR DATE:      -unknown-\n\nCODEC:         XviD 1.0.3\nRLS DATE:      10/04/2005\n\nSIZE:          700 MB\nRUNTIME:       78 mins\n\nRELATED URL:   http://www.imdb.com/title/tt0416825/\n\n  In these turbulent times, Howard Zinn is inspiring a new generation. This acclaimed film looks at the amazing life of the renowned historian, activist and author. Following his early days as a shipyard labor organizer and bombardier in World War II, Zinn became an academic rebel and leader of civil disobedience in a time of institutionalized racism and war. His influential writings shine light on and bring voice to factory workers, immigrant laborers, African Americans, Native Americans, and the working poor.\n\n  Featuring rare archival materials and interviews with Zinn and colleagues such as Noam Chomsky, You Can't Be Neutral Captures the essence of this extraordinary man who has been a catalyst for progressive change for more than 60 years.  As Chomsky said, Zinn is &quot;a model and inspiration for those who seek justice and peace. His contributions are truly incomparable.&quot;\n\n\n\n  the actual film is 700mbs, however we have included three extras from the dvd, which (together) take up 75mbs. if you're only interested in the film itself, feel free to set your client not to download them. included is an unedited interview with zinn, as well as footage from one of his recent live speeches. in addition, there a brief (somewhat humorous) video short called Berkley In The Sixties, that we thought you might like. extras are encoded at a lesser bitrate than the film themselves, however are still entirely watchable. don't complain; they're &quot;extras.&quot;","torrent":{"xt":"urn:btih:8e34cd3da5f8da7298205bdb2487eac1202211dc","amp;dn":"Howard.Zinn-You.Can%5C%27t.Be.Neutral.on.a.Moving.Train-INFOFALLOUT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e34cd3da5f8da7298205bdb2487eac1202211dc","infoHashBuffer":{"type":"Buffer","data":[142,52,205,61,165,248,218,114,152,32,91,219,36,135,234,193,32,34,17,220]},"announce":[],"urlList":[]}}