{"title":"Cobra 1 1","uid":3317100,"size":100570,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:8e8a95b66ac87c3fe531ded014e1e8f993e46411&amp;dn=Cobra+1+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"endzeit","files":1,"time":1113558024,"description":"\n                                Â°         Â°             Â°\n ÃšÃ„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Â¿\n Â³X           Â°Ã›ÃŸÃœÃœ  Â°Ã›ÃŸÃŸ ÃœÃ›ÃŸÃŸ Â²Ã›ÃŸ   ÃŸÃŸÃœ Â²Ã›  Â°ÃœÃŸÃ› Â°Ãœ Ã› Â²Ã›ÃŸÃ› Â°Ã›ÃŸÃŸ           XÂ³\n Â³            Ã›Ã› Ã› Ã› Ã›Ã›ÃŸ  Ã›Ã› Ã› Ã›Ã›   Â²Ã›ÃŸÃ› Ã›Ã›  Ã›Ã› Ãœ Ã›Ã› Ã› Ã›Ã› Ã› Ã›Ã›ÃŸ             Â³\n Â³    Â° Â± Â² Ã› Â²Ã› Â² Ã› ÃŸÃ›Â²Ã› Ã›Ã› Â² ÃŸÃ›Â²Â± ÃŸÃ›Ã›Â² ÃŸÃ›Ãœ ÃŸÃ›Â²Ã› ÃŸÃ›Â²Ã› Ã›Ã›Â²ÃŸ ÃŸÃ›Â²Ã› Ã› Â² Â± Â°    Â³\n ÃƒÃ„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Â´\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³                        - COBRA FOR VIPER GC V1.1 -                       Â³\n Â³                                                                          Â³\n Â³                            14th of april, 2005                           Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  WHAT'S NEW ?                                                            Â³\n Â³                                                                          Â³\n Â³  - Built-in Audio Fix, that could be Enabled/Disabled in the Config      Â³\n Â³    Menu for full backward compatibility with your old backups.           Â³\n Â³  - Music Player in Disc Explorer! Select an audio file to play it. For   Â³\n Â³    now only ADPCM audio streams are supported (*.ADP, *.PCM, *stream*,   Â³\n Â³    etc.), the GC streaming format. Support for more formats, including   Â³\n Â³    MP3, is coming in a next release.                                     Â³\n Â³  - Optimal DRE Handling, read more below.                                Â³\n Â³  - Improved Direct Boot mode Compatibility, now it should be compatible  Â³\n Â³    with every good media, including DVD+R.                               Â³\n Â³  - No need to enter Disc Explorer anymore to boot MultiBoot discs, just  Â³\n Â³    select Direct Boot Disc and the Cobra BIOS will detect automatically  Â³\n Â³    if you inserted a GC Original, DVD-R, DVD+R or MultiBoot Disc !       Â³\n Â³  - Fixed a MultiBoot compatibility problem. Now it should work properly  Â³\n Â³    with every images.                                                    Â³\n Â³  - Upgrade with the Disc Explorer from Cobra 1.0 if you want to keep     Â³\n Â³    your AR codes and configuration intact.                               Â³\n Â³  - And some more bugfixes/changes                                        Â³\n Â³                                                                          Â³\n Â³  About Disc Read Error handling, we can't help you if you use a bad      Â³\n Â³  burner, media or if your laser is not tweaked correctly. But we've      Â³\n Â³  improved the error handling code A LOT. Here is a small experiment      Â³\n Â³  we don't recommend trying at home, except if you know what youre doing: Â³\n Â³  You can remove the spinning disc for one second while it's playing a    Â³\n Â³  movie or loading data. This will trigger some serious read error with   Â³\n Â³  any other BIOS :-) Now put the disc back in quickly and it will         Â³\n Â³  continue loading, without a crash!                                      Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  FEATURES                                                                Â³\n Â³                                                                          Â³\n Â³  - Direct boot of all media, without swapping!                           Â³\n Â³  - Automatic Media Detection: Insert disc, turn on GC and play!          Â³\n Â³  - Supports all regions PAL / USA / JAP                                  Â³\n Â³  - Play originals or backups from any region, thanks to the built-in     Â³\n Â³    region-free feature                                                   Â³\n Â³  - Built-in Audio Fix, that could be Enabled/Disabled in the Config      Â³\n Â³    Menu for full backward compatibility with your old backups.           Â³\n Â³  - Idle-bug free (no more Disc Read Errors when the drive is resting :-) Â³\n Â³  - Unique MultiBoot feature: put several games on one single disc!       Â³\n Â³  - Disc Explorer to browse the content of original GC discs or DVDs and  Â³\n Â³    that allows you:                                                      Â³\n Â³      - To flash your Viper GC by burning the flash file on a DVD         Â³\n Â³      - To execute homebrew programs (.DOL) from DVD, and enjoy many      Â³\n Â³        already-released homebrew productions!                            Â³\n Â³      - To play music, for now only ADPCM files aligned on a 32kb         Â³\n Â³        boundary are accepted. This is the format of all GC games that    Â³\n Â³        are using audio streaming, so listen to those games songs!        Â³\n Â³      - To run the game you want from a MultiBoot compilation             Â³\n Â³      - To load cheat codes from disc into Viper GC Memory                Â³\n Â³  - Powerful Cheat Code System compatible with Action Replay codes,       Â³\n Â³    codes are stored in the Viper GC Flash so no memory card is needed!   Â³\n Â³  - Cheat codes can be either entered using Cobra Menus or loaded from    Â³\n Â³    a file using the Disc Explorer                                        Â³\n Â³  - BIOS Configuration stored into the Viper GC Flash                     Â³\n Â³  - Selectable default boot action (Main menu, Boot disc, Original BIOS,  Â³\n Â³    Disc Explorer) and special boot action (when the X key is held)       Â³\n Â³  - Calls Original BIOS Game Loader for 100% compatibility                Â³\n Â³  - Supports all hardware revisions (including DOL-101 units)             Â³\n Â³  - User-Friendly GUI                                                     Â³\n Â³                                                                          Â³\n Â³  A Swap disc option was left in (called &amp;quot;Change Disc&amp;quot; as you could also  Â³\n Â³  replace a backup with another backup) to be totally backward            Â³\n Â³  compatible. Read more below                                             Â³\n Â³                                                                          Â³\n Â³  So what do you need exactly ?                                           Â³\n Â³     - A Viper GC chip                                                    Â³\n Â³     - This very flash file                                               Â³\n Â³     - Some Compatible Media and a DVD-burner                             Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  USER MANUAL                                                             Â³\n Â³                                                                          Â³\n Â³   - If you want to use full-size DVD-R you can remove the top of the     Â³\n Â³     console. Team Xtender will be releasing replacement lids compatible  Â³\n Â³     with full DVD-R within two week. Best of all, we learned this week   Â³\n Â³     that they will be officially Viper GC branded!                       Â³\n Â³                                                                          Â³\n Â³   - Flash the Viper GC with this BIOS then remove the parallel port      Â³\n Â³     connector from the programmer. If you prefear you can flash this     Â³\n Â³     BIOS from DVD if you have Cobra 0.3+ already running on your chip.   Â³\n Â³     We've heard Viper Team will release an USB programmer for the chip   Â³\n Â³     soon if you prefear USB.                                             Â³\n Â³                                                                          Â³\n Â³   - Turn on your GC with the disc you want to run. It can be an          Â³ \n Â³     original or a backup, but if it's a backup it should be filled with  Â³ \n Â³     1.3GB of data at least (for now). If you have a black screen coming, Â³\n Â³     it's probably beause your Viper installation is not clean.           Â³\n Â³                                                                          Â³\n Â³   - While turning on your GC:                                            Â³\n Â³        - Hold Y to go to Main Menu (if it's not your Default Boot mode)  Â³\n Â³        - Hold X for the other boot mode (can be set in Config Menu)      Â³\n Â³        - Don't hold anything for Default Boot Action                     Â³\n Â³                                                                          Â³\n Â³   - Select &amp;quot;Direct Disc Boot&amp;quot; if you want to play a backup or homebrew   Â³\n Â³     program from DVD. If you have problems using the Direct Disc Boot    Â³ \n Â³     method with your media, you can still use the Swap trick.            Â³\n Â³                                                                          Â³\n Â³   - If you want to use the old Swap Trick Method (for discs that are     Â³\n Â³     not full or that have problems to sync with the Direct Disc Boot)    Â³\n Â³     boot your GC with an original disc. Then choose the &amp;quot;Change Disc&amp;quot;    Â³\n Â³     option and follow the instructions. After the swap is done, you      Â³\n Â³     can select Direct Disc Boot option again.                            Â³ \n Â³                                                                          Â³\n Â³   - Select &amp;quot;Original BIOS&amp;quot; if you want to play an original Game          Â³\n Â³     compatible with your GC region, or if you want to go into the        Â³\n Â³     Original BIOS menus.                                                 Â³\n Â³                                                                          Â³\n Â³   - Select &amp;quot;Configuration Menu&amp;quot; if you want to change your Cobra BIOS    Â³\n Â³     configuration. The options are quite self-explanatory.               Â³\n Â³                                                                          Â³\n Â³   - Select &amp;quot;Disc Explorer&amp;quot; to enter to browse the content or your        Â³\n Â³     original GC discs or DVDs. Supported file systems are FST            Â³\n Â³     (GC File System) and ISO9660. Joliet encoding is not supported in    Â³ \n Â³     ISO mode.                                                            Â³\n Â³                                                                          Â³\n Â³   - Enter &amp;quot;Cheat codes&amp;quot; to select, enable, disable and edit cheat codes  Â³\n Â³                                                                          Â³\n Â³   - Enter &amp;quot;Disc Explorer&amp;quot; and select a .VGC file if you want to reflash  Â³\n Â³     your Viper GC without the need of the Parallel port programmer!      Â³\n Â³                                                                          Â³\n Â³   - Enter &amp;quot;Disc Explorer&amp;quot; and select a .DOL file if you want to run      Â³\n Â³     a homebrew program! (You can put up to 1.4 GB of homebrew things on  Â³\n Â³     a disc. We hope this will give some inspiration to emu authors :-)   Â³\n Â³     Our DOL loader is not perfect for now and works for around half of   Â³\n Â³     the public homebrew programs. Here are some of the programs booting  Â³\n Â³     successfully:                                                        Â³\n Â³     GC-Linux, Ascii Fighter, DVD Browser, CTR_GCS, CTR_SND, GBQ Gameboy  Â³\n Â³     emulator, PSOLoader &amp;quot;It's working&amp;quot; demo, Maze, Nitrorally,  Yeti 3D  Â³\n Â³     3D engine, Chip8 emulator, Snowlords game, Terranigma, XRick and     Â³\n Â³     probably many we missed!                                             Â³\n Â³                                                                          Â³\n Â³   - Enter &amp;quot;Disc Explorer&amp;quot; and select a .VGC file if you want to reflash  Â³\n Â³     your Viper GC without the need of the Parallel port programmer!      Â³\n Â³                                                                          Â³\n Â³   - Enter &amp;quot;Disc Explorer&amp;quot; and select a .COD file if you want to add      Â³\n Â³     cheat codes for a game without the need to enter it using the pad!   Â³\n Â³                                                                          Â³\n Â³   - Make sure that the &amp;quot;lid passthru&amp;quot; wires of the Viper GC are          Â³\n Â³     installed correctly or the disc won't spin.                          Â³ \n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  DIRECT BOOT LIMITATIONS                                                 Â³\n Â³                                                                          Â³\n Â³  THE MEDIA                                                               Â³\n Â³                                                                          Â³\n Â³  The GC drive in its default state only eats high-quality DVD-R and      Â³\n Â³  a few MINI-DVD-R. But a couple of weeks ago, speedi from the afterdawn  Â³\n Â³  forums found a nice way to tweak the laser so it reads almost any burnedÂ³\n Â³  media including some DVD+Rs. We recommend doing this laser tweak if you Â³\n Â³  have any problems reading your DVDs. We are no laser experts, in fact   Â³\n Â³  we think it would be more appropriate to just lower the value of the    Â³\n Â³  variable resistor instead of setting it to an absoulte given value,     Â³\n Â³  but lots of people including us have been using this laser tweek for a  Â³\n Â³  couple of weeks without any problem reported so far. For more info on   Â³\n Â³  laser tweaking please read this forum post:                             Â³\n Â³     http://forums.afterdawn.com/thread_view.cfm/138930                   Â³\n Â³                                                                          Â³\n Â³  You don't need to encrypt the disc or use a special burner firmware     Â³\n Â³  to write the disc. Just burn your ISO/GCM (rename it to .ISO) with      Â³\n Â³  Nero (or any other tool).                                               Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  CHEAT CODES                                                             Â³\n Â³                                                                          Â³\n Â³  If you want to use cheat codes, enter Cheat Codes menu,select a game,   Â³\n Â³  check the codes you want to use, exit the cheat selector and enable     Â³\n Â³  cheats.                                                                 Â³\n Â³                                                                          Â³\n Â³  To add new codes follow on-screen instructions. The codes are           Â³\n Â³  compatible with decrypted AR codes. You can decrypt AR codes using      Â³\n Â³  the great GCNCrypt by Parayste. Never enter the first code of a given   Â³\n Â³  cheat code (validator code). You can also put .COD files on a DVD and   Â³\n Â³  load cheat codes from there, each file corresponds to one game.         Â³\n Â³                                                                          Â³\n Â³  Cheat codes are working for backups and original games.                 Â³\n Â³                                                                          Â³\n Â³  For now we've reserved 4kb in Viper GC Flash memory to store cheat      Â³\n Â³  codes, that should be enough to store a few hundred of codes.           Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  TROOBLESHOOTING                                                         Â³\n Â³                                                                          Â³\n Â³  - If the disc stops spinning in the menu it means that the drive can't  Â³\n Â³    sync with your media, or that there are not enough data on your disc. Â³\n Â³    In direct boot mode the GC is very selective about the media it       Â³\n Â³    takes. If you have any problem please try the swap trick. If you      Â³\n Â³    still have problems try with different media/burner. Make sure your   Â³\n Â³    laser is correctly tweaked! We strongly recommend NEC burners, they   Â³\n Â³    produce really good discs that won't give you any DRE.                Â³\n Â³                                                                          Â³\n Â³  - Audio Streaming: Some games use a special audio streaming mode        Â³\n Â³    that can be compared to CDDA. For now, the ISO of the file needs to   Â³\n Â³    be patched with 0rbital's great ViperTemporaryAudioFix 1.1+. If the   Â³\n Â³    ISO is not patched you'll have noise instead of music. We will try to Â³\n Â³    fix this issue so no patching is required. But in case we do, YOUR    Â³\n Â³    PATCHED ISOS WILL BE FULLY COMPATIBLE and still work with music!      Â³\n Â³    (so forget what is written in the fixer nfo file). Don't run the fix  Â³\n Â³    on ISOs that don't need fixing as it will only destroy them :-)       Â³\n Â³                                                                          Â³\n Â³  - Most multi-discs games are working, just play with Disc 1 until       Â³\n Â³    you're asked to change disc and make a save here. Then boot with      Â³\n Â³    Disc 2 instead. We started working on code to allow disc-change,      Â³\n Â³    and we'll integrate it in a new release.                              Â³\n Â³                                                                          Â³\n Â³  All those problems could be fixed in a next update.                     Â³\n Â³                                                                          Â³\n Â³  Before burning an image, makes sure it is 1459978240 bytes long else    Â³\n Â³  you may need to use the swap trick method.                              Â³\n Â³                                                                          Â³\n Â³  To know what's your GC Version code (2 digit number) go into Config     Â³\n Â³  Menu, then Version Info, 2nd page. First digit corresponds to GC        Â³\n Â³  mobo version, 2nd digit corresponds to drive version.                   Â³\n Â³                                                                          Â³\n Â³  IF YOU MAKE BACKUPS, DON'T USE ANY &amp;quot;WIPE&amp;quot; TOOLS TO SAVE SPACE. Unless   Â³\n Â³  you know it's REALLY working. Most of thoses tools only work because    Â³\n Â³  the current pso loaders patch libraries routines to emulate DVD. But    Â³\n Â³  on REAL HARDWARE, each file/fst has to be aligned on a 4-byte boundary! Â³\n Â³  Else nothing will work. Audio Files (for audio streaming) even need     Â³\n Â³  to be aligned on a 32kb-boundary ! So forget current &amp;quot;WIPE&amp;quot; tools until Â³\n Â³  they are fixed. But note that Garbage is NOT NEEDED by the GC. The      Â³\n Â³  files must be correctly aligned that's it. So if your &amp;quot;WIPE&amp;quot; tool is    Â³\n Â³  not changing the image size (meaning there's no relocation) then it's   Â³\n Â³  probably fine. Use FSTFIX by LOONYCUBE to fix bad rips.                 Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  TECHNICAL INFO                                                          Â³\n Â³                                                                          Â³\n Â³  We'll release a command-line MultiBoot Disc maker next week if nobody   Â³\n Â³  releases a better one before we do :-) Here are the specs for Multiboot Â³\n Â³  discs. Note that every image should be aligned on a 32kb boundary.      Â³\n Â³  At offset 0x00: 43 4F 42 52-41 4D 42 31                                 Â³\n Â³            0x40: Position of the 1st image in bytes (Big endian)         Â³\n Â³            0x44: Position of the 2nd image in bytes (Big endian)         Â³\n Â³            ....: ...etc...                                               Â³\n Â³            ....: 00 00 00 00                                             Â³\n Â³                                                                          Â³\n Â³  The MultiBoot feature is stealth for the GC so it's 100% compatible     Â³\n Â³  with homebrew images. If you want to put several backups on one disc    Â³\n Â³  you'll have to remove the garbage at first.                             Â³\n Â³  The maximum size of a MultiBoot disc is 1459978240 bytes.               Â³\n Â³                                                                          Â³\n Â³  You can use Viper_Multi_Boot_ISO_Creator by LoonyCube to create         Â³\n Â³  MultiBoot discs easily.                                                 Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  THE FUTURE                                                              Â³\n Â³                                                                          Â³\n Â³  Much more to come :-)                                                   Â³\n Â³                                                                          Â³\n Â³                                                                          Â³\n Â³  CLOSING WORDS                                                           Â³\n Â³                                                                          Â³\n Â³  Special thanks to E*Flash for his help, RoM for the early units,        Â³\n Â³  Melan for the /48 GC and to everybody that tried Cobra V1.0 and posted  Â³\n Â³  constructive feedback.                                                  Â³\n Â³                                                                          Â³\n Â³  You are free to redistribute this package as long as it's not changed,  Â³\n Â³  patched, ported, or whatever.                                           Â³\n Â³                                                                          Â³\n Â³  Our code is free of any copyrighted code from third party.              Â³\n Â³  It is also free of any GPL licensed code, we have strong respect for    Â³\n Â³  other people's hard work. We only ask you to show similar respect       Â³\n Â³  toward our work. To put it in other words, if you are in the &amp;quot;right&amp;quot;    Â³\n Â³  side, draw the line between learning and stealing. Thank you.           Â³\n Â³                                                                          Â³\n Â³  Enjoy!                                                                  Â³\n Â³                                                                          Â³\n Â³                              Â°         Â°             Â°                   Â³\n ÃƒÃ„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„ Â±Â² Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Â´\n Â³            Â°Ã›ÃŸÃœÃœ  Â°Ã›ÃŸÃŸ ÃœÃ›ÃŸÃŸ Â²Ã›ÃŸ   ÃŸÃŸÃœ Â²Ã›  Â°ÃœÃŸÃ› Â°Ãœ Ã› Â²Ã›ÃŸÃ› Â°Ã›ÃŸÃŸ            Â³\n Â³            Ã›Ã› Ã› Ã› Ã›Ã›ÃŸ  Ã›Ã› Ã› Ã›Ã›   Â²Ã›ÃŸÃ› Ã›Ã›  Ã›Ã› Ãœ Ã›Ã› Ã› Ã›Ã› Ã› Ã›Ã›ÃŸ             Â³\n Â³X   Â° Â± Â² Ã› Â²Ã› Â² Ã› ÃŸÃ›Â²Ã› Ã›Ã› Â² ÃŸÃ›Â²Â± ÃŸÃ›Ã›Â² ÃŸÃ›Ãœ ÃŸÃ›Â²Ã› ÃŸÃ›Â²Ã› Ã›Ã›Â²ÃŸ ÃŸÃ›Â²Ã› Ã› Â² Â± Â°   XÂ³\n Ã€Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã™","torrent":{"xt":"urn:btih:8e8a95b66ac87c3fe531ded014e1e8f993e46411","amp;dn":"Cobra+1+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e8a95b66ac87c3fe531ded014e1e8f993e46411","infoHashBuffer":{"type":"Buffer","data":[142,138,149,182,106,200,124,63,229,49,222,208,20,225,232,249,147,228,100,17]},"announce":[],"urlList":[]}}