{"title":"Three Stooges 130-139","uid":3398000,"size":1093395002,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f2ec301ec0652c0d47d62ec9b9f35e10d27f073&amp;dn=Three+Stooges+130-139&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeterL99","files":20,"time":1129576332,"description":"I'm A Monkey's Uncle (1948)\n\n    Director: Jules White\n    Cast: Dee Green, Virginia Hunte\n\n    Set in the stone age, the Three Stooges are cavemen who must have various misadventures hunting, gathering, and otherwise coping with prehistoric life.  When some other cavemen threaten to take their women (&quot;Aggie&quot;, &quot;Maggie&quot;, and &quot;Baggy&quot;), the boys fight them off with a catapulting tree branch that shoots rocks and eggs.\n--------------------------------------------------------------------------------\nMummies Dummies (1948)\n\n    Director: Edward Bernds\n    Cast: Dee Green, Ralph Dunn, Phil Van Zandt\n\n    Set in ancient Egypt, the Three Stooges run a used chariot lot where they unload defective chariots on unsuspecting customers. When they gyp the head of the palace guard, they're brought to the palace to be; executed, but instead become royal chamberlains after curing the King's toothache. When they recover some tax money stolen by a corrupt official, the King rewards them with marriage to his; daughter. After getting a look at the ugly crone, Moe and Larry select Shemp to be the groom.\n--------------------------------------------------------------------------------\nCrime on Their Hands (1948)\n\n    Director: Edward Bernds\n    Cast: Kenneth McDonald, Christine McIntyre, Charles C. Wilson, Lester Allen\n\n    The Three Stooges are janitors working in a newspaper office. When an anonymous caller phones in a tip about the theft a famous diamond, the boys decide to become reporters and go after the crooks. They find the crooks, but Shemp accidentally swallows the diamond which was hidden in a bowl of candy. The crooks want to cut the diamond out, but the boys foil them with the help of a friendly gorilla.\n--------------------------------------------------------------------------------\nThe Ghost Talks (1949)\n\n    Director: Jules White\n    Cast: The Three Stooges\n\n    The Three Stooges are movers for an express company and on a rainy night are sent to move some junk, including a suit of armor, from a spooky old house. The armor is haunted by the ghost of Peeping Tom, who; has no intention of leaving. The ghost foils the Three Stooges attempts to take the armor, until Lady Godiva shows up and the two ride off together\n--------------------------------------------------------------------------------\nWho Done it? (1949)\n\n    Director: Edward Bernds\n    Cast: Christine McIntyre, Emil Sitka\n\n    The Three Stooges are private detectives looking for a missing millionaire. They wander around the millionaire's spooky mansion confronting various crooks and a dangerous dame. The Three Stooges vanquish the crooks (Shemp uses his &quot;trusty shovel&quot;) and find the missing man.\n--------------------------------------------------------------------------------\nHokus Pokus (1949)\n\n    Director: Jules White\n    Cast: Mary Ainslee, Vernon Dent, Jimmie Lloyd\n\n    The Three Stooges are taking care of their invalid friend Mary who is confined to wheelchair. What they don't is that Mary is only faking her disability to swindle the insurance company. When the boys witness a hypnotist, &quot;The Great Svengarlic&quot;, doing his act on the street, they think he might be able to hypnotize Mary so she can walk. Instead, they become subjects for his show and are hypnotized into walking out on a flagpole high above the ground. When they come out of their trance and realize their predicament, they fall into a window, startling Mary, who jumps from her wheelchair just as the insurance adjuster is about to hand her a check.\n--------------------------------------------------------------------------------\nFuelin Around (1949)\n\n    Director: Edward Bernds\n    Cast: Jock Mahoney, Emil Sitka, Vernon Dent, Christine McIntyre, Phil Van Zandt\n\n    The Three Stooges are carpet layers working in the home of a scientist, Professor Sneed, who has invented a super rocket fuel.  Larry is mistaken for the professor by foreign agents who kidnap the trio and take them to the country of Anemia where they are ordered to produce the rocket fuel or be executed.  The boys come up with a concoction they try to pass of as the real stuff, but are exposed when the real professor and his daughter are also kidnapped.  The Three Stooges help them escape, using their secret formula to fuel a jeep.\n--------------------------------------------------------------------------------\nMalice in the Palace (1949)\n\n    Director: Jules White\n    Cast: George Lewis, Frank Lackteen, Vernon Dent\n\n    Set in a desert land where the Three Stooges run a restaurant, the boys set out to recover the stolen Rootin Tootin diamond after they learn from the thieves that the Emir of Shmo has absconded with the contraband jewel. They journey to the stronghold of Shmo where they disguise as Santa Clauses and scare the ruler into giving them the diamond.\n--------------------------------------------------------------------------------\nVagabond Loafers (1949)\n\n    Director: Edward Bernds\n    Cast: Christine McIntyre, Kenneth MacDonald, Symona Boniface, Emil Sitka, Dudley Dickerson, Herbert Evans\n\n    The Three Stooges are the &quot;Day and Night&quot; plumbers. Called out to a fancy mansion where a society party is going on, they cross the electrical and water systems and generally ruin the place. Despite their incompetent plumbing, they save the day by recovering a painting stolen by a pair of thieves masquerading as party guests.\n--------------------------------------------------------------------------------\nJerks of All Trades(1949)\n\nJerks is a 1949 kinescope pilot film. Filmed before a live audience,\nthe Stooges are painters that wreck a hapless couples home. Emil Sitka\nis the homeowner. Enjoy.\n\nDate released: 10/12/1949\nFeaturing: Moe, Larry and Shemp\nLength: 20 min\n\nMoe, Larry and Shemp are three bumbling interior decorators \nwho manage to trash their clients' homes.\nThis was filmed before a live, studio audience as a pilot for \na planned TV series on ABC, which, unfortunately, was never \npicked up. Actor Joseph Kearns (the original Mr. Wilson on \nTV's DENNIS THE MENACE) appears in a cameo role as a presure-\ncooker salesman from Punxatawney, Pennsylvania. The following \ntext is from the book, THE THREE STOOGES SCRAPBOOK, written \nby Joan Howard Maurer and Jeff and Greg Lendburg. &quot;The pilot, \nwhich took one day to film, was never aired. B.B. Kahane, \nColumbia Picture's Vice-President of Business Affairs, stopped \nthe show from being broadcast. Kahane warned the Stooges that \na contract stipulation restricted them from performing in a \nTV series that might compete with their two-reel comedies. \nColumbia further threatened to cancel the boys' contract and \ntake them to court if they tried to sell the series. To avert \na legal hassel, the pilot was shelved and the project abandoned.&quot; \n\nStooge Goofs &amp; Technical Blunders \n\nVisible cue\nAt the beginning, you can see Moe looking off- camera for his cue \non when to say his first line. \n\nMissed cue\nSymona Boniface misses her cue for when to say &quot;Hello&quot; on the phone \nwhen she's speaking to Moe. \n\nProp mishap\nWhen Larry is supposed to hang the wallpaper up as a curtain, he has \ntrouble doing so and causes the bit to go on too long, so he ad-libs \n&quot;You gotta use your head to get this thing up here!&quot;, cueing Shemp \nto start goin on with the next bit where he paints the wall with his \npaintbrush-hat. \n\nWrong cabinet\nWhen Moe ducks right before the top cabinet is supposed to open, the \n2nd to top cabinet is accidentally pushed open instead, and it bangs \nright into the side of Moe's head. You can see Moe awkwardly pausing \nfor a few seconds before continuing with the bit. \n\nProp mishap\nWhen the cabinet is supposed to open automatically and knock Moe and \nLarry down, it doesn't open far enough, so the crew member had to push \nit again. \n","torrent":{"xt":"urn:btih:8f2ec301ec0652c0d47d62ec9b9f35e10d27f073","amp;dn":"Three+Stooges+130-139","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f2ec301ec0652c0d47d62ec9b9f35e10d27f073","infoHashBuffer":{"type":"Buffer","data":[143,46,195,1,236,6,82,192,212,125,98,236,155,159,53,225,13,39,240,115]},"announce":[],"urlList":[]}}