{"title":"Ritchie blackmore's rainbow 1975 (EAC-APE-covers)","uid":3282517,"size":257883627,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9010c45a274d300f2293a07ec265fb8b76aa275f&amp;dn=Ritchie+blackmore%5C%27s+rainbow+1975+%28EAC-APE-covers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ritchie","files":1,"time":1106919001,"description":"Rainbow was formed in 1975 by lead guitar legend Ritchie Blackmore immediately after leaving Deep Purple. He met and struck up a friendship with Ronnie James Dio, who was fronting the bluesy hard rock band Elf. Ritchie was so impressed with Ronnie and the band that he formed Rainbow out of Elf. In other words, when they first began, Rainbow was basically Elf (minus their own lead guitarist, of course) plus Ritchie Blackmore.\n\nAlthough Elf was basically a bar-room boogie band, both Ritchie and Ronnie envisioned Rainbow to be more of a progressive metal outfit with lyrics concentrating on mystical, medieval, and occult themes. This is why Rainbow's first record has both of these styles represented on it.\n\nIt begins with what might be the greatest Rainbow song ever (certainly one of their greatest anyway, as well as one of THE best songs from 1975), a 4 1/2-minute song called &amp;quot;Man On The Silver Mountain.&amp;quot; This is the original song that defined Rainbow's music: it starts with a good basic electric guitar riff, then the bass, drums and keyboards join in for support, and when Ronnie James Dio starts to sing, it quickly begins to take shape as the progressive heavy metal song it is. And it has one amazing guitar solo by Ritchie Blackmore!\n\n&amp;quot;Self Portrait&amp;quot; is also a dynamic prog-metal tune, but &amp;quot;Black Sheep Of The Family&amp;quot; is a straight-ahead, slightly bluesy hard rock tune with some great slide guitar work by Blackmore, and is obviously one of the Elf-penned contributions to this record. It is also quite infectious; once you hear it, you can't get it out of your mind for hours.\n\n&amp;quot;Catch The Rainbow,&amp;quot; at six and a half minutes long, is the only long song on this album, and is also the most progressive-sounding. It's the one that really paved the way for their next album &amp;quot;Rising,&amp;quot; as it sounds more similar to the songs on that record than anything on this one. It's a nice, introspective tune. &amp;quot;Snake Charmer&amp;quot; is almost the opposite; it is a short, loud, brash song that contains a lot of Dio-screaming on it. &amp;quot;The Temple Of The King&amp;quot; gets Rainbow back into fine progressive form, with lyrics conjuring up the medieval. The, they do a sudden roots-rock-about-face with the VERY Elf-sounding, piano-and-bass-driven, ultra-infectious &amp;quot;If You Don't Like Rock 'N' Roll,&amp;quot; which some reviewers have dismissed on here, but I think it provides a neat departure for Rainbow on this album. Besides, it shows all of us where Ronnie James Dio really came from (no, not Hell): He came from rock's early days. That's right, he formed his very first band all the way back in 1958, called Ronnie and The Rumblers, so you can tell that he still had some of that influence left in him by the time this album was made. I think it's pretty cool. :)\n\nThe CD winds down with &amp;quot;Sixteenth-Century Greensleeves&amp;quot; and &amp;quot;Still I'm Sad.&amp;quot; The former is probably the most medieval-sounding track on here, about a revolt against a tyrant, with some evil-sounding singing by Dio. The latter is simply one of the greatest heavy metal instumentals ever, with fast time-changes on bass and drums, and absolutely amazing guitar fretwork by The Man In Black.\n\nIf you know only a couple of their later hit songs, then give early Rainbow a try, especially if you already like Deep Purple. Some of these songs are very Deep Purple-ish. If you also like Ronnie James Dio's 80's stuff, then this CD is for you! And...If you don't like rock 'n' roll, THEN YOU'RE TOO LATE NOW! :)","torrent":{"xt":"urn:btih:9010c45a274d300f2293a07ec265fb8b76aa275f","amp;dn":"Ritchie+blackmore%5C%27s+rainbow+1975+%28EAC-APE-covers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9010c45a274d300f2293a07ec265fb8b76aa275f","infoHashBuffer":{"type":"Buffer","data":[144,16,196,90,39,77,48,15,34,147,160,126,194,101,251,139,118,170,39,95]},"announce":[],"urlList":[]}}