{"title":"The Chameleons - Strip(unplugged, awesome stuff)","uid":3461362,"size":81003339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:90edb1b158622f84d96082f9c47369c4b94e4ce6&amp;dn=The+Chameleons+-+Strip%28unplugged%2C+awesome+stuff%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TommyJoker","files":10,"time":1143111303,"description":"The Chameleons - Strip(2000)\n\nMore info at: &lt;a href=&quot;\nhttp://www.thechameleons.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thechameleons.com&lt;/a&gt;\n\n\nWhen the Chameleons&amp;#039; reunion finally came about in 2000, the first recorded evidence was this exquisite visit into the past and hint at the future. According to Burgess&amp;#039; warm liner notes, Lever was still busy with some other commitments, so the other three members of the band initially did some acoustic rehearsals to re-familiarize themselves with older songs. It went so well that acoustic shows were first considered, then an acoustic-based album, thus, the title to Strip. With fine artwork by Smithies, always the band&amp;#039;s designer, Strip is more than a snapshot to get the fan base excited again, but an honestly fascinating release on its own. Hearing such familiar songs as &quot;Less Than Human,&quot; &quot;Soul in Isolation,&quot; and &quot;On the Beach&quot; in acoustic fashion is lovely enough -- Burgess had played a number of acoustic shows over the years featuring a number of these tracks, while Fielding and Smithies&amp;#039; skills remained untarnished. But rather than simply performing the songs as originally recorded on different instruments, the three introduce any number of subtle changes and rearrangements, slowing down tempos, adding exploratory, gentle solo parts, and otherwise making the results more than a formal exercise. Burgess suitably avoids his fuller-bodied approach on the singing, favoring the close, tender side that makes his words so emotional in impact. As before, Smithies and Fielding form such a perfect team that it&amp;#039;s impossible to imagine one without the other, trading off lines, supporting each other on lead and rhythm, and more. Smithies also provides subtle percussion here and there, while Fielding demonstrates hitherto-unknown talents for didgeridoo! Picking out one standout track is nearly impossible -- Strip is simply that compelling and thrilling a listen. The two new songs, the brief instrumental &quot;Road to San Remo&quot; and &quot;Indian,&quot; merely confirm all the more that the Chameleons were back in a big way.\n\n1 Less Than Human         \n2 Nathan&amp;#039;s Phase         \n3 Here Today         \n4 Soul in Isolation         \n5 Pleasure and Pain         \n6 Paradiso         \n7 Caution         \n8 On the Beach         \n9 Road to San Remo         \n10 Indian \n\nRipped at 224kbps","torrent":{"xt":"urn:btih:90edb1b158622f84d96082f9c47369c4b94e4ce6","amp;dn":"The+Chameleons+-+Strip%28unplugged%2C+awesome+stuff%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90edb1b158622f84d96082f9c47369c4b94e4ce6","infoHashBuffer":{"type":"Buffer","data":[144,237,177,177,88,98,47,132,217,96,130,249,196,115,105,196,185,78,76,230]},"announce":[],"urlList":[]}}