{"title":"GameJack 5.0.4.1","uid":3390926,"size":7554427,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:918275b343ec5fcca1b1b7a1659fccfad7c5bf4e&amp;dn=GameJack+5.0.4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"useros","files":1,"time":1128218110,"description":"GameJack allows to emulate virtually every copy protection and to copy basically any game ever released ? even if you lack the suitable hardware. It masters virtual drives, EFM optimization and &quot;Data Position Management&quot; mode.\n\n\nFeatures of GameJack:\n* Copies and/or emulates all major game copy protection methods, plus it does cope with the more tricky ones, such as VOB Protect CD, StarForce 1 &amp; 2, the latest SafeDisc and Securom!\n* Copies single-layer DVD's, even Playstation 2 (the PSX 2 needs a Modchip!) and Video-DVD's.\n* NEW: New is the integrated game starter. This functions allows it, to play copy protected games without using a CD/DVD in your drive - without &quot;No CD Crack&quot; or something like this. Please try the GameStarter to use the full functionality of GameJack 5!\n* NEW: Advanced Copy dialog to change or add files while 1:1 copy mode!\n* NEW: Now GameJack 5 offers an integrated copy protection scanner. We don't deliever anymore the outdated ClonyXXL with our software.\n* Intelligent copy mechanismen:\n1. DPM Mode&amp;copy;. A safe and easy way to copy even state-of-the art protections via virtual drives with a data position measurement of the complete CD.\n2. Fast skipping of defect sectors\n3. EFM optimisation to copy &quot;weak&quot; sectors\n4. Incl. RAW COPY Mode&amp;copy;\n\n* Hide ATIP function to hide that a CD-Recordable and not a manufactured CD is inserted in the CD-ROM.\n* Image splitting\n* One virtual drive included. But if you have already virtual drives installed, there is a big chance that GameJack supports them already.\n* Image Archiving on CD and DVD: Up to 6 Games as backup on a DVD-R(W), DVD+R(W) and DVD-RAM! You may include relevant updates plus the required serial and never have the hassle of chasing your originals again! The backuped games could be installed and launched direct via the archive disc.\n* Label-Editor\n* Supports Windows 98/ME/2000/XP\n* Available languages: German &amp; English.\n\nChanges in Version Version 5.0.4.1: September 19.2005:\n- Added: It's now possible to add for each game a link to the desktop in the game starter.\n- Added: While deleting rewritable discs there is now a progress bar\n- Fixed: Several problems with the extended copy\n- Added: Support for new CD/DVD devices\n- Fixed some blacklisting problems\n\nHomepage - http://www.gamejack.org\n\nSize: 8.25 MB","torrent":{"xt":"urn:btih:918275b343ec5fcca1b1b7a1659fccfad7c5bf4e","amp;dn":"GameJack+5.0.4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918275b343ec5fcca1b1b7a1659fccfad7c5bf4e","infoHashBuffer":{"type":"Buffer","data":[145,130,117,179,67,236,95,204,161,177,183,161,101,159,204,250,215,197,191,78]},"announce":[],"urlList":[]}}