{"title":"South Park Season2 Disk4 COMPLETE PAL DVDR-SCiENCE","uid":3309428,"size":4617599653,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:91fb08345d80b096dcdd25b1875cfe3960009d46&amp;dn=South+Park+Season2+Disk4+COMPLETE+PAL+DVDR-SCiENCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"R0CCo","files":95,"time":1112267837,"description":"\n              Join Stan, Kyle, Cartman and Kenny as these four animated\n              tykes take on the supernatural, the extraordinary and the \n              insane. For them, it's all a part of growing up in South \n              Park.\n              \n              \n                                      Chef Aid\n                           \n              Chef faces jail and unless he can raise 2 million dollars\n              to pay off the slimy capitalist records company. Learning\n              for the first time that chef is a legend in the music\n              business, the boys unite the two for a benefit concert,\n              Chef Aid, to bail him out. Some of chefs famous friends\n              drop by to lend a hand including Sir Elton John and \n              Meatloaf.\n              \n                                    Spooky Fish\n                                     \n              When Stan is given a goldfish as a present, the first night\n              it kills two people. Meanwhile there is something seriously\n              wrong with Cartman, eventually Chef and the rest of the boys\n              discover that Cartman and the spooky fish have come from an \n              evil parrallel universe. Kyle, Stan and Chef join forces to\n              restore order in South Park. \n              \n                            Merrie Christmas Charlie Manson\n                                  \n              When Stans parents say no to a road-trip to Cartmans Grand-\n              mas house, Stan sneaks out to join Kyle, Kenny and Cartman,\n              anyway. Dinner with the Cartman family takes a bizarre twist\n              when their uncle Howard shows up with a special freind, \n              after breaking out of prison, and the holiday results in a\n              police stand-off. \n              \n                                      Gnomes\n                           \n              The boys have to turn in a report to the town to prove\n              that Mr. Garrison actually teaches them something. Kyle,\n              Kenny, Stan and Cartman are put in a group with Tweek who\n              wants to write a report on the gnomes that he believes \n              are coming into his house and stealing his underpants.\n              However Tweeks father, the owner of the local coffeee \n              shop, offers an easier alternative as he writes the \n              report for them on how large corporations try to push\n              out small companies.\n              \n                                Prehistoric Iceman\n                                \n              While attempting to rescue Kyle from the bottom of a \n              snowy crevice, the boys discover a man embedded in a block\n              of ice. The world watches while South Parks resident\n              gentetic engineer, Mephesto, studies the Ice Man as a\n              possible missing link between prehistoric man and the \n              modern era. However, events involving the &amp;quot;new find&amp;quot; \n              cause tension between Stan and his best freind Kyle.","torrent":{"xt":"urn:btih:91fb08345d80b096dcdd25b1875cfe3960009d46","amp;dn":"South+Park+Season2+Disk4+COMPLETE+PAL+DVDR-SCiENCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91fb08345d80b096dcdd25b1875cfe3960009d46","infoHashBuffer":{"type":"Buffer","data":[145,251,8,52,93,128,176,150,220,221,37,177,135,92,254,57,96,0,157,70]},"announce":[],"urlList":[]}}