{"title":"Kick.The.Moon.2001.DVDRip.DivX-PosTX [koreanmovies]","uid":3464257,"size":1365003465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:924a98da24c450d431d808731301ec9107d599cf&amp;dn=Kick.The.Moon.2001.DVDRip.DivX-PosTX+%5Bkoreanmovies%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"koreanmovies","files":4,"time":1143755071,"description":"PLOT:\n\nIt is 1982 and outside of Kyongju, the Gangsan high school is celebrating their end-of-class for the year. An unexpected fight breaks out in front of the school and popular-and-handsome Choi Gi Dong (Cha Seong Won) rallies up the school for a major rumble. Meanwhile, the school nerd, Park Yong Joon (Lee Seong Jae), cowers in fright behind the crowd. After the fight is over, except for Yong Joon, all of the kids who fought (which was almost the entire school) received punishment. Because of the incident and his cowardness, the entire school hates Yong Joon.\n\nFast forward 20 years, Gi Dong is now a high-school coach Gangsan High School, leaving his radical ways of life to the teachings of a school textbook. But Yong Joon, on the other hand, has become the right hand man to one of Korea&amp;#039;s most notorious gangs, the Gil Nam Society, and has returned to Kyongju to take over the major casinos there. Gi Dong and Yong Joon&amp;#039;s paths cross once again, but this time, they aren&amp;#039;t battling for popularity, but for the heart of Min Ju Ran (Kim Hye Soo), the elder sister of one of Gi Dong&amp;#039;s students...\n\n\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.","torrent":{"xt":"urn:btih:924a98da24c450d431d808731301ec9107d599cf","amp;dn":"Kick.The.Moon.2001.DVDRip.DivX-PosTX+%5Bkoreanmovies%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924a98da24c450d431d808731301ec9107d599cf","infoHashBuffer":{"type":"Buffer","data":[146,74,152,218,36,196,80,212,49,216,8,115,19,1,236,145,7,213,153,207]},"announce":[],"urlList":[]}}