{"title":"Luxor","uid":3402034,"size":12169598,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9363c32e9f64f06665a64ed5f9e34b569dc4cc2c&amp;dn=Luxor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gilibrasil","files":1,"time":1130432415,"description":"Luxor is a new puzzle game that takes the action packed, addictive gameplay of Zuma and builds upon it. Stop an advancing line of colored balls by shooting balls that match in sets of 3 or more. Match all the balls before they reach your pyramid to win the level. \n\nThe Story: \n\nThe mysterious goddess, Isis, has enlisted you to battle Set and his evil minions. With 88 exciting levels, the challenge will not be an easy one. Use your mystical winged scarab to shoot magical spheres and eliminate the approaching colored spheres by making matches of 3 or more. Stop them all before they can reach the pyramids at the ends of the paths? or all of Egypt is doomed! \n\nTo aid in your quest, use the awesome powers of Isis by catching the various falling power-up talismans, such as explosive Fireballs, thundering Lightning Bolts or magical Multi-Color Spheres that make matches of any spheres. Eliminate an entire chain of spheres to destroy the scarab minion pushing them and collect the sparkling bonus gem hidden within. You can even earn an extra life by collecting 30 golden Ankh coins. \n\nAs you battle Set and his minions, enjoy the awesome original music score and thrill to the electrifying sound effects. Filled with excitement, adventure, and tons of explosive action, there is only one question you must ask yourself: Can you thwart Set's diabolical plans and save Egypt? \n\n","torrent":{"xt":"urn:btih:9363c32e9f64f06665a64ed5f9e34b569dc4cc2c","amp;dn":"Luxor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9363c32e9f64f06665a64ed5f9e34b569dc4cc2c","infoHashBuffer":{"type":"Buffer","data":[147,99,195,46,159,100,240,102,101,166,78,213,249,227,75,86,157,196,204,44]},"announce":[],"urlList":[]}}