{"title":"Alkaline.Trio-Good.Morning.R3LiC","uid":3417294,"size":56292820,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93ba19db8a211b35ccf3cf5559887375b9a770dc&amp;dn=Alkaline.Trio-Good.Morning.R3LiC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"R3LiC","files":17,"time":1133711543,"description":"Good Mourning is the handsome if dark-eyed offspring of the deliberately melodic From Here to Infirmary LP and the Alkaline Trio's more raucous earlier work. Whether or not the band &quot;sold out&quot; when Infirmary arrived with the stamp of ambitious indie Vagrant, the set nevertheless seemed forced. For Good Mourning, Derek Grant replaces Mike Felumlee behind the kit, joining the grating-like-gouda voices and ringing guitars of Matt Skiba and Dan Andriano on the AT's second Vagrant outing. It's an album that kills with catchiness. Though &quot;This Could Be Love&quot; details the steps a jilted lover would take to off him, Skiba's melodic sensibility is hard not to hum along to. Similarly, the triumphant final key change of &quot;Continental&quot; makes its bitter farewell to a suicide victim easier to swallow. This dichotomy between deathly fascination and darn-right pop sensibility continues throughout Good Mourning. Despite making one take a few extra looks at the black and red lyric booklet, it also points to the Trio's newfound confidence to weave its tortured pathos untreated into punk-pop hair shirts for teenagers everywhere. The laughs continue with &quot;Emma&quot; and &quot;Fatally Yours,&quot; which features the classic couplet &quot;You crashed your car through the front door/I pulled you from the wreckage/You told me that you missed me/But you meant with the grill and hood.&quot; Unlike their doe-eyed emo-punk peers, the Alkaline Trio's take on true love is closer to love-hate. &quot;Donner Party (All Night)&quot; is a snow angel in a blizzard of punk-fueled melody, where the dried blood looks black on the nighttime snowpack. Finally, a glimmer of hope shines from a crack in the mortuary curtains. Good Mourning closes with the plaintive acoustic number &quot;Blue in the Face.&quot; The song's last line is a grudging request, but one that admits the faults of both parties, and accepts them as a better reality than the death wishes, dour proclamations, and damning dreams of sunlight that dominate the majority of the record. But even as the coffin closes, anthemic melody reflects in the blood pooled on the floor.","torrent":{"xt":"urn:btih:93ba19db8a211b35ccf3cf5559887375b9a770dc","amp;dn":"Alkaline.Trio-Good.Morning.R3LiC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ba19db8a211b35ccf3cf5559887375b9a770dc","infoHashBuffer":{"type":"Buffer","data":[147,186,25,219,138,33,27,53,204,243,207,85,89,136,115,117,185,167,112,220]},"announce":[],"urlList":[]}}