{"title":"XBMC Xbox Media Center 1.1.0 2005-03-07 [Y]","uid":3299432,"size":31965341,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:9444d60087927a056acd3e3585ae6139521d079b&amp;dn=XBMC+Xbox+Media+Center+1.1.0+2005-03-07+%5BY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ythan","files":1,"time":1110246370,"description":"07-03-2005 fixed: dvd overlay alignment problem.\n07-03-2005 changed: max. 10 exceptions in a row instead of endless logging of exceptions\n07-03-2005 fixed: Screen ratios were not computed correctly on start of playback when file had already been played once.\n07-03-2005 fixed: &amp;quot;View: ...&amp;quot; settings are not applied when &amp;lt;default&amp;gt; path is empty\n07-03-2005 updated: German language file\n07-03-2005 updated: Norwegian language file (Thnx to vnm)\n07-03-2005 updated: Chinese (Traditional) language file (Thnx to woozc)\n07-03-2005 updated: Korean language file (Thnx to akoako)\n07-03-2005 updated: Finnish language file (Thnx to jutski)\n07-03-2004 updated: Polish language file (Thnx to napek)\n06-03-2005 added: Voice support for Karaoke mode (SF Patch #1114097) - thanks stcogolin!\n06-03-2005 fixed: Music thumbs previously scanned on smb shares were not shown in music overlay or filelists in Music-&amp;gt;Files view.\n06-03-2005 changed: keymap.xml updated to allow skip and ffw/rew when in vis.\n06-03-2005 fixed: my music Nav window: play action works again, and artists list now sorts excluding &amp;quot;the&amp;quot;\n06-03-2005 added: New built-in command XBMC.PlayMedia(filename). For instance to map a radiostation to a key in keymap.xml\n06-03-2005 fixed: HttpApi crash if webserver not enabled\n06-03-2005 added: HttpApi patch as described here http://www.xboxmediaplayer.de/cgi-bin/forums/ikonboard.pl?s=227ea528324363fb8af20c24d5ff3ddd;act=ST;f=5;t=9397\n05-03-2005 added: thumbAlign tag for thumbnailpanel controls, only supports center so far which centers the thumbs on the texture &amp;lt;thumbAlign&amp;gt;center&amp;lt;/thumbAlign&amp;gt;. thumbPosX/thumbPosY will bump it out of center.\n05-03-2005 added: ActivateWindow() function now accepts a path parameter or bookmark name for bookmark jumping. Valid windows ID's for this are 1,2,3,6,501.  Example: ActivateWindow(6,F:Videos) or ActivateWindow(501,Music Server). Valid windows ID's for this are 1,2,3,6,501\n05-03-2005 added: the default tag for the each section's bookmark can now be a bookmark name\n05-03-2005 changed: minor gui rendering tweaks\n05-03-2005 fixed: playback from any source when cache dialog was visible locks xbmc up (internet streams)\n04-03-2005 added: my music nav window now supports files with tagged with multipe artists and genres\n04-03-2005 changed: my music nav window artists, albums, and song titles sort without &amp;quot;the &amp;quot; prefix\n04-03-2005 fixed: my music, no thumbs for songs in database views when coverart is loaded from tags\n04-03-2005 fixed: thumb cache in musicdatabase is not cleared after scanning\n04-03-2005 added: wma tag loader, support for multiple artists and genres\n04-03-2005 changed: Reversed Clear() change as it caused graphics leak through when UI calibration was not at 0,0.\n04-03-2005 added: Thumbs table clean up on cleanup of the music library.\n04-03-2005 fixed: Small thumbs in list controls weren't centered + other small graphical glitches here and there.\n04-03-2005 changed: Zoom in my pictures now goes in steps of 1.0, 1.2, 1.5, 2.0, 2.8, 4.0, 6.0, 9.0, 13.5 and 20.\n04-03-2005 changed: Pictures have more scope for being larger.  Previously they were limited to 2048 in either direction.  The limitation now is 4096 in either direction, with the number of pixels being less than 4Mp (can't have more than this without rewriting the imagelib due to RAM constraints).  Should give better detail when zoomed.\n04-03-2005 fixed: Volume amplification setting for videos was applied to music as well.\n04-03-2005 enabled: autosync=30 by default\n04-03-2005 fixed: using autosync caueses problems when resuming from pause. (updated mplayer.dll again)\n03-03-2005 updated: mplayer.dll to current cvs (final real fix + autosync fix)\n03-03-2005 changed: background music info scanner is default now (setting removed)\n03-03-2005 added: Cached thumb location is now stored in the database.  Music database SHOULD auto-update when you first access My Music.\n03-03-2005 removed: old mplayer use.  We now only use the system/players/mplayer directory.\n03-03-2005 fixed: music overlay sometimes shows no default thumb, eg. when starting a http stream with python\n03-03-2005 changed: GUIButtonControl and GUIToggleButtonControl send their click message before executing a action or a hyperlink\n02-03-2005 fixed: screensaver preview sometimes crashes\n02-03-2005 fixed: screensaver preview button is enabled when screensaver is off\n02-03-2005 changed: folders and files from smb will be sorted by modification date now\n02-03-2005 added: Screensavers from the competition.\n02-03-2005 changed: Rendering of CGUIImage -&amp;gt; big boost in gui framerate (most noticeable in 1080i)\n02-03-2005 fixed: [ 1155038 ] &amp;quot;Video calibration&amp;quot; error\n02-03-2005 changed: moved cdda reading to CFileCdda class\n02-03-2005 fixed: cdda player, couldn't seek to the start of a track\n02-03-2005 fixed: cdda player, gui was choppy when seeking\n02-03-2005 added: new infofadelabel control.  Works like infolabel, except you can have multiple &amp;lt;info&amp;gt; tags.  See the PM MusicOverlay.xml files for an example.\n02-03-2005 updated: German language file (Thnx to klapperx)\n02-03-2005 updated: Norwegian language file (Thnx to vnm)\n02-03-2005 updated: Italian language file (Thnx to kotix)\n02-03-2005 updated: German (Austrian) language file (Thnx to CEOMR)\n02-03-2005 updated: Finnish language file (Thnx to jutski)\n02-03-2004 updated: Polish language file (Thnx to napek)\n02-03-2004 updated: Dutch language file (Thnx to tijmengozer)\n01-03-2005 added: Screensaver screenshot ability.\n01-03-2005 fixed: Changed Karaoke default delay from 80 to -80 as per SF bug report [1101736].\n01-03-2005 added: Patches [1153934] and [1153884] thanks to MrC.\n01-03-2005 fixed: flashing screen when viewing pictures\n28-02-2005 changed: some gui rendering optimization\n28-02-2005 added: More DirectX exports for screensavers, thanks to SiW + MrC\n28-02-2005 fixed: Kai window showed incorrect image in Friends view.\n28-02-2005 fixed: Possible crash bug when dialog in Fullscreen video is closed.\n28-02-2005 fixed: 100k or so memleak in Settings screens.\n27-02-2005 fixed: switching between list/thumbs/bigthumbs in Music-&amp;gt;Nav root window (&amp;amp; corrected date for the last few items added today to this changelog!)\n27-02-2005 change: Use alternate mplayer location now means old mplayer.dll location, and not setting it means new mplayer.dll. Remember to verify your settings to make sure you are using the proper dll (ie for most disable Use alternate mplayer location)\n27-02-2005 update: mplayer.dll to current cvs version. (final flac fix + realvideo 10 fix)\n27-02-2005 fixed: progbar/subtitles display chopped of when starting a new movie while one is already running\n27-02-2005 removed: YUY2 Overlays and LQ Pixel shader render modes have been removed.  Combo renderer has been renamed to &amp;quot;Hardware Overlays&amp;quot; and MQ Pixel shader is now LQ pixel shader.  Default is Combo renderer which is the best all-round.\n27-02-2005 added: IMDb scraping moved into system/HTMLScraper.dll.  You must have this in order for IMDb lookups to function!\n27-02-2005 added: Source for IMDb scraping dll + a windows test application (useful in it's own right). See ToolsHTMLScraperIMDbLookup.\n26-02-2005 cleanup: moved (most) Is..(), SetThumb()... functions from CUtil to CFileItem, different other cleanups\n26-02-2005 fixed: stacked video freezes on start of second video\n26-02-2005 changed: gui presentation interval + removed blocking wait for vertical blank from gui thread\n26-02-2005 fixed: DVDImage/Folder playback could fail on remote drives (smb,ccx..) if password set with new player\n25-02-2005 fixed: My Music view resets to file view on restart if it was set to navigator view.\n25-02-2005 fixed: Stack overflow in ActivateWindow if it's called with an invalid window from a windows OnInit message handler.\n24-02-2005 added: My Music iPod-style Navigator. (Initial commit. Support for multiple artists and genres coming SOON!)\n24-02-2005 fixed: Timing Issues: Printing XBE Title To LCD On Launch\n24-02-2005 fixed: Some long-lined vobsubs were not displayed. Fixed in alternate mplayer only.\n24-02-2005 changed: Delay audio output until video is ready to play\n24-02-2005 fixed: [ 1093336 ] MusicInfoTagLoaderWMA.cpp string conversion resulted in double length strings\n23-02-2005 changed: Get available subtitle fonts and sizes from alternate mplayer path if alternate mplayer is enabled\n23-02-2005 updated: Polish language file (Thnx to napek)\n23-02-2005 updated: Norwegian language file (Thnx to vnm)\n23-02-2005 updated: Italian language file (Thnx to kotix)\n23-02-2005 updated: German (Austrian) language file (Thnx to CEOMR)\n23-02-2005 updated: Finnish language file (Thnx to jutski)\n23-02-2005 fixed: Switching from Fullscreen Video -&amp;gt; GUI now looks more professional (blank screen rather than stalled/mangled video)\n23-02-2005 added: [ 1149558 ] Printing XBE Title To LCD On Launch.  Thanks sniperkilla!\n22-02-2005 fixed: Crash when Kai is re-entered after a skin/font/etc. change.","torrent":{"xt":"urn:btih:9444d60087927a056acd3e3585ae6139521d079b","amp;dn":"XBMC+Xbox+Media+Center+1.1.0+2005-03-07+%5BY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9444d60087927a056acd3e3585ae6139521d079b","infoHashBuffer":{"type":"Buffer","data":[148,68,214,0,135,146,122,5,106,205,62,53,133,174,97,57,82,29,7,155]},"announce":[],"urlList":[]}}