{"title":"The Chameleons - What does anything mean? Basically(this is so g","uid":3460899,"size":86155378,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:947ec606809bc79c8d2ad586a2ba93966c512828&amp;dn=The+Chameleons+-+What+does+anything+mean%3F+Basically%28this+is+so+g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"TommyJoker","files":12,"time":1143019011,"description":"The Chameleons - &quot;What Does Anything Mean? Basically&quot;(1985)\n\nEasily the high point of the Chameleons&amp;#039; fascination with digital delays, pedals, and making the studio an instrument, the band&amp;#039;s second album still is seen by many a fan as being just a little too lost in the production to have the same impact as Script of the Bridge did, despite equally excellent songs. The decision must ultimately be the listener&amp;#039;s, but in the end the production argument is much more a quibble than a condemnation -- no matter how you look at it, What Does Anything Mean? Basically proved to be that rarity of sophomore albums, something that at once made the band all the more unique in its sound while avoiding a repetition of earlier work. Ironically, the first track, &quot;Silence, Sea and Sky,&quot; turned out to be the least Chameleons-like track ever, being only a two-minute synth intro piece played by Mark Burgess and Dave Fielding. But with the gentle intro to the absolutely wonderful &quot;Perfumed Garden,&quot; lyrically one of Burgess&amp;#039; best nostalgic pieces, it rapidly becomes clear exactly which band is doing this. The empathetic fire that infused Burgess&amp;#039; words for songs like &quot;Singing Rule Britannia (While the Walls Close In),&quot; a poetic attack on the Thatcher government, finds itself matched as always by brilliant playing all around. John Lever&amp;#039;s command of the drums continues to impress, and Fielding and Reg Smithies remain guitarists par excellence; the searing, sky-bound solo on &quot;Return of the Roughnecks&quot; alone is a treasure. The sublime combination of the rushing &quot;Looking Inwardly&quot; and the soaring, blasting rip &quot;One Flesh,&quot; leading into a relaxed instrumental coda, anchors the second side, while &quot;P.S. Goodbye&quot; provides a lovely, melancholic conclusion to an astounding record. CD copies include the 1981 &quot;In Shreds&quot;/&quot;Nostalgia&quot; single as bonus tracks.\n\n1 Silence, Sea and Sky         \n2 Perfume Garden         \n3 Intrigue in Tangiers         \n4 Return of the Roughnecks         \n5 Singing Rule Britannia (While the Walls Close In)         \n6 On the Beach         \n7 Looking Inwardly         \n8 One Flesh         \n9 Home Is Where the Heart Is         \n10 P.S. Goodbye         \n11 In Shreds         \n12 Nostalgia \n\nRipped at 224kbps\n","torrent":{"xt":"urn:btih:947ec606809bc79c8d2ad586a2ba93966c512828","amp;dn":"The+Chameleons+-+What+does+anything+mean%3F+Basically%28this+is+so+g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947ec606809bc79c8d2ad586a2ba93966c512828","infoHashBuffer":{"type":"Buffer","data":[148,126,198,6,128,155,199,156,141,42,213,134,162,186,147,150,108,81,40,40]},"announce":[],"urlList":[]}}