{"title":"DESCENT PC bin/cue","uid":3469456,"size":21151817,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:95039d2c9ecae36539ff472c510ff55011d8cb49&amp;dn=DESCENT+PC+bin%2Fcue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"billybob128","files":2,"time":1144762362,"description":"1:Burn or mount with daemon tools or alcohol 120%...2:install...3:PLAY. !WARNING! THIS IS THE ORIGINAL DOS VERSION MAY NOT WORK ON XP.     \n             ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n             ?                                           ?\n             ?             RELEASE NOTES FOR             ?\n             ?      DESCENT: DESTINATION SATURN 1.0      ?\n             ?                                           ?\n             Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\n            ????????????????????????????????????????????????\n                       PLEASE DO NOT DISTRIBUTE!\n               DESTINATION SATURN IS A COMMERCIAL PRODUCT\n\n                       See section 8 for details\n            ????????????????????????????????????????????????\n\n\n                         ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                         ? TABLE of CONTENTS ?\n                         Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\n                      1. Version Changes\n\n                      2. Manual Addenda\n\n                      3. Tips for New Pilots\n\n                      4. Using Thrustmaster controls, Logitech\n                         Wingman Extreme, Gravis Phoenix,\n                         or Logitech Cyberman\n\n                      5. VR Helmet Information\n\n                      6. Troubleshooting &amp; Common Problems\n\n                      7. Descent CD-Enhanced Notes\n\n                      8. Distribution Information\n\n\n\n                         ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                         ? 1. VERSION CHANGES ?\n                         Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nDescent:               - Initial OEM release\nDestination Saturn 1.0   Code equivolent to Descent Shareware 1.2\n\n\n                          ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                          ? 2. MANUAL ADDENDA ?\n                          Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nThe following items were added after the game manual went to print:\n\nDESCENT and OS/2\n????????????????\nTo get Descent to run under OS/2, just increase your DPMI_MEMORY_LIMIT\nto 8 megs or more.  Descent should then run perfectly with full sound.\nIf your joystick behaves strangely under OS/2 try using the &quot;-JoyPolled&quot;\ncommand line option.  Keep in mind that Descent does not officially\nsupport OS/2.\n\n\nDESCENT and Windows\n???????????????????\nUse the following settings in your PIF file:\n\n   Optional Parameters:  -JoyPolled\n            EMS Memory:  KB Limit -1\n            XMS Memory:  KB Limit -1\n         Display Usage:  Full Screen\n             Execution:  Exclusive\n\nIf you use a joystick, the -JoyPolled option uses an alternate method of\njoystick reading that should increase performance under Windows.\nKeep in mind that Descent does not officially support Windows.\n\n\nDESCENT and INTERNET HEAD-TO-HEAD DEMON (IHHD)\n??????????????????????????????????????????????\nWhile playing Multiplayer Descent through the IHHD software is possible,\nit is not recommended.  The delay in packet delivery will almost\ncertainly lead to strange results.  You may see players jump around\nsuddenly, or even disappear for several seconds at a time.  You may also\nwitness players not dropping powerups when killed, staying cloaked too\nlong, or other unfavorable results.\n\n\nCOMMAND LINE OPTIONS\n????????????????????\nThe following command-line options were not mentioned in the manual:\n\n  -RInvul &lt;n&gt;    New multiplayer option.  Keeps the Main Reactor\n                 invulnerable until n minutes have passed where n is a\n                 value between 1-314.\n\n  -AutoDemo      Continuously cycles through all DEM files in directory.\n\n  -NoMusic       Disables music; sound effects remain enabled.\n\n  -JoyPolled     Reads joystick using the standard IBM PC polling method,\n                 instead of using the 1.19Mhz system timer.  This is useful\n                 for multitasking operating systems, like OS/2 and Windows,\n                 which support the polling method.\n\n  -JoyBios       Reads joystick using BIOS function 15h.  This will\n                 improve the joystick readings under certain operating\n                 systems and configurations.  This is not normally\n                 recommended for DOS users.\n \n  -Iglasses      Enables support for Virtual I-O&amp;#039;s I-glasses! stereo-\n                 scopic rendering.\n\n  -VioTrack &lt;n&gt;  Enables Virtual I-O I-glasses! head tracking on serial\n                 port &lt;n&gt;.\n\n  -3dMaxLo       Enables support for the 3D-Max shutter glass system in\n                 320x200 interlaced mode.  3dbios must be installed!\n\n  -3dMaxHi       Enables support for the 3D-Max shutter glass system in\n                 320x400 interlaced mode.  3dbios must be installed!\n\nSCREENSHOT VIEWER\n?????????????????\nIncluded in your Descent directory is PCXVIEW.EXE.  This is a standalone\nutility that allows you to view any .PCX screenshots taken in Descent.\nPCXVIEW.EXE is public domain and freely distributable.  See your Descent\nManual for more information on screenshots.\n\n\n                       ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                       ? 3. TIPS for NEW PILOTS ?\n                       Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nIn addition to the following tips, your Descent box includes a &quot;walkthrough&quot;\nfor level 1.  It explains in detail how to maneuver your way through level\n1 and explains the basics of gameplay.\n\nHere are a few things that help new players adjust to the fully 3D world\nand intelligent robots of Descent.  Heed these tips and you&amp;#039;ll soon be\nblasting robot hordes (and your friends!) with ease.\n\n     o Use a quality joystick.  Thrustmaster, Advanced Gravis, and\n       CH Products provide full lines of controls well suited to 3D\n       flying.\n\n     o If you use a two-button joystick, try keeping one hand on the\n       A and Z keys to control your FORWARD and REVERSE.\n\n     o If you&amp;#039;re up against a wall, try using REVERSE to back away \n       instead of turning around.\n\n     o Learn how to SLIDE well.  Using vertical sliding instead of pitching\n       will help keep you upright.  If your joystick has a Hat Switch, \n       use it to slide.\n\n     o Use SLIDE to evade enemy fire.  This will help keep the robots\n       in your sights.\n\n     o Sweep fire side-to-side to hit evading robots.  This is especially\n       important on higher skill levels where robots evade faster.  Also\n       try using lasers and missiles simultaneouslly against an evading\n       robot.\n\n     o Rescue the hostages!  If you rescue all hostages in a mine, you\n       receive a full rescue bonus.  But be sure you make it out after\n       picking them up - if your ship&amp;#039;s destroyed, so are they.\n\n     o Try clearing a path to the exit before you attack the Main Reactor.\n       You may run out of time if you&amp;#039;re battling hordes of robots on\n       your escape!\n\n     o The blast radius of a concussion missile is very effective \n       against tight groups of robots.  \n\n     o Look for secret doors.  Weapons and ammo are often behind them.                      \n       They can be a different color, or have small seams running down\n       them.  Keep in mind, Descent is fully 3D, and secret doors aren&amp;#039;t\n       only in the walls...\n\n     o DON&amp;#039;T SIT STILL.  The best way to stay alive is to keep moving.\n       Using SLIDE to circle a target while you&amp;#039;re firing is very\n       effective.\n\n     o Learn to use your ship&amp;#039;s Automap.  It can reveal things your\n       eyes may miss.\n\n     o Flares can help sniff out cloaked robots &amp; players.\n\n\n               ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n               ? 4. USING THRUSTMASTER CONTROLS, LOGITECH   ?\n               ?     WINGMAN EXTREME, GRAVIS PHOENIX and    ?\n               ?             LOGITECH CYBERMAN              ?\n               Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nThrustmaster, Gravis Phoenix, and Logitech Cyberman controls are fully\nsupported by Descent.  The device control files (DESCENT2.ADV, DESCENT.B50,\nDESCENT.M50, and DESCENT.PHX) can be found in your Descent directory.\nIf you have a Wingman Extreme, you should use the Thrustmaster FCS option.\n\n       Thrustmaster FCS:  Choose &quot;Thrustmaster FCS&quot; under Options/Controls.\n         or Logitech      This is for players _not_ also using the WCS.\n        Wingman Extreme   If you use the WCS throttle with the FCS, follow\n                          instructions for the WCS below.\n\n     * Thrustmaster WCS:  Load the DESCENT2.ADV file into your WCS.  In\n           Mark II        Descent, choose &quot;Joystick&quot; under Options/Controls.\n                          Now choose &quot;Configure Above&quot; and change the\n                          THROTTLE entry to respond to the WCS (the Y2 axis).\n\n    * Thrustmaster FLCS:  Load the DESCENT.B50 &amp; .M50 files into your FLCS. \n                          If you also use a WCS throttle, no program should\n                          be loaded into the WCS.\n\n         Gravis Phoenix:  Load the DESCENT.PHX file into your Phoenix. In\n                          Descent, choose &quot;Joystick&quot; under Options/Controls.\n                          Now choose &quot;Configure Above&quot; and change the\n                          THROTTLE entry to respond to the throttle\n                          slider (the Y2 axis).\n\n      Logitech Cyberman:  You must have the Cyberman MOUSE.COM driver loaded\n                          before you run Descent.  If you have a standard\n                          mouse connected as well, you will need to use the\n                          &quot;/dual&quot; option when you load MOUSE.COM.  See\n                          Cyberman docs for details.  \n\nCalibration Note:  When using one of the analog throttles listed here or\n                   the CH Flightstick, you will be prompted to calibrate\n                   your throttle as well as your joystick.\n\n*  &gt;&gt; NOTE TO WCS and FLCS USERS:  Because these devices intercept the\n      keyboard signals, your ship may fly strangely when you also hold down\n      keyboard keys (like &amp;#039;A&amp;#039; and &amp;#039;Z&amp;#039;).  If you keep the WCS or FLCS on\n      your system, it&amp;#039;s recommended that you use those devices for throttle\n      control and sliding, not the keyboard.\n\n\n                       ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                       ? 5. VR HEADSET INFORMATION ?\n                       Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nRegistered Descent fully supports all popular VR Head Mounted Displays.  \nIf you have questions about the headsets, the manufacturers can be reached at\nthe following numbers:\n\n      - VFX-1 Head Mounted Display, by Forte Technologies, Inc.\n        tel: 716-427-8595\n        fax: 716-292-6353\n\n      - CyberMaxx HMD, by VictorMaxx Technologies, Inc.\n        tel: 1-800-279-6880\n        fax: 708-267-0037\n\n      - I-Glasses, by Virtual I-O\n        tel: 800-646-3759\n        fax: 206-382-8810\n        net: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d5a3bcba95a3bcbafbb6bab8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n      - 3D-Max glasses, by Kasan\n        tel: 011-46-18-187777\n\nTo enable support for a given VR device, see the command line help.\nDuring the game, the following keys are used for VR settings:\n  Shift+F5 or Alt+V:  Toggles the Cybermaxx between monitor and headset.\n  Shift+F6: Toggles high/low resolution mode.\n  Shift+F7: Reverses left/right eye.\n  Shift+F8: Toggles head tracking sensitivity.\n\n                 ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                 ? 6. TROUBLESHOOTING &amp; COMMON PROBLEMS ?\n                 Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nRegardless of configuration, you should have no trouble running Descent.\nBut in the unlikely case you do have problems, here are some helpful\npointers:\n      \nGeneral Problems\n????????????????\n=&gt; Q:  I HAVE LESS THAN 10MB OF RAM, AND I&amp;#039;M LOW ON DISK SPACE.  DESCENT\n       HANGS/CRASHES ON ME.  WHAT CAN I DO?\n\n   A:  If Descent doesn&amp;#039;t have enough free RAM available, it uses hard\n       drive space instead of RAM.  If this is the case, make sure you\n       have plenty of free disk space (at least 8-16MB free).\n\n=&gt; Q:  DESCENT RUNS SLOWLY ON MY MACHINE, ESPECIALLY IN LARGE BATTLES.\n       WHAT CAN I DO?\n\n   A:  Try putting your detail level on a lower setting.  Also try using\n       F3 and +/- to change the size of the game window.  Lowering the\n       number of available sound channels in Options/Detail/Custom\n       menu can help significantly in large battles.\n\n=&gt; Q:  I HAVE A SMALL GAME WINDOW AND A LOW DETAIL LEVEL, BUT DESCENT STILL\n       LOADS AND RUNS SLOWLY.\n\n   A:  Check your sound card settings in SETUP.  Incorrect settings\n       can cause significant slowdown.\n\n=&gt; Q:  THE WALLS IN MY GAME SEEM TO JUMP AROUND IN THE DISTANCE.  WHY?\n=&gt; Q:  I GET A COLORED WALL IN THE MIDDLE OF MY TUNNELS.  WHAT IS THIS?\n\n   A:  These are due to the Detail Level being set below the highest\n       setting.  Consult your Descent Manual.  \n\n=&gt; Q:  MY COMPUTER HAS 4 MEGS OF RAM.  THE GAME IS SLOW AND ACCESSES THE\n       HARD DRIVE ALL THE TIME.\n\n   A:  If you have less than 8 megs of RAM, try running a disk cache (even\n       as small as 256k).  This can help immensely.  Also try using the\n       &quot;-lowmem&quot; command line option when running Descent.  You might\n       consider purchasing a memory upgrade.  Every meg of RAM you add will\n       increase performance.\n\n=&gt; Q:  DESCENT LOCKS UP WHEN I RUN IT.\n\n   A:  Try running Descent with the &quot;-nosound&quot; option.  If this works, then\n       chances are it&amp;#039;s a sound card problem.  Run SETUP and make sure\n       your card settings are correct.  If you don&amp;#039;t hear digital sounds or\n       music when you test them in SETUP, try Autodetection.  If this\n       doesn&amp;#039;t help, refer to your sound card manual for troubleshooting\n       instructions, or call Interplay Technical Support.    \n\n=&gt; Q:  MY COMPUTER LOCKS UP WHEN AUTODETECTING SOUND CARDS IN SETUP.\n       WHAT&amp;#039;S WRONG?\n\n   A:  Due to hardware conflicts, autodetecting for sound cards is a\n       risky process.  If you know the brand, port address, IRQ, and\n       DMA of your sound card(s), it is recommended that you manually\n       configure these items.  Lockups are also common when autodetection\n       is used when no sound cards are installed.\n\n=&gt; Q:  I CAN&amp;#039;T SELECT THE RIGHT PORT/IRQ/DMA FOR MY SOUNDCARD IN SETUP.\n\n   A:  If the proper selections don&amp;#039;t appear in the SETUP, then you can\n       always select them manually by editing your DESCENT.CFG file\n       located in your DESCENT directory.  While we tried to account for\n       every possibility, some of the more exotic configurations may not\n       be listed.  Contact Interplay if your setup is not listed.  \n\n=&gt; Q:  WHY DON&amp;#039;T I HEAR ANYTHING WHEN I TEST MY SOUND IN SETUP?\n\n   A:  You may have the wrong sound card selected, or incorrect port,\n       IRQ or DMA settings.  Volume may be set too low in your sound\n       drivers (or the volume slider on the back of your sound card).\n       Hardware conflicts or loose cables may be to blame as well.\n      \n=&gt; Q:  MY JOYSTICK ISN&amp;#039;T RESPONDING IN THE GAME.  WHAT&amp;#039;S WRONG?\n\n   A:  Be sure you have JOYSTICK selected in the Options/Controls menu,\n       and that it&amp;#039;s calibrated.  If your joystick connects to your\n       soundcard, make sure the joystick port jumper is ENABLED on the card.\n       Some soundcards have this disabled by default.\n\n=&gt; Q:  HEY!  SOME OF MY POWERUPS DISAPPEARED.  WHAT HAPPENED?\n\n       Certain powerups will remove themselves from the game if they have\n       been around 4 or 5 minutes.  This only happens to Concussion\n       Missiles, Energy, and Shield powerups dropped by a dead player.\n    \n=&gt; Q:  WHY DOES DESCENT ACT STRANGELY WHEN I RUN IT UNDER WINDOWS?\n\n   A:  While Descent may run under Windows, it isn&amp;#039;t recommended.  You will\n       probably get odd behavior and slowdowns due to timer conflicts.\n       GUS users may get no sound at all under Windows.  If you are having\n       joystick problems, try using the -JoyPolled command line option.\n\n=&gt; Q:  I HAVE A THRUSTMASTER WCS HOOKED UP WITH A JOYSTICK.  WHEN I USE\n       THE STICK TO FLY, AND THE &amp;#039;A&amp;#039; AND &amp;#039;Z&amp;#039; KEYS TO MOVE FORWARD AND\n       BACK, I START FLYING OUT OF CONTROL.  WHY?\n\n       Holding down keyboard keys will produce erratic results when the\n       WCS or FLCS controls are installed.  See note in Section 4 for\n       details.\n\n=&gt; Q:  WHY ISN&amp;#039;T MY MIDDLE MOUSE BUTTON WORKING IN DESCENT?\n\n   A:  While Descent supports three-button mice, you still need to load\n       a mouse driver that supports three buttons.  Typically Microsoft\n       mouse drivers support two and Logitech drivers use three.\n\n=&gt; Q:  I HAVE A GATEWAY 2000 P75.  THE COLORS IN DESCENT ARE COMPLETELY\n       MESSED UP.  WHAT CAN I DO?\n\n   A:  Do a hard reboot of your computer and enter the BIOS setup.\n       Find the &quot;VGA Palette Snoop&quot; option and disable it.  This should\n       fix the problem.\n\n=&gt; Q:  DESCENT LOCKS UP AT THE TITLE SCREEN.\n\n   A:  Turn off the &quot;Hidden Refresh&quot; option in your BIOS Advanced settings.\n       Also make sure RAMBIOS.SYS does _not_ appear in your CONFIG.SYS\n       and that &quot;Hardware Video Shadowing&quot; is turned off in BIOS.\n\n\nModem/Serial Problems\n?????????????????????\n=&gt; Q:  WHEN PLAYING A MODEM/SERIAL GAME, MY GAME FREEZES ON THE &quot;WAITING\n       FOR OPPONENT&quot; SCREEN.  WHAT GIVES?\n\n   A:  This screen will appear if you have died in/escaped from an\n       exploding mine.  If the other player is still flying there can be\n       up to a 60 second delay.  This is normal.  However, if your game\n       sits at this screen much longer, chances are something is wrong.\n       Likely culprits:  opponent is having technical difficulties,\n       interference with unshielded serial cables, loose cables,\n       baud rate set too high, or uncorrected errors in the modem\n       transmission.\n\n=&gt; Q:  MY MODEM GAMES ARE MUCH SLOWER THAN NORMAL ONE-PLAYER GAMES.\n\n   A:  Try using a higher baud rate in the Com Settings menu.  If your\n       computer does not have a 16550 UART, acquiring one will allow\n       up to 38400 baud when communicating with the modem.  Consult your\n       Descent Manual for details.\n\n=&gt; Q:  STRANGE THINGS HAPPEN IN MY MODEM/NULL-MODEM GAMES.  WHAT CAN\n       I DO TO HELP THIS?\n\n   A:  This may be a result of dropped serial characters.  Some examples\n       of &quot;strange&quot; things:  players not dropping powerups when killed,\n       ships jumping from place to place on screen, or ships flying\n       through doors that appear closed.  If you get error messages during\n       play or during the &quot;waiting for opponent&quot; screen, this could be\n       the cause as well.\n\n       These problems may occur for several reasons.  Serial play adds an\n       additional burden to the CPU when playing the game, so a computer\n       capable of playing the game in single-player mode may have\n       difficulties with modem or serial play.  If you are using a\n       4-megabyte machine, the disk activity needed to run the program in\n       a small memory space can cause lost characters.  A lot of sound\n       activity can also cause lost serial characters.  Increasing the RAM\n       for the game or reducing the number of sound channels in the detail\n       settings menu can sometimes help.  Of course you can also reduce\n       the baud rate in the Com Settings menu to slow down the game\n       somewhat while improving reliability.  Also try setting your music\n       volume slider to 0 in the Options menu.\n\n       The best thing you can do to improve serial performance is to equip\n       your machine with a 16550 UART.  However, even with this UART 38.4k\n       baud rate can still be problematic if you have the burden of low\n       RAM or heavy sound activity, so don&amp;#039;t be ashamed to run a 16550\n       UART at 19.2k baud if need be.\n\n\nNetgame Problems\n????????????????\n\n=&gt; Q:  I HAVE A ZEOS PANTERA P60 WITH A SOUNDCARD AND WHEN I TRY PLAYING\n       A NETGAME IT LOCKS UP.  WHAT CAN I DO?\n\n   A:  Instead of doing a full login to your server, try loading only the\n       IPX drivers.  Descent Netgames only require this to function\n       properly.\n\n=&gt; Q:  I&amp;#039;M GETTING AN ERROR SAYING MY IPX DRIVERS AREN&amp;#039;T LOADED PROPERLY.\n       WHAT DO I DO?\n\n   A:  First, make sure you have a reasonable amount of low memory\n       available.  Although Descent uses a DOS extender to avoid low-\n       memory hassles, some low memory is still needed for network buffers.\n       If this fails, make sure your IPX.COM and other network drivers\n       are loaded properly.  A good way to test this is to logon to\n       a network server, if one is available.\n\n=&gt; Q:  MY NETGAMES SEEM SLOW AND UNRELIABLE.  WHAT&amp;#039;S UP WITH THAT?\n\n   A:  Try using a different socket number.  It&amp;#039;s possible that some other\n       application on your computer uses socket 5100h and this is\n       preventing Descent from opening a proper network connection.  Try\n       large values for the -socket option (like 32 or 100).  Remember,\n       your opponents will need to use the same socket you do.\n\n=&gt; Q:  DESCENT TELLS ME MY NETWORK CARD IS MISSING PACKETS.  WHAT THE\n       HECK DOES THAT MEAN?\n\n   A:  This can be a result of a slow network card, heavy traffic on the\n       network, or software conflicts in your system.  If you get this\n       message, you can rejoin the game and try again.  If the problem\n       persists, one of the following could be to blame:\n\n       - Loose cables.  Happens to the best of us.  Check the plugs on\n         the back of your computer, specifically the ones running to/from\n         your network card.\n\n       - Too many players.  While 8 players is offered as the maximum\n         in Descent, it&amp;#039;s possible that your LAN or computer configuration\n         can only support 4-6 players reliably.\n\n       - Bad network card.  Some cards drop IPX packets even without\n         heavy loads or interference.  If you suspect your LAN card, try\n         swapping it with one from another computer.\n\n       - Software conflicts.  Other drivers may be running that cause\n         problems with the network interrupts.  These conflicts may not\n         emerge when performing other LAN tasks that either don&amp;#039;t use\n         IPX or have layers of error-checking.  Try removing unneeded\n         drivers from your CONFIG.SYS and AUTOEXEC.BAT.\n\n       - Router problems.  Playing Descent with players on different sides\n         of a router may cause lost packets or delays.  Playing this way\n         is not recommended because it creates a significant load on the\n         router that may disturb other LAN users.\n\n\n                     ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                     ? 7. DESCENT CD-ENHANCED NOTES ?\n                     Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nCan&amp;#039;t get enough Descent?\n\nIn addition to Descent Registered/Commercial, a CD-Enhanced Descent will\nbe released in Summer 1995.  New features expected to be in the CD-Enhanced\nversion include MANY new levels (including Anarchy specific ones), new\npowerups, new enemies, animated cutscenes, new multiplayer features, and\nenhanced digital soundtrack and sound effects.\n\nExact pricing for Descent CD-Enhanced has not been determined yet, but\nRegistered owners will have an upgrade path for a minimal price.\n\n\n                      ?Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âª\n                      ? 8. DISTRIBUTION INFORMATION ?\n                      Â»Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Ã•Âº\n\nDescent: Destination Saturn is a commercial product, and should NOT be\nredistributed in any way, shape, or form.  If you have not paid for this\ngame, we strongly encourage you to do so by calling 1-800-INTERPLAY.  We\nneed your support to continue bringing you groundbreaking games\nlike Descent.\n\nFor infomation on authorized distribution, contact any of the following\ndistributors:  \n\n          ABCO, American Distributors, D&amp;H Distributors, Handleman,\n          Ingram Micro, Josha Distributors, Merisel and Navarre\n          or call Interplay at 714-553-6655.\n\n\nShareware Descent (as well as current updates) can be found at the following\nlocations:\n\n     - Interplay BBS: 714-252-2822\n\n     - CompuServe: GO GAMBPUB, under INTERPLAY\n\n     - America Online: keyword: INTERPLAY\n\n     - Software Creations BBS: 508-368-4137 or telnet to swcbbs.com\n\n     - Redeye BBS: +49.89.5460535, Munich, Germany\n\n     - Internet FTP sites:\n          ftp.wustl.edu            in /pub/msdos_uploads/descent\n          janus.library.cmu.edu    in /pub/msdos/descent\n          ftp.cdrom.com            in /.5/descent\n          ftp.gatech.edu           in /pub/dos/games/descent\n          ftp.uwp.edu              in /pub/incoming/games\n          ftp.funet.fi             in /pub/msdos/games/interplay\n          csc.mc.edu               in /pub/games/descent\n          bell.ecs.soton.ac.uk     in /pub/pc/games/demos\n          ftp.uml.edu              in /msdos/games/temp\n          ftp.demon.co.uk          in /pub/ibmpc/games/misc\n          ftp.leo.org              in /pub/comp/platforms/pc/games\n          doomgate.cs.buffalo.edu  in /pub/descent\n          ftp.prairienet.org       in /pub/software/descent\n\nOther Descent related goodies can be found at the following World Wide Web\nSites:\n         &lt;a href=&quot; http://www.interplay.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.interplay.com&lt;/a&gt;\n         &lt;a href=&quot; http://www.eskimo.com/~stickman/descent&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.eskimo.com/~stickman/descent&lt;/a&gt;\n         &lt;a href=&quot; http://doomgate.cs.buffalo.edu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://doomgate.cs.buffalo.edu&lt;/a&gt;\n         &lt;a href=&quot; http://www.primenet.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.primenet.com&lt;/a&gt;\n         &lt;a href=&quot; http://fiction.isdn.uiuc.edu/~jeske/descent/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://fiction.isdn.uiuc.edu/~jeske/descent/&lt;/a&gt;\n\n\n???????????????????????????????????????????????????????????????????????????\n     DESCENT IS COPYRIGHT (C) 1994, 1995 PARALLAX SOFTWARE CORPORATION\n                          ALL RIGHTS RESERVED\n          DESCENT IS A TRADEMARK OF INTERPLAY PRODUCTIONS, INC.\n???????????????????????????????????????????????????????????????????????????\n\n-END OF FILE-\n\u001a","torrent":{"xt":"urn:btih:95039d2c9ecae36539ff472c510ff55011d8cb49","amp;dn":"DESCENT+PC+bin%2Fcue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95039d2c9ecae36539ff472c510ff55011d8cb49","infoHashBuffer":{"type":"Buffer","data":[149,3,157,44,158,202,227,101,57,255,71,44,81,15,245,80,17,216,203,73]},"announce":[],"urlList":[]}}