{"title":"G-police 1997","uid":3396894,"size":482987360,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9517ddb205300f7a875b74d85e6e67a70998ff9d&amp;dn=G-police+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VilleR2","files":13,"time":1129399734,"description":"&quot;Earth?s resources are completely depleted, and the race is on to claim every ore-bearing rock in the solar system. War breaks out as opposing nations compete for ever-declining resources and expand their military capabilities in space. Colonies live in spectacular cities contained within huge geodesic domes. While multi-national corporations unite to exploit space, Earth?s coalition government creates a multi- national force to keep order in the colonies. The G-Police are born. Jeff Slater joins the G-Police to investigate the mysterious death of his sister.\n\nMore stunning graphics from Psygnosis! &quot;It's night time, you're hovering between two skyscrapers. You think you see something below, but it is too dark to figure out. You fire a missile towards the street, and sit in awe as everything is lit up in spectacular colors.&quot; Stunning graphics, to say the least! 35 missions will take you through 5 geodesic domes. Your assault chopper has tons of weapons, and don't worry, you'll need them all. Progressive difficulty.FMV movies and narration. For once, you've got a chopper you can really fly!! Is it time to worship Psygnosis yet?&quot;\n\nA great game from -97, wich means that you don't need the greates videocard to play it, almost everyone can play!\n\n---------\n\nTrevligt spel fr&amp;aring;n 97, absolut v&amp;auml;rt att testa! Kr&amp;auml;ver inte heller att du pants&amp;auml;tter huset f&amp;ouml;r att k&amp;ouml;pa ny dator...","torrent":{"xt":"urn:btih:9517ddb205300f7a875b74d85e6e67a70998ff9d","amp;dn":"G-police+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9517ddb205300f7a875b74d85e6e67a70998ff9d","infoHashBuffer":{"type":"Buffer","data":[149,23,221,178,5,48,15,122,135,91,116,216,94,110,103,167,9,152,255,157]},"announce":[],"urlList":[]}}