{"title":"Spuiten.en.Slikken.S02E02.DUTCH.WS.TVRip.XviD.Liev-eD2k.avi","uid":3457754,"size":419397632,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:953d96d3d4a933397af2dbe55a2e0d13d0e59105&amp;dn=Spuiten.en.Slikken.S02E02.DUTCH.WS.TVRip.XviD.Liev-eD2k.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"king2","files":1,"time":1142438206,"description":"Vanaf 27 februari heeft Spuiten &amp; Slikken heel wat nieuws voor je in petto. Iedere maandag van 23.00 uur tot 23.45 uur brengen Sophie Hilbrand, Filemon Wesselink en Sander Lantinga uitlopende onderwerpen en gasten. Zo komt een drug aan bod die bekend stond als luchtverfrisser en vertelt rapper Negative hoe het is om een bolletjesslikker te spelen.\n\nMet het item In de goot neemt Spuiten &amp; Slikken een kijkje in de afkickkliniek Smith &amp; Jones waar men van mening is dat verslaving een ziekte is. Directeur Kieth Bakker was zelf verslaafd en probeert nu anderen te helpen om de grootste uitdaging van hun leven aan te gaan: stoppen met drugs. Hoe zwaar is het om van de dope af te komen en van af te blijven?\n\nFilemon geeft informatie over de drug Explosion die verkocht werd als luchtverfrisser en onderzoekt Sander waarom sommige mannen binnen 30 seconden klaarkomen. In Thuis verlaat het oud-CoolCastduo Twan en Dennis hun vertrouwde woonkamer om te gaan feesten onder de rivieren. Twan, tevens oud-jeugdprins, leert zijn vriend Dennis Carnaval vieren in Oeteldonk.\n\nSander leert van rapper Negative hoe het is om als bolletjesslikker door het leven te moeten gaan. Negative speelt namelijk de hoofdrol in de film Bolletjes Blues. In deze film wil de Surinamer Spike een grote slag slaan door als bolletjeskoerier te gaan werken, maar zijn trip naar Suriname loopt heel anders dan gepland.\n","torrent":{"xt":"urn:btih:953d96d3d4a933397af2dbe55a2e0d13d0e59105","amp;dn":"Spuiten.en.Slikken.S02E02.DUTCH.WS.TVRip.XviD.Liev-eD2k.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953d96d3d4a933397af2dbe55a2e0d13d0e59105","infoHashBuffer":{"type":"Buffer","data":[149,61,150,211,212,169,51,57,122,242,219,229,90,46,13,19,208,229,145,5]},"announce":[],"urlList":[]}}