{"title":"max and paddy's road to nowhere","uid":3405358,"size":4408378043,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9633a8f7423d9df85424053907ed360f07eefa6f&amp;dn=max+and+paddy%5C%27s+road+to+nowhere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toppertop","files":1,"time":1131155330,"description":"max and paddy's road to nowhere.\n\nhttp://www.imdb.com/title/tt0421033/\n\nHot on the heels of the hugely popular and critically acclaimed Phoenix Nights comes Max and Paddy's Road to Nowhere.\n\nThis much-anticipated spin-off, co-written by Peter Kay and Patrick McGuinness, is a six-part comedy drama that chronicles the adventures of Phoenix Club bouncers Max (Kay) and Paddy (McGuinness) as they escape clubland in their prized motorhome and take to the open road.\n\nPaddy is a red-blooded male, with an endless supply of dodgy chat-up lines and an inexhaustible sexual appetite. Paddy 'has his needs'.\n\nMax, shorter on experience of women (although more experienced with short women) is the 'brains' of the outfit. Which is a worry?\n\nRoad to Nowhere is taking two of Peter Kay's most loved characters from Phoenix Nights and turning them into a series. Written and directed by Peter Kay himself, this was a really good comedy in 2004. Peter Kay (also playing Brian Potter) and Patrick McGuinness star as Max and Patrick (Paddy). These are two ordinarily funny blokes travelling across the country to nowhere. Basically they just like to travel. But when they do stop in places they have many weird and wonderful experiences concerning relationships, the van and the environment they are in. With a brilliant opening credits and two lovable characters (and comedians) this is quality comedy.\nVery good!","torrent":{"xt":"urn:btih:9633a8f7423d9df85424053907ed360f07eefa6f","amp;dn":"max+and+paddy%5C%27s+road+to+nowhere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9633a8f7423d9df85424053907ed360f07eefa6f","infoHashBuffer":{"type":"Buffer","data":[150,51,168,247,66,61,157,248,84,36,5,57,7,237,54,15,7,238,250,111]},"announce":[],"urlList":[]}}