{"title":"Brigandine (u) [PSX]","uid":3388482,"size":332891418,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:96349c385a4433b4a90198493978bba7e43d069f&amp;dn=Brigandine+%28u%29+%5BPSX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Frezzno","files":1,"time":1127765964,"description":"So I ripped it from a PSX disc. Read the link about this game because I suck in describing things but it's a good game plus there're screenshots.\n\nhttp://www.psxa2z.com/gpgs/BT0146.html\n\nMy description would be:\n\nThis is an RPG strategy game. You choose a ruler to lead an army which you use magic to create and fight other ruler. To your help you have some loyal knights that can fight along with you. To gain more knights you'll need to send some knights on a quest and they might find other knights or items or if you're unlycky an accident. As you fight you will gain experience and improve yourself.\n\nNOTE:\nThis should work on any PC PSX emu, but I know for sure it works on PCSXbox. Just be sure to have a BIOS. Otherwise it will hang on startup. Also don't forget the cue file. Without it the audio tracks will squeek.\n\n/Frezzno\n\nOther games that I have and all works on the Xbox. Make request here if you want.\n\nAlundra 1 and 2\nBrigandine Grand Edition Jap\nBust a Groove 1 and 2\nCrono Cross\nDiablo\nDigimon World\nFinal Fantasy VII\nLegand of Dragoon\nLegend of Mana\nLunar 2\nR-Type Delta\nSalamander DX\nStar Ocean the 2nd Story\n\n\n\n- PSX - PCSXBOX ------------------------------------------\nPlaying PSX games on xbox is not only cool, it's also fun\nand pleasent. Sometimes it's even better than playing on a\nreal Playstation. That is if you got the game to actually\nwork, which seems to be a difficult task. Because of that\nfew will choose to play PSX on the Xbox and a game will be\nhard to find, as it already is. The Xbox community is big\nand by introducing the PSX there a dying race might rise\nagain, or at least not be forgotten. And others, both old\nand new, will have a chance to enjoy what once ruled the\nearth. Please help this community by putting this entire\ntag in your torrent description along with details of\nPcsxbox configuration for the game. By having this tag a\ngame will surely work on the Xbox when making a search on\nPCSXBOX. While making a simple search on PSX others can\nenjoy it on other systems as well.\n\n/Thanks for sharing.\n----------------------------------------------------------","torrent":{"xt":"urn:btih:96349c385a4433b4a90198493978bba7e43d069f","amp;dn":"Brigandine+%28u%29+%5BPSX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96349c385a4433b4a90198493978bba7e43d069f","infoHashBuffer":{"type":"Buffer","data":[150,52,156,56,90,68,51,180,169,1,152,73,57,120,187,167,228,61,6,159]},"announce":[],"urlList":[]}}