{"title":"Frank Zappa 22-May 1971, Ohio Wesleyan University, Selby Field,","uid":3373986,"size":378864324,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:968d052c7f25986b56120091a51a26b45f4c9f8b&amp;dn=Frank+Zappa+22-May+1971%2C+Ohio+Wesleyan+University%2C+Selby+Field%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zappateer","files":8,"time":1124844417,"description":"22-May 1971, Ohio Wesleyan University, Selby Field, Delaware, OH  \n70 min, Aud, A-\nTwenty Small Cigars, Status Back Baby, Concentration Moon, Mom &amp; Dad, Intro To Music For Low \nBudget Orchestra, Billy The Mountain, King Kong  \n\n\n\n\n*NOISE REDUCTION AND OTHER AUDIO ENHANCEMENTS !\n            If you like noise and distortion do not download !\n                    \n                        *WARNING/GUARANTEE\n This Torrent contains audio which a truly free society would neither fear nor suppress.In some socially retarded areas, audio fanatics and ultra-conservative lossless organizations violate your First Amendment Rights by attempting to badmouth noise reduction. We feel that this is un-Constitutional and un-German.\n As an alternative to these government-supported programs (designed to keep you docile and ignorant), zappateer is pleased to provide stimulating digital audio entertainment for those of you who have outgrown the noise and distortion of poorly transferred and mastered audience recordings.\n The language and concepts contained herein are GUARANTEED NOT TO CAUSE ETERNAL TORRENT IN THE PLACE WHERE THE GUY WITH THE HISS AND THE DISTORTION AND OVER EQED CRAP SEED their TORRENTS (www.zappateerS.com )\n This guarantee is as real as the threats of the Audio fundamentalists who use attacks on noise reduction in their attempt to transform the zappa fans into a society of mp3 sourced noisey nincompoops (in the name of stupidity). If there is a hell, its hiss and noise waits for them, not us.\n\n *my transfers are done with audigy 2 sound card 24 bit 96 khz TRANSFERRED @ 48 KHZ  24 bit\nsony d-6 cassette and monster cables all mastering editing and sample conversion done with sony soundforge and waves direct x 24 bit plugins cds were burned using soundforge cd architech\n\n\nFOR THOSE OF YOU WHO LIKE MY TORRENT THANKS AND ENJOY !\n\nTHOSE THAT DO NOT ITS REALLY SIMPLE DOWNLOAD SOMEONE ELSE'S TORRENT !\n\n","torrent":{"xt":"urn:btih:968d052c7f25986b56120091a51a26b45f4c9f8b","amp;dn":"Frank+Zappa+22-May+1971%2C+Ohio+Wesleyan+University%2C+Selby+Field%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968d052c7f25986b56120091a51a26b45f4c9f8b","infoHashBuffer":{"type":"Buffer","data":[150,141,5,44,127,37,152,107,86,18,0,145,165,26,38,180,95,76,159,139]},"announce":[],"urlList":[]}}