{"title":"Desmond Child &amp; Rouge - Runners In The Night","uid":3376053,"size":55257812,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96f498f01344d94d6632c80aa35f04481816cbf9&amp;dn=Desmond+Child+%26+Rouge+-+Runners+In+The+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Alocacoc","files":10,"time":1125273863,"description":"DESMOND CHILD AND ROUGE\nRUNNERS IN THE NIGHT\nUSA 1979\n\nVunyl rip\n\nTRACK LISTING\n1. The Truth Comes Out\n2. My Heart's On Fire\n3. The Night Was Not\n4. Goodbye Baby\n5. Runners In The Night\n6. Tumble In The Night\n7. Scared To Live\n8. A Feelin' Like This\n9. Imitation Of Love\n10. Rosa\n\nRockdetector Biography\nEssentially a singing quartet formed in 1975 after Desmond Child and Maria Vidal had moved to New York from their native Florida in order to attend university. They met the like-minded duo of Diana Grasselli and Myriam Vaille, legend has it that the four rented an apartment in downtown New York City and, with only a piano to work with, devised intricate vocal arrangements to cover up for the lack of substantial instrumentation.\n\nA big hit in the clubs, Child and the girls were signed by Capitol and began working with producer Richard Landis and some of the finest session musicians New York had to offer. Included were guitarists Elliott Randall and David Landau, bass players Neil Jason and John Siegler, drummer Allan Schwartzberg and keyboard player Paul Shaffer. The latter has since achieved fame and fortune as the house band leader on American television chat show host David Letterman's nightly programme.\n\nApart from one song, 'The Fight' (co-written with David Landau and KISS' PAUL STANLEY) all of the compositions on the 1978 issued self-titled debut were written by the talented Child, although the variety of material on offer confused many listeners. They were extremely hard to categorise and this led to Capitol's failure to fully exploit their potential, let alone market the group.\n\nThe second album, 'Runners In The Night' (also produced by Landis) was much more of a Rock oriented affair, yet still retaining the band's distinctive vocal work. This time guitars were supplied by G.E. Smith (who would become an integral part of HALL AND OATES' band in the 80s) with the rhythm section of John Siegler (bass) and Jerry Marotta (drums). Child again wrote 99% of the material, the only co-write being 'Goodbye Baby' with Maria Vidal.\n\nMuch like the debut 'Runners In The Night' failed to capture the attention of the public or the all important radio medium. A contribution to the soundtrack of cult movie 'The Warriors' with 'Last Of The Ancient Breed' would prove to be the quartet's swansong (the girls also sang back ups on GENYA RAVEN's 'Love Is A Fire' on the same album). The four did continue to work together as backing vocalists for a number of artists including ELLEN SHIPLEY, a trend begun with the girls appearing on KISS' PAUL STANLEY's 1978 issued solo album.\n\nChild's talent as a songwriter had already led him to return the favour to Stanley for 'The Fight' by co-writing 'I Was Made For Lovin' You' with the KISS guitarist and Vini Poncia for KISS' 'Dynasty' album. Combining Rock with Disco, the track broke new ground for KISS and became a huge hit worldwide. Child then penned a song for TERI DE SARIO's 'Caught' album (1980), another for NOVO COMBO's eponymous Polydor debut (1982) and contributed to three tracks on CHER's 'I Paralyse' album (1982) before seemingly disappearing off the face of the planet.\n\nHis name re-emerged against the songwriting credits of two tracks, including the hit 'Heaven's On Fire,' on KISS' 'Animalize' album in 1984. But Child had very briefly emerged in 1983 supplying backing vocals with old pal Maria Vidal to ELLEN SHIPLEY's 'Call Of The Wild' album.\n\nOf the three girls, only Maria Vidal continued to seriously pursue a career in the music industry, eventually releasing a Pop oriented, self-titled solo album on A&amp;M following the hit single 'Body Rock', although all three girls were briefly reunited on Desmond's 'Discipline' solo album.\n","torrent":{"xt":"urn:btih:96f498f01344d94d6632c80aa35f04481816cbf9","amp;dn":"Desmond+Child+%26+Rouge+-+Runners+In+The+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96f498f01344d94d6632c80aa35f04481816cbf9","infoHashBuffer":{"type":"Buffer","data":[150,244,152,240,19,68,217,77,102,50,200,10,163,95,4,72,24,22,203,249]},"announce":[],"urlList":[]}}