{"title":"South Park [Temporada 1 Completa]","uid":3383139,"size":4121779243,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9770d81e18d75e5c6421b8f09dd204e811bbe828&amp;dn=South+Park+%5BTemporada+1+Completa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Divxtotal.CoM","files":-1,"time":1126708552,"description":"South Park es una serie c&amp;oacute;mica animada creada por Matt Stone y Trey Parker y distribuida por Warner Bros. Television y transmitida por Comedy Central desde 1997 en Estados Unidos de Am&amp;eacute;rica y Locomotion y por MTV Latinoam&amp;eacute;rica desde el 2005. Trata sobre las aventuras de cuatro ni&amp;ntilde;os que viven en el peque&amp;ntilde;o pueblo llamado South Park, Colorado. South Park hace s&amp;aacute;tira y cr&amp;iacute;tica de muchos aspectos de la cultura americana y eventos recientes, reta las firmes creencias y los tab&amp;uacute;s y muy seguido hace uso del humor negro. En diciembre del 2004, la serie se encontraba en la octava temporada y se asegur&amp;aacute; que la d&amp;eacute;cima har&amp;aacute; su debut el 9 de marzo de 2005.\n\nEl programa se caracteriza por manejar eventos actuales de una manera muy franca. Como un episodio que trata sobre la repatriaci&amp;oacute;n de unas quintillizas rumanas que sali&amp;oacute; al aire durante el esc&amp;aacute;ndalo sobre Eli&amp;aacute;n Gonz&amp;aacute;lez, y tambi&amp;eacute;n inclu&amp;iacute;a a personajes como Janet Reno, la Fiscal General en ese entonces. Otro episodio transmitido despu&amp;eacute;s de los atentados del 11 de septiembre de 2001 mostraba a los ni&amp;ntilde;os viajando en un avi&amp;oacute;n militar hacia Afganist&amp;aacute;n y encontrando a Osama bin Laden. Un episodio en el que aparece una mujer que accidentalmente expuso uno de sus senos y lanz&amp;oacute; un chorro de leche materna a trav&amp;eacute;s del pueblo, fue transmitido despu&amp;eacute;s del fallo en el vestuario de Janet Jackson durante el Super Bowl XXXVIII. En otro episodio Kenny McCormick dura muerto unos dias y vive de forma vegetativa (recibe el sobrenombre de &quot;Kenny tomate&quot;) al ser atropellado por un automovil mientras juega un videojuego entre angeles contra demonios y ante eso abre un acalorado debate debido que si debian desconectar su sonda; finalmente muere Kenny por los angeles para que dirijiera el contraataque contra demonios. Eso sucedi&amp;oacute; despu&amp;eacute;s de la desconexi&amp;oacute;n de la sonda y posterior muerte de Terry Shiavo El programa fue estrenado 12 horas despues de la muerte de Terry.","torrent":{"xt":"urn:btih:9770d81e18d75e5c6421b8f09dd204e811bbe828","amp;dn":"South+Park+%5BTemporada+1+Completa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9770d81e18d75e5c6421b8f09dd204e811bbe828","infoHashBuffer":{"type":"Buffer","data":[151,112,216,30,24,215,94,92,100,33,184,240,157,210,4,232,17,187,232,40]},"announce":[],"urlList":[]}}