{"title":"Batman.Begins.","uid":3418089,"size":4698370048,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9846a7c440463b1e17c3d91a459add345de198ba&amp;dn=Batman.Begins.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cybor01","files":15,"time":1133887802,"description":"&amp;iquest;C&amp;oacute;mo cambia un hombre el mundo? Es una pregunta que obsesiona a Bruce Wayne al igual que el fantasma de sus padres, muertos a tiros ante sus ojos en las calles de Gotham una noche que cambi&amp;oacute; su vida para siempre. Atormentado por la culpa y la ira, el desilusionado heredero industrial desaparece de Gotham y viaja en secreto por el mundo, buscando los medios de luchar contra la injusticia y utilizar el miedo contra los que se aprovechan de los que tienen miedo. En su b&amp;uacute;squeda, Bruce es adiestrado por un misterioso hombre llamado Ducard en el dominio de las disciplinas f&amp;iacute;sicas y mentales que le otorgar&amp;aacute;n el poder para combatir el mal que ha jurado destruir. Pronto se ve convertido en el objetivo de los intentos de reclutamiento de la Liga de las Sombras, un poderoso y subversivo grupo de vigilantes dirigido por el enigm&amp;aacute;tico l&amp;iacute;der Ra's Al Ghul. Cuando Bruce vuelve a Gotham encuentra la ciudad devorada por una delincuencia y una corrupci&amp;oacute;n desenfrenadas. Con la ayuda de su leal mayordomo Alfred, el detective Jim Gordon - uno de los pocos buenos polic&amp;iacute;as de las fuerzas del orden p&amp;uacute;blico de Gotham - y Lucius Fox, su aliado en la divisi&amp;oacute;n de Ciencias Aplicadas de Wayne Enterprises, Bruce Wayne libera a su imponente alter ego: Batman, un justiciero enmascarado que utiliza la fuerza, la inteligencia y un despliegue de artefactos de alta tecnolog&amp;iacute;a para combatir las fuerzas siniestras que amenazan con destruir la ciudad.","torrent":{"xt":"urn:btih:9846a7c440463b1e17c3d91a459add345de198ba","amp;dn":"Batman.Begins.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9846a7c440463b1e17c3d91a459add345de198ba","infoHashBuffer":{"type":"Buffer","data":[152,70,167,196,64,70,59,30,23,195,217,26,69,154,221,52,93,225,152,186]},"announce":[],"urlList":[]}}