{"title":"Propagandhi - 2001 - Today's Empires, Tomorrow's Ashes","uid":3464814,"size":32320299,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:990464b0e6a0d4605eb895058c6a8a15fbf17807&amp;dn=Propagandhi+-+2001+-+Today%5C%27s+Empires%2C+Tomorrow%5C%27s+Ashes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KindTorrents","files":15,"time":1143887947,"description":"[b]Cover:[/b]\n\n[img]http://images.amazon.com/images/P/B000056SWP.01.LZZZZZZZ.jpg[/img]\n\n[b]Artist:[/b]\n\nPropagandhi\n\n[img]http://image.allmusic.com/00/amg/pic200/drp600/p602/p60223mayfa.jpg[/img]\n\n[b]Album:[/b]\n\nToday&amp;#039;s Empires Tomorrow&amp;#039;s Ashes\n\n[b]Bio:[/b]\n\nAs one of Fat Wreck Chord&amp;#039;s very first bands, Propagandhi have long been going against the grain of not just society, but even their own record label. The radicals from Winnipeg, Canada, got together in 1989 and eventually played a show with NOFX. After talking with Fat Mike and realizing they shared the same D.I.Y. attitude, the band agreed to join his fledgling label. Ideally, the band would have loved to skirt the entire capitalist process of selling and marketing music, but made compromises in order to get its pro-gay, pro-feminist, pro-civil liberties, anti-fascism message out. Screeching over fast, catchy punk music, the group moved easily from humorous to profound to blunt with song titles like &quot;I Was a Pre-Teen McCarthyist,&quot; &quot;Hate, Myth, Muscle, Etiquette,&quot; and &quot;Stick That Fucking Flag Up Your Goddamn Ass, You Skinhead Creep.&quot;\n\nThat style took a dramatic turn in 1997 when singer, songwriter, and bassist John K. Samson left to write, start a publishing company, and eventually form the Weakerthans. The remaining members of Propagandhi started their own label, G7 Welcoming Committee, which released the band&amp;#039;s third album, Where Quantity Is Job #1, along with Weakerthans&amp;#039; records and Propagandhi&amp;#039;s 2001 effort, Today&amp;#039;s Empire, Tomorrow&amp;#039;s Ashes, in Canada. Founding member and guitarist/vocalist Chris Hannah left the group in 2003, leaving Jordy Samolesky and Todd Kowalski to the difficult task of finding a replacement. They eventually settled on Portage Terriers vocalist Glenn Lambert and quickly headed into the studio. Both Where Quantity Is Job #1 -- a compilation of live tracks, demos, and previously unreleased material -- and Potemkin City Limits were released in 2005. \n\n[b]Review:[/b]\n\nIt&amp;#039;s been five long years since Propagandhi last released an album. In the interim, much to no one&amp;#039;s surprise, the world has not become a better place; thus, the return of this trio to action comes as welcome relief for those in need of a shot of political rejuvenation. During Propagandhi&amp;#039;s hiatus, bassist/vocalist John departed, replaced by the rather more verbosely monikered Tae-Bo Todd the Rod Kowalski. But what hasn&amp;#039;t changed is the group&amp;#039;s attitude: They&amp;#039;re still raging...oops, one is tempted to say anarcho-punks, a tag the band members loudly disclaim, so let&amp;#039;s say agit-rockers. Certainly rock is a sturdy enough genre to hold the trio&amp;#039;s predilection for slamming hardcore into speed metal, then thrashing it to death with a good old punk rock beat. And while they may not be as melodic as many of their fellow Fat bands, they aren&amp;#039;t beyond writing a damn catchy chorus. Beyond the high-energy, fists-in-the-air music, Today&amp;#039;s Empire, Tomorrow&amp;#039;s Ashes delivers up vituperative lyrics on a variety of hard-hitting subjects. Like most next door neighbors, the members of the Canadian trio are well aware of America&amp;#039;s foibles, and are more than happy to make their opinions known. Previously, however, there was enough irony and wit to the lyrics to suggest that deep down, they&amp;#039;d forgive us, if only we&amp;#039;d straighten up and stop bringing the whole block into disrepute. But it&amp;#039;s apparent that Propagandhi are losing faith in America&amp;#039;s ability to change, and the battle is beginning to wear the band down. There&amp;#039;s much less humor here than in the past, the frustration is obvious, the anger rawer, and a dispiriting depression seems to be setting in. Yet hope may still conquer all, and the group has enough faith in its fans to believe that the fight is not over yet.\n\n[b]Tracks:[/b]\n\n   1.  Mate Ma Moris Ukun Rasik An\n   2. Fuck The Border\n   3. Today&amp;#039;s Empires Tomorrow&amp;#039;s Ashes\n   4. Back To The Motor League\n   5. Natural Disasters\n   6. With Friends Like These Who The Fuck Needs Cointelpro\n   7. Aldbright Monument Baghdad\n   8. Ordinary People Do Fucked Up Things When Fucked Up Things Be\n   9. Ladies&amp;#039; Night In Loserville\n  10. Ego Fum Papa [I Am The Pope]\n  11. New Homes For Idle Hands\n  12. Bullshit Politicians\n  13. March Of The Crabs\n  14. Purina Hall Of Fame\n\n[b]Rating (of 10):[/b]\n\n8\n\n[b]Release Date:[/b]\n\nNov 7, 2000\n\n[b]Label:[/b]\n\nFat Wreck Chords\n\n[b]Genre:[/b]\n\n* Rock\n\n[b]Styles:[/b]\n\n    * Alternative Pop/ Rock\n    * Punk Revival\n\n[b]Bitrate:[/b]\n\n128kbps\n\n[b]File format:[/b]\n\nmp3\n\n[b]File size:[/b]\n\n30.8 MB\n\n[b]Discography[/b]\n\n2005 Potemkin City Limits  \n2005 Where Quantity Is Job #1 [2005]  \n2000 Today&amp;#039;s Empires, Tomorrow&amp;#039;s Ashes  \n1998 Where Quantity Is Job #1 [1998]  \n1996 Less Talk, More Rock  \n1994 How to Clean Everything\n","torrent":{"xt":"urn:btih:990464b0e6a0d4605eb895058c6a8a15fbf17807","amp;dn":"Propagandhi+-+2001+-+Today%5C%27s+Empires%2C+Tomorrow%5C%27s+Ashes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990464b0e6a0d4605eb895058c6a8a15fbf17807","infoHashBuffer":{"type":"Buffer","data":[153,4,100,176,230,160,212,96,94,184,149,5,140,106,138,21,251,241,120,7]},"announce":[],"urlList":[]}}