{"title":"The Moon - Without Earth &amp; The Moon - Great psychedelic pop 1968","uid":3403599,"size":193791221,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9acbab08e228a2922e0f655fffa834b4b7b2ff0d&amp;dn=The+Moon+-+Without+Earth+%26+The+Moon+-+Great+psychedelic+pop+1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sixtiesfan3","files":31,"time":1130771930,"description":"320 kbs rip.\nCovers &amp; info included.\n\nThe Moon was a short-lived late-'60s psych-pop &quot;supergroup,&quot; notable for featuring ex-Beach Boy David Marks on lead guitar. 20-year old Marks had, by then, enjoyed quite a career. At 14, circa 1962, he joined the Beach Boys as a rhythm guitarist (the Wilsons were his neighbors in Hawthorne, CA) when Al Jardine left their lineup to attend dentist school. Marks appeared on the first four Beach Boys albums and several hit singles, including &quot;Surfin' U.S.A.&quot; and &quot;Surfer Girl.&quot; When Jardine returned, Marks, just 16, became the leader of Dave &amp; the Marksmen, who had localized hits with &quot;Cruisin',&quot; &quot;I Wanna Cry,&quot; and &quot;I Could Make You Mine.&quot; Marks then formed the Band Without a Name, who recorded two singles for Tower and Sidewalk and were the house band at two Sunset Strip clubs, circa 1965-1966. After leaving this group, Marks formed the Moon with organ/pianist/vocalist Matthew Moore, who penned most of the band's songs. Moore's previous group, Matthew Moore Plus Four, had recorded for GNP Crescendo, and also solo material for White Whale and Capitol. The other Moon members were bassist David Jackson (ex-Hearts &amp; Flowers, who had two LPs on Capitol in the late '60s) and drummer Larry Brown (ex-Davie Allen &amp; the Arrows and a veteran of countless film soundtracks and those Sidewalk/Tower releases that were produced by Mike Curb). The members of the Moon literally moved into Continental Recorders in Hollywood, where they recorded two albums -- 1968's Without Earth and 1969's The Moon -- for Imperial. Today, Marks admits these were produced under the influence of LSD, and sound &quot;like a cross between the Bee Gees, the Beatles, and Jimi Hendrix.&quot; The group's membership also included bassist Andy Bennett and session drummer Jim Keltner occasionally filling in.\n\nAfter the Moon dissolved, Marks began working as a studio musician with Denny Brooks, Delaney &amp; Bonnie, and others. Marks, Moore, and Jackson later worked together -- alongside members of Colours and the East Side Kids -- on Buzz Clifford's See Your Way Clear album. In August 1997, Marks re-joined the Beach Boys, who were unable to tour due to Carl Wilson's cancer. Marks also joined Mike Love's Beach Boys, but was forced to leave due to his own battle with Hepatitis C. He founded the non-profit Artists Against Hepatitis foundation and became the national spokesman for the Hep C Hope Foundation. More recently, he still finds time to tour with Beach Party!, made up of former members of the Boys' touring band. Moore, meanwhile, joined Joe Cocker's 1970 Mad Dogs and Englishmen Tour, which was captured on vinyl and film for posterity's sake (Cocker performed Moore's &quot;Space Captain&quot;). Moore then went on to have a successful career as a session vocalist and keyboardist, recorded solo albums, and even had his own label, New Decade. David Jackson went on to become the bassist with Dillard &amp; Clark. Larry Brown played with Gunhill Road, Tony Allwine, and was the official voice for Mickey Mouse.\n","torrent":{"xt":"urn:btih:9acbab08e228a2922e0f655fffa834b4b7b2ff0d","amp;dn":"The+Moon+-+Without+Earth+%26+The+Moon+-+Great+psychedelic+pop+1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9acbab08e228a2922e0f655fffa834b4b7b2ff0d","infoHashBuffer":{"type":"Buffer","data":[154,203,171,8,226,40,162,146,46,15,101,95,255,168,52,180,183,178,255,13]},"announce":[],"urlList":[]}}