{"title":"Three Stooges 160-169(miss_167)","uid":3400322,"size":955004554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b4e047fed847fb2c0cc933c24b4723dde8510ae&amp;dn=Three+Stooges+160-169%28miss_167%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeterL99","files":20,"time":1130028550,"description":"Listen Judge (1952)\n\n    Director: Edward Bernds\n    Cast: Vernon Dent, Emil Sitka, Kitty McHugh\n\n    The Three Stooges are fix-it men who are brought before a judge on a charge of chicken stealing. They escape from the courtroom and wind up getting hired in the judges' house after their antics attempting to fix the doorbell cause the servants to quit. The boys are discovered when the cake they bakes explodes all over a political supporter of the judge and he loses his chance for re-election.\n--------------------------------------------------------------------------------\nCorny Casanovas (1952)\n\n    Director: Jules White\n    Cast: Connie Cezan\n\n    The Three Stooges don't know it, but they are all engaged to the same girl, a gold-digger who plans to get an engagement ring from each of them and then abandon them. When all three show up at her house at the same time, a wild fight ensues, as each stooge accuses the others of making time with &quot;his&quot; girl. The Three Stooges knock each other senseless and the girl escapes with their rings.\n--------------------------------------------------------------------------------\nHe Cooked His Goose (1952)\n\n    Director: Jules White\n    Cast: Mary Ainslee, Angela Stevens\n\n    Larry is a pet dealer who's seeing Moe's wife while at the same time trying to steal Shemp's fianc&amp;eacute;e. When Moe's become suspicious, Larry attempts to frame Shemp as the boyfriend. He gets Shemp a job as a door to door pajama salesman and sends him to Moe's apartment, and then tells both Moe and Shemp's fianc&amp;eacute;e to go there and catch him in the act. Larry's plan backfires when Shemp catches him and lets Moe deliver some punishment.\n\nA departure from the regular format. The Three Stooges work as separate characters and Larry has the main role.\n\nThis film was later remade as Triple Crossed (1952) with Joe Besser\ntaking Shemps place.\n--------------------------------------------------------------------------------\nGents in a Jam (1952)\n\n    Director: Edward Bernds\n    Cast: David Bond, Mary Ainslee, Vernon Dent, Emil Sitka, Kitty McHugh, Mickey Simpson, Danny Sue Nolan\n\n    Shemp's rich Uncle Phineas comes to visit the Three Stooges who are broke and about to evicted. The boys convince their landlady Mrs. McGruder not to toss them out as Shemp is set to inherit a fortune. The boys also have trouble with a circus strongman after Shemp accidentally rips off his wife's dress. Uncle Phineas gets in the middle of the fight, and Mrs. McGruder ends it by knocking out the strongman. It turns out that Uncle Phineas and the landlady were childhood sweethearts and he marries her, leaving the Three Stooges out of the bucks once again.\n--------------------------------------------------------------------------------\nThree Dark Horses (1952)\n\n    Director: Jules White\n    Cast: Kenneth McDonald\n\n    A campaign boss is looking for three delegates to the presidential convention, delegates that are too stupid to discover that his candidate, Hammond Egger, is a crook. Enter the Three Stooges as janitors sent to clean the man's office. After some of their antics, the boy's suitability for the job is apparent and they're hired. The Three Stooges go to the convention, but double cross their boss and vote for another candidate, Abel Lamb Stewer. When the boss and his muscle man come looking for revenge, the boys defeat them in a wild fight.\n--------------------------------------------------------------------------------\nCuckoo on a Choo-Choo (1952)\n\n    Director: Jules White\n    Cast: Patricia Wright, Victoria Horne\n\n    Larry and Shemp are living in a stolen railroad car. Larry wants to marry his girlfriend, but she won't consent until Shemp marries her sister. Shemp however, is constantly drunk and in love with &quot;Carry&quot;, an imaginary giant canary. Moe is an investigator from the railroad, sent to discover how the car was stolen from a moving train. Moe is also in love with Shemp's girl. Shemp winds up with both women, but still prefers his imaginary canary.\n\nOne of the strangest stooge shorts.  Larry does a good impression of Marlon Brando\n--------------------------------------------------------------------------------\nUp in Daisy's Penthouse (1953)\n\n    Director: Jules White\n    Cast: Connie Cezan, John Merton, Jack Kenny\n\n    The Three Stooges escape from jail to prevent their newly rich dad from marrying Daisy, a gold-digger after his money. Shemp looks like dad, so he impersonates him and marries Daisy. What the Three Stooges don't know is that Daisy is in cahoots with some crooks, and they plan to bump off her new husband. The boys foil the crook's plan and take Pa home to Ma.\n\nA remake of &quot;Three Dumb Clucks&quot;, with Shemp, instead of Curly, playing both father and son.\n--------------------------------------------------------------------------------\nLoose Loot (1953)\n\n    Director: Jules White\n    Cast: Kenneth MacDonald, Tom Kennedy, Emil Sitka\n\n    The Three Stooges are willed a lot of dough from a rich uncle, but the executor of the estate, Icabob Slipp, is a crook who absconds with the money. The Three Stooges trail him to a a theater where they engage in a wild chase and ultimately recover their inheritance.\n\nThe opening scenes are taken from &quot;Hold that Lion&quot;.\n--------------------------------------------------------------------------------\nTricky Dicks (1953)\n\n    Director: Jules White\n    Cast: Benny Rubin, Connie Cezan, Ferris Taylor, Phil Arnold, Murray Alper\n\n    The Three Stooges are policemen on the trail of a murderer. They unsuccessfully interrogate an Italian organ grinder, among other suspects, and then catch the bad guy after a gun fight that nearly destroys the police station.\n--------------------------------------------------------------------------------\nMiSSiNG. 167. Booty and the Beast (1953)\n\n    Director: Jules White\n    Cast: Vernon Dent, Kenneth MacDonald, Dudley Dickerson, Curly Howard (stock footage)\n\n    The Three Stooges do a good turn and help a stranger open a safe in what they think is the man's house.  Actually the man is a crook and the boys were unwitting accomplices to a robbery.  Once they realize what's happened, the Three Stooges go after the bad guy and who's left on the train to Los Vegas.  The boys trap the villain and recover the booty.\n\n(Lots of footage was used from &quot;Hold that Lion&quot;, including Curly's cameo appearance as a snoring, barking passenger)\n\n","torrent":{"xt":"urn:btih:9b4e047fed847fb2c0cc933c24b4723dde8510ae","amp;dn":"Three+Stooges+160-169%28miss_167%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4e047fed847fb2c0cc933c24b4723dde8510ae","infoHashBuffer":{"type":"Buffer","data":[155,78,4,127,237,132,127,178,192,204,147,60,36,180,114,61,222,133,16,174]},"announce":[],"urlList":[]}}