{"title":"Dean Koontz - The Face","uid":3426240,"size":422152074,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9d9325b5b06d0f5487fc17e6535d9b014fa2d953&amp;dn=Dean+Koontz+-+The+Face&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"billfrooguk","files":80,"time":1136024004,"description":"Unabridged\n\nHe's Hollywood's most dazzling star, whose flawless countenance inspires the worship of millions and fires the hatred of one twisted soul. His perfectly ordered existence is under siege as a series of terrifying, enigmatic messages  breaches the exquisitely calibrated security systems of his legendary Bel Air estate.\n\nThe boxes arrive mysteriously, one by one, at Channing Manheim's fortified compound. The threat implicit in their bizarre, disturbing contents seems to escalate with each new delivery. Manheim's security chief, ex-cop Ethan Truman, is used to looking beneath the surface of things. But until he entered the orbit of a Hollywood icon, he had no idea just how slippery reality could be. Now this good man is all that stands in the way of an \ninsidious killer, and forces that eclipse the most fevered fantasies of a city where dreams and nightmares are the stuff of daily life. As a seemingly endless and ominous rain falls over southern California, Ethan will test the limits of perception and endurance in a world where the truth is as thin as celluloid and answers can be found only in the illusory intersection of shadow and light.\n\nEnter a world of marvelous invention, enchantment, and implacable intent, populated by murderous actors and the walking dead, hit men and heroes, long-buried dreams and never-dying hope. \n\nHere a magnificent mansion is presided over by a Scottish force of nature known as Mrs. McBee, before whom all men tremble. A mad French chef concocts feasts for the mighty and the malicious. Ming du Lac, spiritual adviser to the stars, has a direct line to the dead. An aptly named cop called Hazard will become Ethan's ally, an anarchist will sow discord and despair, and a young boy named Fric, imprisoned by celebrity and loneliness, will hear a voice telling him of the approach of something unimaginably evil. Traversing this extraordinary landscape, Ethan will face the secrets of his own tragic past and the unmistakable premonition of his impending violent death as he races against time to solve the macabre riddles of a modern-day beast.\n\nA riveting tour de force of suspense, mystery, and miraculous revelation, The Face is that rare novel that entertains, provokes, and uplifts at the same time. It will make you laugh. It will give you chills. It will fill you with hope. \n","torrent":{"xt":"urn:btih:9d9325b5b06d0f5487fc17e6535d9b014fa2d953","amp;dn":"Dean+Koontz+-+The+Face","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9325b5b06d0f5487fc17e6535d9b014fa2d953","infoHashBuffer":{"type":"Buffer","data":[157,147,37,181,176,109,15,84,135,252,23,230,83,93,155,1,79,162,217,83]},"announce":[],"urlList":[]}}