{"title":"Pilot.Guides.-.Nueva.York.[TDTRip]..By.Regenzy.avi","uid":3411280,"size":462581760,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:9efcc3cf60f22347f8094ec572886af8f8cef3db&amp;dn=Pilot.Guides.-.Nueva.York.%5BTDTRip%5D..By.Regenzy.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Regenzy1","files":1,"time":1132418191,"description":"Nueva York ha sido siempre una ciudad muy querida por sus habitantes y por los m&amp;aacute;s de 30 millones de turistas que la visitan anualmente. Ian Wright y Megan McCormick regresan a esta metr&amp;oacute;polis que ahora se conoce tanto por su forma de enfrentarse a las cat&amp;aacute;strofes como por su poder econ&amp;oacute;mico, predominio cultural y diversidad &amp;eacute;tnica.\n\nEl periplo por los distritos de la ciudad comienza en Manhattan, una isla que acoge a gran parte de la comunidad jud&amp;iacute;a de Europa del Este y que posee la mayor poblaci&amp;oacute;n china de occidente. Mientras Ian se dirige en un ferry a la Estatua de la libertad, Megan visita la bolsa de Wall Street donde Michael Peskuma, que a sus 94 a&amp;ntilde;os es el inversor m&amp;aacute;s veterano del mundo, le recuerda la crisis del 29. \n\nSiguiendo el recorrido por la ciudad, Megan entrevista al propietario del Chelsea Hotel, un lugar de visita obligada para los amantes de la cultura pop. A primeras horas de la ma&amp;ntilde;ana, Ian y Megan se adentran en el Bronx, en busca de la poblaci&amp;oacute;n negra, que es un referente de la cultura del hip hop. Mientras Ian descubre los gustos de los raperos, Megan se dirige a Harlem y descubre los art&amp;iacute;culos ex&amp;oacute;ticos que se pueden adquirir en el centro comercial AfroCentric.\n\nPasando por el Puente de Brooklyn Ian entra en Williamsberg, cuyo n&amp;uacute;mero de habitantes puertorrique&amp;ntilde;os es similar al de los nativos de esta isla del Caribe. Tras una visita a la comunidad cubana, Ian y Megan se dirigen a La Gran Manzana, donde contemplan la catedral de Woolworth y uno de los edificios m&amp;aacute;s altos de la ciudad: 40 Wall Street.\n\nUn recorrido por la zona cero y el conmovedor Fire Museum nos muestra las consecuencias del 11-S. Este lugar ha despertado el inter&amp;eacute;s de muchos viajeros que tratan de tomar conciencia de lo ocurrido en ese tr&amp;aacute;gico d&amp;iacute;a. \n\nCon nueve museos de talla mundial, el peligro de dedicar el viaje a un recorrido por los museos es considerable. Megan visita el Museo de Arte Metropolitano y descubre impresionantes piezas de cada per&amp;iacute;odo, desde la antigua Mesopotamia al Renacimiento.\n\nUn d&amp;iacute;a de compras por la Quinta Avenida no puede faltar en una visita a Nueva York. Desgraciadamente es dif&amp;iacute;cil poder permitirse algo m&amp;aacute;s que un l&amp;aacute;piz de Chanel. Ian decide terminar el viaje en la pintoresca Coney Island, al sur de Brooklun y bailando una giga en Brighton Beach. Megan, atra&amp;iacute;da por las playas doradas, prefiere hacerlo en la id&amp;iacute;lica Fire Island, en el refugio gay de Cherry Grove.\n","torrent":{"xt":"urn:btih:9efcc3cf60f22347f8094ec572886af8f8cef3db","amp;dn":"Pilot.Guides.-.Nueva.York.%5BTDTRip%5D..By.Regenzy.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9efcc3cf60f22347f8094ec572886af8f8cef3db","infoHashBuffer":{"type":"Buffer","data":[158,252,195,207,96,242,35,71,248,9,78,197,114,136,106,248,248,206,243,219]},"announce":[],"urlList":[]}}