{"title":"lost.112.hdtv-lol.[BT].avi","uid":3273770,"size":366358528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ffc01607a5585636ea3e0e4e1c9d96cabb72ec8&amp;dn=lost.112.hdtv-lol.%5BBT%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slaine","files":1,"time":1105025575,"description":"12. Whatever the Case May Be\ngs: L. Scott Caldwell (Rose) Victor Browne (Shooter (Jason)) Achilles Gacis (Six Foot Five) Tim Halligan (Hutton) Michael Vendrell (Trucker) Dezmond Gilla (Baseball hat)\n\nJack, Kate and Sawyer fight over possession of a newly discovered locked metal briefcase which might contain insights into Kate's mysterious past. Meanwhile, Sayid asks a reluctant Shannon to translate notes he took from the French woman, a rising tide threatens to engulf the fuselage and the entire beach encampment, and Rose and a grieving Charlie tentatively bond over Claire's baffling disappearance.\n\nb: 05-Jan-2005 pc: 111 w: Damon Lindelof &amp;amp; Jennifer Johnson d: Jack Bender\n\n# NOTE: A Kate-Centric Episode. Rose (L. Scott Caldwell) makes her first appearance since episode Walkabout.\n# Emilie de Ravin (Claire) does not appear in this episode.\n# Malcolm David Kelley (Walt) does appear in this episode, but does not have any speaking lines.\n# The rising tide engulfing the fuselage was done by the producers in order to cut costs and not have to haul it into Hawaii for episodes.\n# The song Shannon (Maggie Grace) sings at the end of this episode is La Mer, the song that Bobby Darin sang as Beyond the Sea.\n# We find out Kate (Evangeline Lily) murdered her previous lover.","torrent":{"xt":"urn:btih:9ffc01607a5585636ea3e0e4e1c9d96cabb72ec8","amp;dn":"lost.112.hdtv-lol.%5BBT%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ffc01607a5585636ea3e0e4e1c9d96cabb72ec8","infoHashBuffer":{"type":"Buffer","data":[159,252,1,96,122,85,133,99,110,163,224,228,225,201,217,108,171,183,46,200]},"announce":[],"urlList":[]}}