{"title":"Who Cares","uid":3465496,"size":176642592,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a092da56efb64eb612556533fd566545d8948b2b&amp;dn=Who+Cares&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"divisive","files":1,"time":1143996078,"description":"&amp;#039;Who Cares listens to the voices of Liverpudlians being rehoused from inner city terraces to suburban high-rise estates. As we hear them describe how the moves have affected them negatively, we see the old terraces being demolished, boarded up houses, and vans taking people&amp;#039;s possessions to the new estates. The faceless &amp;#039;Corporation&amp;#039; of Liverpool (the local authority) has deemed that they must move, and few get any choice where they move to.\n\nTo the people of Liverpool 8, the destruction of their housing is the destruction of the security of their social world. A man relates how, as soon as the first people moved out from his street, thieves came to steal the lead from all the roofs. Extended families are separated and housed miles apart. As the terraces are demolished, and the glass is systematically smashed from the windows, children play in the ruins and throw stones at the vacated dwellings.\n\nLoneliness comes to the old, even among crowds. After a woman comments that she doesn&amp;#039;t know anyone in her neighbourhood anymore, the music of Marcia Griffith&amp;#039;s &amp;#039;Keep on Jumpin&amp;#039;&amp;#039; begins, and a montage of street scenes introduces the first black faces we see. In the 1960s and &amp;#039;70s, West Indians commonly took the place of the white working class in crumbling Victorian terraces. But no West Indian voices tell us their how they feel about the area.\n\nWho Cares was made &amp;#039;with the help of&amp;#039; Sir Arthur Elton, co-director (with Edgar Anstey) of Housing Problems (1935), which 35 years earlier promoted rehousing working-class communities in large new estates. Where Elton&amp;#039;s film identified urban terraces with dirt, poverty and unhappiness, Broomfield&amp;#039;s Liverpudlians mourn the loss of community and closeness the terraces brought, and find themselves unhappy and isolated in their brand new homes.&amp;#039;","torrent":{"xt":"urn:btih:a092da56efb64eb612556533fd566545d8948b2b","amp;dn":"Who+Cares","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a092da56efb64eb612556533fd566545d8948b2b","infoHashBuffer":{"type":"Buffer","data":[160,146,218,86,239,182,78,182,18,85,101,51,253,86,101,69,216,148,139,43]},"announce":[],"urlList":[]}}