{"title":"SuperWin XP Recovery CD Maker v1.01.07 (NeW!)","uid":3399986,"size":1121409,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a22cd525fe1b5f601507985200f1a3e855ec2834&amp;dn=SuperWin+XP+Recovery+CD+Maker+v1.01.07+%28NeW%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"useros","files":1,"time":1129999980,"description":"Use this program to make a Boot CD with rescue tools for WinXP and Win2000.\n\nNote!\nPlease be aware that XP Recovery CD requires you to make the CD with\nBartPE (which is free) and a CD burner. XP Recovery CD Maker\nwill help with this process. We do not sell the actual CD.\n\nFeatures:\nFix Windows Crashes\nXP Recovery CD has several tools to help you recover from a Windows XP or Windows 2000 crash.\n\nStart Windows with XP Recovery CD\nIf Windows will not start, put the XP Recovery CD in the CD drive and start your computer. The XP Recovery CD has the Bart's PE version of Windows on it which will allow you to access your drives and fix problems.\n\nCrash Troubleshooter\nThis easy-to-use troubleshooter steps you through the process of diagnosing what caused the crash and how to fix it.\n\nWinXP Restore Points\nThis tool finds registry backups in WinXP's Restore Points and lets you choose which one to recover.\nWinRescue's Crash Fixer\nWinRescue's popular Crash Fixer is duplicated in XP Recovery CD to make recovering from a crash with WinRescue Backups easy.\n\nDrive Explorer\nThis Windows Explorer look-a-like makes it easy for you to find, copy, rename, move, and delete files and folders.\n\nUnzipper and Extractor\nThis tool extracts files from zip files and WinRescue Backups.\n\nThe Maker\nXP Recovery CD is a plugin which is built on BartPE CD. Bart's PE CD is free and must be used with XP Recovery CD. Our setup program, XP Recovery CD Maker, will guide you through the process of downloading BartPE CD and using it to make an XP Recovery CD.\n","torrent":{"xt":"urn:btih:a22cd525fe1b5f601507985200f1a3e855ec2834","amp;dn":"SuperWin+XP+Recovery+CD+Maker+v1.01.07+%28NeW%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22cd525fe1b5f601507985200f1a3e855ec2834","infoHashBuffer":{"type":"Buffer","data":[162,44,213,37,254,27,95,96,21,7,152,82,0,241,163,232,85,236,40,52]},"announce":[],"urlList":[]}}