{"title":"SWSoft.Plesk.v7.5.5_build051007.11","uid":3422975,"size":475487399,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a3023eb534d5ee7155f3bc7ac36a54751221e589&amp;dn=SWSoft.Plesk.v7.5.5_build051007.11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"legiopatrianostra","files":75,"time":1135152911,"description":"Plesk 7.5 for Windows 2000/XP/2003 (2003 preferably)\n\nOverview\nPlesk 7.5 for Windows is the latest Plesk release specifically designed to offer hosting providers the most stable and secure control panel available on a Windows platform. Constructed on the strong Plesk 7 for Windows foundation, this new release incorporates product feedback received both from Microsoft specialists and our customers. Building on features in the Windows 2003 platform, Plesk 7.5 for Windows has improved existing security features and added new security measures. More...\n\nWhat's new?\nPlesk 7.5 for Windows will enhance your existing Windows offerings or help you broaden your existing service horizons. This new release has incorporated dozens of user-suggested improvements over the previous version. More...\n\nBenefits\nThe Plesk family of control panel solutions helps organizations do more with less. Every day you're asked to make your infrastructure more efficient, improve productivity and deliver more applications. Plesk 7.5 for Windows allows you to do all this faster, more securely, more easily and at lower cost. More...\n\nDetails\nBrandishing an entirely NEW &quot;Look and Feel&quot; Plesk 7.5 for Windows is easy to use, convenient to install and manages all the primary applications needed for Windows hosting. Perfect for the dedicated server running Windows 2003 Plesk's rock solid reputation and tested tough moniker make it the only choice for Professional HSP's worldwide. Plesk is now the &quot;must have&quot; software in every dedicated hosting service professional's arsenal of server management products. More...\n\nAdd-Ons\nPlesk 7.5 for Windows lets you elevate your service offerings to the next level and enhance the versatility of your control panel with Add-on Modules. View the interface in your native language, offer your customers Anti-Virus and Anti-Spam Software and/or an entire vault of applications including osCommerce software. Plesk's Add-on modules can be purchased a la carte or in our &quot;Power Pack&quot; bundled deals for additional savings. More...\n\nRequirements\nPlesk 7.5 for Windows has specific system requirements that when followed can help you maximize your &quot;return on investment (ROI)&quot;. SWsoft has posted these simple guidelines to show you how to maximize space and host up to 2000 domains on a single system. Use our domain calculation table to determine what your minimum hardware needs will be. More...\n\n***** KEY INCLUDED - VALID FOR : *****\nSlave servers limit 10 \nMaximum number of client account Unlimited \nMaximum number of domains Unlimited \nMaximum number of mail accounts Unlimited \nMaximum number of web users Unlimited \nMaximum number of language packs 100 \nMPC slave server identifier MyPlesk.com \nMPC functionality On \nAdministrator can manage MPC service accessibility On \nValid for Virtuozzo only No \nAbility to use Microsoft SQL Server On \nAbility to use Tomcat On \nAbility to perform global operations on objects (group operations) On \nAbility to manage system access On \nAbility to use traffic reporting On \nAbility to manage client templates On \nAbility to manage notifications On \nAbility to use event manager On \nAbility to use action logging On \nAbility to use the backup functions On \nAbility to manage domain and client account expiration dates On \nAbility to manage subdomains On \nAbility to use ColdFusion On \nAbility to use application vault On \nAbility to use Spam Filter On \nAbility to use Antivirus On \nAbility to use the site builder On \nAbility to use Help Desk On \nAbility to use Migration Manager On \nAbility to manage updater preferences On \n\nPost Installation Notes\nLogin: admin\nPassword: setup\n","torrent":{"xt":"urn:btih:a3023eb534d5ee7155f3bc7ac36a54751221e589","amp;dn":"SWSoft.Plesk.v7.5.5_build051007.11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3023eb534d5ee7155f3bc7ac36a54751221e589","infoHashBuffer":{"type":"Buffer","data":[163,2,62,181,52,213,238,113,85,243,188,122,195,106,84,117,18,33,229,137]},"announce":[],"urlList":[]}}