{"title":"formula 1 end.mpg","uid":3399193,"size":34302240,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a3dfe97f68c577a221d414f27826502814bf780b&amp;dn=formula+1+end.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neohunky","files":1,"time":1129827606,"description":"Extracts from an interview with the Renault F1 Team Technical Director. \n\n\nBob, tell us about the atmosphere in Enstone on Monday morning?\nBB: What a fantastic feeling. I have been around racing quite a few years, and I have never experienced anything like this. This is a team achievement, and it gives a true sense of satisfaction and pride.\n\nNot did the team win, but it did so with panache!\nBB: That was immensely satisfying. People had criticised us at points, but we wee confident in our developments and by our calculations, we looked on target to be better than McLaren by the last race. And that was how it proved.\n\nDid you every doubt the team could do it?\nBB: We always knew the season would go down to the wire and even when McLaren?s advantage was significant, I was confident we had the ability to take it to the final race. We pushed hard, took risks when we had to, didn?t when we didn?t need to. It was a well-balanced approach that paid off.\n\nCan the team do it again?\nBB: Absolutely. It is something we will make sure the team takes on board. We have no intention of making the same errors as some other teams have made in the past. There is no arrogance about our position, and we never take for granted that it is secure. I think we saw Ferrari do it at the start of the season, and McLaren clearly underestimated us at the end. That won?t be our attitude for next year. It will be a question of hard work to ensure we deliver.\n\n\n","torrent":{"xt":"urn:btih:a3dfe97f68c577a221d414f27826502814bf780b","amp;dn":"formula+1+end.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3dfe97f68c577a221d414f27826502814bf780b","infoHashBuffer":{"type":"Buffer","data":[163,223,233,127,104,197,119,162,33,212,20,242,120,38,80,40,20,191,120,11]},"announce":[],"urlList":[]}}