{"title":"&quot;Protest Warriors&quot; almost gets their ass kicked","uid":3385548,"size":14474822,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:a513a7c877714c2ae57507de454050d00bb23b18&amp;dn=%5C%22Protest+Warriors%5C%22+almost+gets+their+ass+kicked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Worldwalker","files":1,"time":1127214909,"description":"About two thousand people converged in Crawford for the ?Cindy (Sheehan) Doesn?t Speak for Me? rally Saturday. However, in a odd turn of events, and despite repeated pleadings that ?we are on your side, we are on the right,? the rally turned on conservative youth &quot;Protest Warriors.&quot;\n\nFree Republic and the their right-wing youth group of ?ironic? Protest Warriors were repeatedly thanked for their support and participation in the rally. The Protest Warriors are young people who usually appear at anti-war related activities with slogans based on ?right-wing irony,? such as ?War Has Never Solved Anything (except for everything).? However, in a odd turn of events, and despite repeated pleadings that ?we are on your side, we are on the right,? the rally turned on these kids. Shouting ?Cindy Go Home!? a small mob gathered around the three or four Protest Warriors, attacked their oversized signs, and began stomping on the signs. \n\nVisibly shaken, the Protest Warriors beat a retreat from the rally to the chants of ?Get Out of Here Liars!? Over and over again, ?We are on your side? were meet by ?Liars!? One man clarified that even if they were trying to support the war, they were confusing people, and that ?it is the devil who wanted to sew confusion.? It is safe to say that irony, or any opinions that hinted at ?shades of gray? were not welcome in Bush Country.","torrent":{"xt":"urn:btih:a513a7c877714c2ae57507de454050d00bb23b18","amp;dn":"%5C%22Protest+Warriors%5C%22+almost+gets+their+ass+kicked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a513a7c877714c2ae57507de454050d00bb23b18","infoHashBuffer":{"type":"Buffer","data":[165,19,167,200,119,113,76,42,229,117,7,222,69,64,80,208,11,178,59,24]},"announce":[],"urlList":[]}}