{"title":"Curd Duca- Elevator 2","uid":3460332,"size":67993672,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a5571ba68fd40e49e2c89501e8b916108e053cac&amp;dn=Curd+Duca-+Elevator+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"b&amp;g","files":32,"time":1142913634,"description":"32 tracks\nArtist: Curd Duca\nAlbum: Elevator 2\nLabel: Mille Plateaux\n\n********\n &lt;a href=&quot;\nhttp://www.angbase.com/interviews/curd_duca.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.angbase.com/interviews/curd_duca.html&lt;/a&gt;\n\nIt is Aphex Twin meets Martin Denny on &quot;Bam Boo&quot;, John Oswald (Plunderphonics) meets Jackie Gleason on &quot;Poker&quot;, or Negativland commissioned to do the ad soundtrack for a crumbling paradise motel on a sinking tropical isle. Or Eno as Quasimodo on &quot;Bell&quot;. A Peter Gunn (&quot;gunn&quot;) sample in a Moulinex offers whimsical explorations of sound and memory that remind us of the Kraftwerk maxim: machines may indeed have soul (or at least a number of composition-divided-by-whimsy-times-funk settings).\n\nHis &quot;pieces are not parodies because there is too much fondness and sentimental value in them&quot;. He clarifies: &quot;I&amp;#039;m mesmerized sometimes in a drug-induced-like state of nerdy fascination, letting go of all inhibitions like good taste, good intentions, the hipness factor, and indulging in &quot;false&quot; sentiments with my mind wide awake&quot;. These involuntary twitches, ur-dancebeats, and mnemonic chops which determine the (un)making of his (re)music must emerge from some interstitial region located between what is heard and how it is remembered. Regardless, his unbridled sonic enthusiasms will continue to take him into the inspirational hidden ecstasy of recuperated sound.\n\nThere is a warped and wonderfully evocative quality which makes the &quot;Digitalanalog Mood Music&quot; on his latest cds, &quot;Elevator #1-3&quot; on Mille Plateaux warmer than run-of-the-mall, bachelor pOd and retro-martini, faux leisure musics of the moment because his choices are not predicated on demographical considerations. Any one of the &quot;Elevator&quot; series is an excellent introduction into the dapper madcapped world of post-nostalgic pata-modernism.","torrent":{"xt":"urn:btih:a5571ba68fd40e49e2c89501e8b916108e053cac","amp;dn":"Curd+Duca-+Elevator+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5571ba68fd40e49e2c89501e8b916108e053cac","infoHashBuffer":{"type":"Buffer","data":[165,87,27,166,143,212,14,73,226,200,149,1,232,185,22,16,142,5,60,172]},"announce":[],"urlList":[]}}