{"title":"Alex Jones - Police State 2000 (1999)","uid":3416335,"size":723724288,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5a22898d184acbe1c5c2bd53e7ecfc620458d54&amp;dn=Alex+Jones+-+Police+State+2000+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1133488332,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; (and now &quot;Alex Jones&quot; too) and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nThe powerful central government is gearing up for the TOTAL TAKEOVER. Alex Jones exposes the growing relationship between the military and police. Witness US marines training with foreign troops and learning how to control and contain civilian populations as practiced during Operation: Urban Warrior. You will see special forces helicopter attacks on south Texas towns, concentration camps, broad Unconstitutional police actions, search and seizure and more.\n\nGenre: Documentary \nVideo Codec: DivX 5 \nVideo: ~799 kbit/s\nRuntime: 121 Min \nAudio Format: ~64 kbit/s MP3 VBR  \nFrame Size: 352x240 \nFramerate: 29,970 fps \nLanguage: English\n\nThe 'used FourcCC' in the .avi header is DX50. Hence, these files will play back on MPG4 (i.e. DivX5) compatible DVD-players.","torrent":{"xt":"urn:btih:a5a22898d184acbe1c5c2bd53e7ecfc620458d54","amp;dn":"Alex+Jones+-+Police+State+2000+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a22898d184acbe1c5c2bd53e7ecfc620458d54","infoHashBuffer":{"type":"Buffer","data":[165,162,40,152,209,132,172,190,28,92,43,213,62,126,207,198,32,69,141,84]},"announce":[],"urlList":[]}}