{"title":"Soccer in the New World - 320 x 240 Xvid English","uid":3374726,"size":715452786,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a600907c05cefad06fec421d5608d8dd918262bd&amp;dn=Soccer+in+the+New+World+-+320+x+240+Xvid+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nobuzz","files":2,"time":1125002140,"description":"Maxxed football prsents:\n\ni Name: Soccer in the New World\ni Language: English\ni Number Of Files: plus nfo file\ni Ripper: nobuzz\ni Release Date: Aug 25 05\ni\ni Video Info - -\ni Audio: 128 kbps LAME mp3\ni Bit Rate: 872 kbps\ni Codec: Xvid\ni Frame Rate: 29.97\ni Resolution: 320 x 240\n\nSince 1586 when sailors of the HMS Sunneshine played the Eskimo of Gilbert Sound on the West Coast of Greenland during a voyage in search of the Northwest Passage, soccer has been a part of the North American sporting scene.\n\nIn fact, the United States was the first sovereign country outside of Great Britian to establish a soccer club and one of the first to form a national governing body. But unlike baseball, basketball, ice hockey and grid iron football, soccer has remained the poor cousin of the North American professional sports scene.\n\nConsidering soccer is the World's most popular sport, one has to ask! What on earth went wrong? We look back to the beginning with a cursory glance at its history in North America, and primarily focus on the trails and tribulations of soccer's 'on again off again' professional existence in North America over the past fifty years.\n\nThis 2-part documentary delves into the history of soccer in North America with archival footage and interviews. Footage includes the 1912 USA vs. Canada finals and the landmark USA knocking England out of the finals in Brazil.\n\nPart One: Starting with the first game played in Greenland in 1586, a look at the history and rise of soccer in North America up to the 1970's.\n\nPart Two: A look at the contemporary history of soccer in North America, getting at the truth of how soccer fell from popularity after the 1980?s and the resurgence in popularity today.\n\nboth parts are combined into one file","torrent":{"xt":"urn:btih:a600907c05cefad06fec421d5608d8dd918262bd","amp;dn":"Soccer+in+the+New+World+-+320+x+240+Xvid+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a600907c05cefad06fec421d5608d8dd918262bd","infoHashBuffer":{"type":"Buffer","data":[166,0,144,124,5,206,250,208,111,236,66,29,86,8,216,221,145,130,98,189]},"announce":[],"urlList":[]}}