{"title":"Charles Todd - Search the Dark","uid":3428416,"size":335050537,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a616480bf3930a0d5b68cfa057447d171b5998b9&amp;dn=Charles+Todd+-+Search+the+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"billfrooguk","files":55,"time":1136564259,"description":"Unabridged. Read by Samuel Gillies. MP3 format\n\nAmazon.com\nIn Search the Dark, the third entry in Charles Todd's remarkable series, the walking-wounded survivors of World War I crowd the English landscape. Scotland Yard's Inspector Rutledge is one of many who suffer from shell shock. He constantly hears--and responds to--the voice of Hamish, a Scottish soldier he shot for cowardice. His latest case does not help his fragile state of mind as it involves another weary and discouraged veteran, Bert Mowbray.\n\nOn his way to Lyme Regis to search for work, Bert looks out of the train window in a town called Singleton Magna, and sees an unbelievable sight--his wife and two children who he thought were killed in a London bombing raid. He leaps off the train and tries to find his family, racing desperately across fields and country roads, and finally winding up asleep under a tree. Meanwhile, the battered body of a woman is found on the edge of a cornfield, and Mowbray is arrested. Is the woman his wife? Did he kill her? And what happened to the two children who were with her? \n\nEverywhere Rutledge looks, he shows us various forms of damage caused by the war--from the hopes of a local girl whose lover returned with a French wife, to the trauma that Mowbray is going through. As in the first two books, A Test of Wills and Wings of Fire, Todd demonstrates the massive damage done to an entire country by focusing on the small, personal battles of the survivors. --Dick Adler","torrent":{"xt":"urn:btih:a616480bf3930a0d5b68cfa057447d171b5998b9","amp;dn":"Charles+Todd+-+Search+the+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a616480bf3930a0d5b68cfa057447d171b5998b9","infoHashBuffer":{"type":"Buffer","data":[166,22,72,11,243,147,10,13,91,104,207,160,87,68,125,23,27,89,152,185]},"announce":[],"urlList":[]}}