{"title":"The Oulaw Music DVD # 1","uid":3414714,"size":2932666256,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a68dd2b12827eb6136f5ceb84d2c63f457ca2da5&amp;dn=The+Oulaw+Music+DVD+%23+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wallace1957","files":9,"time":1133148275,"description":"In 1998, I started Recording all the Outlaw Channel that I could before this channel decided to scramble and then later went off the air. I recorded around 100 hours of commercial free Country shows such as the Porter Wagner show, The Wilburn Brothers show, Country Caravan, Country Carnival, Pop Goes the Country, The Gospel Jubilee, and others. These shows go back to the late 1950s to the early 1980s. I have converted 12 two hour DVDs from V.H.S. and used ULEAD DVD Maker. I hope this DVD #1 doesn't get banned and a lot of people enjoy this DVD! This DVD will start with the Porter Wagner show from 1961 and will go on to other shows featuring Merle Travis, Charlie Pride, Loreta Lynn, Chet Atkins, Bobby Bare, Ray Price, Young Hank WIlliams Jr., Del Reeves, Jim Ed Brown, and as the DVDs keep coming, The Late Great Jim Reeves, The Florida Boys, The Happy Goodmans, The Original Hinsons, The Kingsmen, And Many others to follow. In the Past, I have uploaded Roy Buchanan and Rory Gallagher but I thought this would be an interesting DVD to try out and see if anybody likes this DVD. I do not have any artwork for this. I figured all those artist out there could come up with some artwork. The first time that I tried to up load on dimeadozen.org, I got banned  but my stuff still ends up on Dime and then it is sold on E-BAY. I dont sell anything on E-bay and think everyone should just trade but I am not going to give a lecture like some of the hard core crybabys that will not admit that they buy from E-BAY. I know a lot of people do not have computers and would pay almost anything for there favorite artist and I dont blame them!!","torrent":{"xt":"urn:btih:a68dd2b12827eb6136f5ceb84d2c63f457ca2da5","amp;dn":"The+Oulaw+Music+DVD+%23+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a68dd2b12827eb6136f5ceb84d2c63f457ca2da5","infoHashBuffer":{"type":"Buffer","data":[166,141,210,177,40,39,235,97,54,245,206,184,77,44,99,244,87,202,45,165]},"announce":[],"urlList":[]}}