{"title":"The.Professional(dvdrip.divx.avi)","uid":3412011,"size":734816093,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6a9992f8f18ce5a83970877a482410eac9a9f0d&amp;dn=The.Professional%28dvdrip.divx.avi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"weaponofchoice","files":2,"time":1132592373,"description":"Title: The Professional (aka L&amp;eacute;on)\n\nYear: 1994\nDirected by: Luc Besson\nGenre: Action / Crime / Drama / Thriller\n\nSize: 700.7 MB\nFormat: dvdrip.divx.avi\nResolution: 720x480\nDuration: 1:49:00\n\nDescription: Mathilda, a twelve-year old New York girl, is living an undesirable life among her half-family. Her father stores drugs for two-faced cop Norman Stansfield. Only her little brother keeps Mathilda from breaking apart. One day, Stansfield and his team take cruel revenge on her father for stretching the drugs a little, thus killing the whole family. Only Mathilda, who was out shopping, survives by finding shelter in L&amp;eacute;on's apartment in the moment of highest need. Soon, she finds out about the strange neighbour's unusual profession - killing - and desperately seeks his help in taking revenge for her little brother. L&amp;eacute;on, who is completely unexperienced in fatherly tasks, and in friendships, does his best to keep Mathilda out of trouble - unsuccessfully. Now, the conflict between a killer, who slowly discovers his abilities to live, to feel, to love and a corrupt police officer, who does anything in his might to get rid of an eye witness, arises to unmeasurable proportions - all for the sake of a little twelve-year old girl, who has nearly nothing to lose.\nTagline: A perfect assassin. An innocent girl. They have nothing left to lose except each other. He moves without sound. Kills without emotion. Disappears without trace. Only a 12 year old girl... knows his weakness.","torrent":{"xt":"urn:btih:a6a9992f8f18ce5a83970877a482410eac9a9f0d","amp;dn":"The.Professional%28dvdrip.divx.avi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a9992f8f18ce5a83970877a482410eac9a9f0d","infoHashBuffer":{"type":"Buffer","data":[166,169,153,47,143,24,206,90,131,151,8,119,164,130,65,14,172,154,159,13]},"announce":[],"urlList":[]}}