{"title":"Lacrimosa - Stille (1997) [FLAC]","uid":3403000,"size":482096862,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7f93a046a1310da20b0b652c7ef5840525e5ade&amp;dn=Lacrimosa+-+Stille+%281997%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hybr1d","files":12,"time":1130628254,"description":"Genres:\n~~~~~~~\ngothic metal, doom, dark, symphonic\n\n\nShort:\n~~~~~~\nLacrimosa delivers another masterpiece of emotional gothic/dark metal,\nthis one is more dark, more agressive and less heavy on the classics.\n\n\nTracklist:\n~~~~~~~~~~\n01. Der erste Tag\n02. Not Every Pain Hurts\n03. Siehst du mich im Licht?\n04. Deine N&amp;auml;he\n05. Stolzes Herz\n06. Mein zweites Herz\n07. Make It End\n08. Die Stra&amp;szlig;e der Zeit\n\n\nDescription:\n~~~~~~~~~~~~\n&quot;Stille&quot; (Silence) tells in over seventy minutes the story of a mind\nwondering and starts in &quot;The First Day&quot; with a selfanalysis. Intellect\nand emotion find their discord. Fears are becoming defined and\naccusations are taken notice of, followed by the courage of forgiveness,\nthe courage of selfperception and the inner establishment: &quot;Not Every\nPain Hurts&quot;. Purified, same enemies are brought to trial. &quot;Siehst Du mich\nim Licht?&quot; (Can you see me in the light?&quot;) accuser and defender are\nquestening themself while sitting in the same scale, discussing about\nlies and defamations and penetrating their courses. Hate and desperation\nare not seldom walking hand in hand with irony and cynicism, in contrast\nto the sensible and selfcritical view to a unreachable love: &quot;Deine N&amp;auml;he&quot;\n(Your Closeness).\n\nTo be able to learn from every downfall, to hold on the hope to find a\nlight even in the darkest night and to reach the power to be able to\nstand up over and over again, that's what the title &quot;Stolzes Herz&quot;\nmediates also in the nearly two minutes longer album version\nunmistakable, and builds the topical bridge to &quot;Mein zweites Herz&quot; (My\nSecond Heart), which is in a selfexplaining form not only beating for\nitself alone, as this title is to be seen as one of the key moments and\nas a piece of the heart of the entire record in itself. &quot;Make it end&quot; is\nthe radical settlement with all the impressions, hopes, mistakes and\nexperiences of the past. The fight for the own will, for the own heart.\nThe fight for the own life and the end of hypocrisy and the\nselfcheating. No compromises!\n\nConcluding, &quot;Die Strasse der Zeit&quot; (The Road of Time) brings the\ncircle to close in a nearly fifteen minutes timetravel and transfers\nthe happening to take place on an imaginary street leading back to the\npast. And after the travel through the night passes, the sun drives\naway the mist and from the ruins of their fathers the young and\npromising culture awakes.\n\n","torrent":{"xt":"urn:btih:a7f93a046a1310da20b0b652c7ef5840525e5ade","amp;dn":"Lacrimosa+-+Stille+%281997%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f93a046a1310da20b0b652c7ef5840525e5ade","infoHashBuffer":{"type":"Buffer","data":[167,249,58,4,106,19,16,218,32,176,182,82,199,239,88,64,82,94,90,222]},"announce":[],"urlList":[]}}