{"title":"Miss Agente Especial 2 Armada Y Fabulosa DVD XViD AC3","uid":3377080,"size":1467900971,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a9d556f64b13324fb739beed8e1cd8da84d55af5&amp;dn=Miss+Agente+Especial+2+Armada+Y+Fabulosa+DVD+XViD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Divxtotal.CoM","files":5,"time":1125489101,"description":"En &quot;Miss agente especial 2: Armada y fabulo-sa&quot; encontramos a la agente del FBI Gracie Hart (Sandra Bullock) poco despu&amp;eacute;s de haber neutralizado con &amp;eacute;xito una amenaza contra el concurso de belleza de Miss Estados Unidos mientras trabajaba en secreto haci&amp;eacute;ndose pasar por concursante y de convertirse en una sensaci&amp;oacute;n medi&amp;aacute;tica de la noche a la ma&amp;ntilde;a-na. Las cosas no le han ido muy bien &amp;uacute;ltimamente. Mientras se re-cupera de una relaci&amp;oacute;n sentimental rota, y frustrada al comprobar que su nueva fama est&amp;aacute; poniendo en peligro el trabajo secreto que tanto ama, Gracie permite de mala gana que su jefe, el agente McDonald (Ernie Hudson), la convenza de servir al Departamento del &amp;uacute;nico modo ahora posible: vestida y peinada para el circuito de los programas de entrevistas como ?el rostro del FBI?. Aprovechan-do el mayor golpe maestro a nivel de relaciones p&amp;uacute;blicas en la his-toria del departamento, el FBI lanza a su nueva ?chica de p&amp;oacute;ster? a un torbellino de sesiones fotogr&amp;aacute;ficas para la prensa en las que re-crea sus haza&amp;ntilde;as en el concurso de belleza ante un p&amp;uacute;blico lleno de adoraci&amp;oacute;n, con la ayuda del estilista personal Joel (Diedrich Ba-der) para pulir su aspecto. Aunque al principio se resiste, Gracie pronto se entusiasma con la atenci&amp;oacute;n que despierta y no tarda mu-cho en meterse en su nuevo papel. Su nueva compa&amp;ntilde;era Sam Fu-ller (Regina King), una dura y ambiciosa agente que sin duda no es su mayor fan, es la primera en se&amp;ntilde;alar que la mimada estrella del Departamento se est&amp;aacute; convirtiendo en la Barbie del FBI. Pero cuan-do los mejores amigos de Gracie, la ganadora del concurso de be-lleza Cheryl Frazier y el presentador Stan Fields (Heather Burns y William Shatner) son secuestrados en Las Vegas, el instinto poli-cial de Gracie vuelve a aflorar. Los jefazos del FBI, que no quieren arriesgarse a perder a su popular mascota, limitan su intervenci&amp;oacute;n a una conferencia de prensa en Las Vegas y env&amp;iacute;an a Sam como su guardaespaldas, dejando que el supervisor local del FBI Collins (Treat Williams) se haga cargo del trabajo de rescate mientras que el joven agente Jeff Foreman (Enrique Murciano) trata de mantener a Gracie y a su s&amp;eacute;quito al margen hasta que todo termine. Pero cuando parece que Collins est&amp;aacute; llevando la investigaci&amp;oacute;n en la di-recci&amp;oacute;n equivocada, Gracie debe demostrar una vez m&amp;aacute;s que las apariencias son enga&amp;ntilde;osas y que cuando se trata de solucionar un caso dif&amp;iacute;cil o de ayudar a sus amigos no hay nada que ella no ha-ga.\n","torrent":{"xt":"urn:btih:a9d556f64b13324fb739beed8e1cd8da84d55af5","amp;dn":"Miss+Agente+Especial+2+Armada+Y+Fabulosa+DVD+XViD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d556f64b13324fb739beed8e1cd8da84d55af5","infoHashBuffer":{"type":"Buffer","data":[169,213,86,246,75,19,50,79,183,57,190,237,142,28,216,218,132,213,90,245]},"announce":[],"urlList":[]}}