{"title":"XBMC Xbox Media Center 1.1.0 2005-02-21 [Y]","uid":3293408,"size":40750485,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ab5a56888d8b5d3d698da8636d2556cecaebb0a0&amp;dn=XBMC+Xbox+Media+Center+1.1.0+2005-02-21+%5BY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ythan","files":1,"time":1109032882,"description":"21-02-2005 fixed: Yet another weather localization fix. Thanks KoTiX!\n21-02-2005 fixed: Updated system/players/mplayer/mplayer.dll to current CVS (includes flac fix + crash fix)\n21-02-2005 fixed: Music Database Cleanup would remove all songs from database.\n21-02-2005 fixed: iTunes sharing caused crash if no connection (or iTunes sharing) was available.\n21-02-2005 added: More weather localization thanks to Kotix. Busy is also localized (string 503).\n21-02-2005 added: Writing files returns false if unable to do so. Means that moving files will only allow the source file to be deleted if the copy was successful - thanks to modplug.\n21-02-2005 fixed: Highlight sometimes didn't go away in filemanager when doing popup menu stuff.\n21-02-2005 fixed: Destination files weren't deleted if copy/move was cancelled.\n21-02-2005 added: Option to enable fatal error handler on fatal errors in XBoxMediaCenter.xml. Defaults to false (off).\n21-02-2005 added: ButtonScrollers with &amp;lt;wraparound&amp;gt; off can move to a different control off the top + bottom (or left + right for horizontal scrollers).\n21-02-2005 fixed: OSD audio menu lockup\n20-02-2005 changed: Enlarge Vobsubs changed to Resize Vobsubs. Percentage runs from 30% -&amp;gt; 200%. Defaults to 100%. If you don't reset your settings on upgrade (which there is no need for) it will be initally set to 30%, which you may wish to change.\n20-02-2005 fixed: Buttonscroller focus from another control didn't update background images correctly.\n20-02-2005 fixed: OSD crashes when filling listcontrols.\n20-02-2005 fixed: Noise level was not used correctly for video filters.\n20-02-2005 fixed: various info related things (eg music current pos could show negative times)\n20-02-2005 fixed: Kai avatar on toast dialog wasn't shown in correct position.\n20-02-2005 changed: Improved handling of resolution switching in GUI-&amp;gt;Fullscreen video.\n20-02-2005 fixed: Comborenderer small window in different resolution.\n19-02-2005 added: System.CPUTemperature, System.GPUTemperature, and System.FanSpeed to the infoManager.\n19-02-2005 changed: audiobuffer sizes for smoother pal video\n19-02-2005 added: Option to disable thumbnail generation during picture viewing.\n19-02-2005 fixed: LCD: last bar of the progress is now shown\n19-02-2005 fixed: LCD: execution-timing for the LCD and SmartXX (sometimes the display crashs, hope it's fixed now)\n19-02-2005 fixed: LCD: backlight-fix for the X3-LCD (thnx to GreenGian and SniperKil for testing)\n19-02-2005 added: Smooth progress bar for the HD44780 (stop-symbol was not used) (thnx to GreenGian and SniperKil to make it smooth)\n19-02-2005 cleanup: LCD progress bar code moved to LCD class\n18-02-2005 fixed: &amp;lt;allowoverlay&amp;gt; doesn't work in music songs\n18-02-2005 fixed: Localization of UV data in weather.\n18-02-2005 fixed: crash bug in thumbpanels when switching from large-&amp;gt;small without resetting current focus.\n18-02-2005 added: progress bar for the LCD (smooth on KS0073, on HD44780 later)\n18-02-2005 added: LCD option for HD44780/KS0073 controllers\n17-02-2005 fixed: dialog select doesn't free its items when it is closed\n17-02-2005 fixed: black screen when going from visualisation -&amp;gt; other window -&amp;gt; press stop -&amp;gt; press back \n17-02-2005 updated: Finnish language file (Thnx to jutski)\n16-02-2005 updated: German language file\n16-02-2005 updated: Norwegian language file (Thnx to vnmartinsen)\n16-02-2005 updated: Italian language file (Thnx to kotix)\n16-02-2005 updated: German (Austrian) language file (Thnx to CEOMR)\n16-02-2005 fixed: Crash when going from FullScreenVideo -&amp;gt; other window -&amp;gt; press stop -&amp;gt; press back twice.\n16-02-2005 fixed: Crash bug in Thumbpanels + page number display.\n16-02-2005 cleanup: Video time/duration is all calculated in the infoManager now.\n16-02-2005 fixed: Lockups in blank dirs when hide parent folder item is on.\n15-02-2005 fixed: possible lock ups in video playlist and my programs when no ThumbnailPanel present\n15-02-2005 fixed: [ 1122417 ] Pressing pause after playing finished results in an exception\n15-02-2005 fixed: enable/disable &amp;quot;Repeat Folders&amp;quot; option only works after restart\n15-02-2005 fixed: More weather localization stuff. New ids need translating: 388-393. Thanks to vnm.\n15-02-2005 fixed: [ 1122791 ] LCD: no display of current playbacktime while videoplayback\n15-02-2005 fixed: wrong display in the lcd of following asci characters: _ [ ] ","torrent":{"xt":"urn:btih:ab5a56888d8b5d3d698da8636d2556cecaebb0a0","amp;dn":"XBMC+Xbox+Media+Center+1.1.0+2005-02-21+%5BY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5a56888d8b5d3d698da8636d2556cecaebb0a0","infoHashBuffer":{"type":"Buffer","data":[171,90,86,136,141,139,93,61,105,141,168,99,109,37,86,206,202,235,176,160]},"announce":[],"urlList":[]}}