{"title":"911 - September 11 Evidence to the Contrary - FINAL PRODUCER'S","uid":3407161,"size":137824620,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:ab8331fc95742b8423893d4ee4ae98cc1f7b48de&amp;dn=911+-+September+11+Evidence+to+the+Contrary+-+FINAL+PRODUCER%5C%27S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ReVIsed","files":1,"time":1131507141,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be solved sooner than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nThis version of SEPTEMBER 11: Evidence to the Contrary is the Producers Final Cut.\n\nThe previous video of the same title had production flaws that have been corrected in this version. If you have downloaded the other, We suggest deleting it and getting this superior version.\n\nAdded to this version is the &quot;Conspiracy Theory Rock&quot; cartoon only aired once on NBC. Eric Hufscmid's portion has been trimmed down to only include the facts of the September 11 case and his accusation of the 911 Truth Movement have been omitted, this was done at the suggestion of our friends at www.septembereleventh.org because the facts of the case are more important than his personal speculation of why he was not allowed to speak at a 9/11 conference. Some may consider this cencorship; we consider it sticking to the facts of the matter at hand.\n\nThis video is composed with work of Alex Jones and Eric Hufschmid. You will find that the information contained in this is a great compilation of 911 evidence to the buildings having explosives in them. With an excerpt from Alex's Martial Law 11 and Eric's &quot;Are the criminals frightened&quot; a snippet from &quot;Loose Change&quot; and commercials from Reopen911.org this 59:00min video is a great intro for anyone seeking answers about that day. I converted all the relevant video's into MPG format using Boilsoft ASF Converter, then used PINNACLE STUDIO 9 to edit it all together. The file size it is 131MB and was compressed into WMV format using BOILSOFT ASF CONVERTER (from a larger 589mb MPEG)........ There is 1 file in this torrent.......This video is going to be aired on Chicago Public access in November..............\n\n.........................................................More to come... Enjoy the TRUTH.....KEEP ON SEEDIN'!!!\n\n[THANK YOU ConCen FOR HOSTING THIS TORRENT]\n-----------------------------------------SEEDED and PRODUCED BY THE LONE LANTERN SOCIETY\n.........................................................................................[ www.lonelantern.org ]","torrent":{"xt":"urn:btih:ab8331fc95742b8423893d4ee4ae98cc1f7b48de","amp;dn":"911+-+September+11+Evidence+to+the+Contrary+-+FINAL+PRODUCER%5C%27S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab8331fc95742b8423893d4ee4ae98cc1f7b48de","infoHashBuffer":{"type":"Buffer","data":[171,131,49,252,149,116,43,132,35,137,61,78,228,174,152,204,31,123,72,222]},"announce":[],"urlList":[]}}