{"title":"Bill and Teds Excellent Adventure [DVD ISO]","uid":3378874,"size":4688648192,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ab9d35d62d6ac600ae2026e7a2415de567b7b20e&amp;dn=Bill+and+Teds+Excellent+Adventure+%5BDVD+ISO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ProjectBlack","files":1,"time":1125824136,"description":"Bill and Teds Excellent Adventure [DVD ISO] [www.projectblack.com]\n\nKeanu Reeves (The Matrix) and Alex Winter (The Lost Boys) deliver &quot;spirited performances&quot; (The Hollywood Reporter) in the original righteous comedy about the two ditzy dudes from San Dimas, California.  Also starring George Carlin, this hysterically funny historical comedy is a &quot;snappily directed&quot; (Time), &quot;bouncy good time&quot; (The Boston Globe), and a party that goes on and on!\n\nBill (Winter) and Ted (Reeves) have spent so much time forming their rock band, The Wyld Stallyns, that they're flunking history.  Woah, duuuude! And when Ted's dad threatens to send him away to military school, Bill and Ted realize it could mean the most heinous end of The Stallyns!  Luckily, a guardian angel from the future, Rufus (Carlin), has come to them with a most bodacious solution:  a time-traversing phone booth to take them into the past to learn about the world from some of history's most influential personalities!  Their journey through time turns out to be a blast... but will they learn enough to pass their class?\n\nFEATURES OF THIS TORRENT:\n* Full Length Feature\n* English Language\n* English, French, Spanish Subtitles\n* ISO in DVD-5 Format: No special media or burners required!\n* Menu removed, chapter structure remains.\n* Adverts, special features (just a trailer) removed.\n* Encoded at 93% quality!\n\nBe sure to SEED after completion!  This is the COMPLETE FEATURE FILM!  Use Alcohol 120%, or whatever software you trust to burn this DVD and watch it on your TV!\n\nYou're invited to check out the new Torrent Classifieds at Project Black.com!","torrent":{"xt":"urn:btih:ab9d35d62d6ac600ae2026e7a2415de567b7b20e","amp;dn":"Bill+and+Teds+Excellent+Adventure+%5BDVD+ISO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab9d35d62d6ac600ae2026e7a2415de567b7b20e","infoHashBuffer":{"type":"Buffer","data":[171,157,53,214,45,106,198,0,174,32,38,231,162,65,93,229,103,183,178,14]},"announce":[],"urlList":[]}}