{"title":"[CiN] Orson Welles - Touch Of Evil","uid":3278385,"size":1494299309,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:abe1be37f59d62b26ac717efc24ef7db1d3e1444&amp;dn=%5BCiN%5D+Orson+Welles+-+Touch+Of+Evil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pippin","files":4,"time":1106058365,"description":"Here's next film in the Orson Welles series: Touch Of Evil (1958).\n\n&lt;p&gt;\n\n&lt;img src=&quot;http://server2.uploadit.org/files/Pippin-6305999872.jpg&quot; /&gt;\n\n&lt;/p&gt;\n\nIt has been restored to Welles' original intentions, for example the opening titles has been removed from the famous opening shot and the original music by Mancini has been, well, inserted where it should be. Ive included the trailer for Citizen Kane which should have been included in that release - worth seeing. English subtitles included.\n\n&lt;p&gt;\n\nWhat Amazon.com says:\n\n\nConsidered by many to be the greatest B movie ever made, the original-release version of Orson Welles's film noir masterpiece Touch of Evil was, ironically, never intended as a B movie at all--it merely suffered that fate after it was taken away from writer-director Welles, then reedited and released in 1958 as the second half of a double feature. Time and critical acclaim would eventually elevate the film to classic status (and Welles's original vision was meticulously followed for the film's 1998 restoration), but for four decades this original version stood as a testament to Welles's directorial genius. From its astonishing, miraculously choreographed opening shot (lasting over three minutes) to Marlene Dietrich's classic final line of dialogue, this sordid tale of murder and police corruption is like a valentine for the cinematic medium, with Welles as its love-struck suitor. As the corpulent cop who may be involved in a border-town murder, Welles faces opposition from a narcotics officer (Charlton Heston) whose wife (Janet Leigh) is abducted and held as the pawn in a struggle between Heston's quest for truth and Welles's control of carefully hidden secrets. The twisting plot is wildly entertaining (even though it's harder to follow in this original version), but even greater pleasure is found in the pulpy dialogue and the sheer exuberance of the dazzling directorial style.\n\n&lt;/p&gt;\n\nCodec: DivX Pro 5.2.1\nResolution: 832X432\nFramerate: 23.976 fps\nAspect Ratio: 16:9\nBitrate: 1681 kbit/s\nAudio: Mp3PRO @ 64 kbit/s (Mono)\n\n&lt;p&gt;\n\nLink to Cineastklubben:\n\n http://www.piratbyran.org/?view=forum&amp;a=thread&amp;id=19235\n\n&lt;/p&gt;","torrent":{"xt":"urn:btih:abe1be37f59d62b26ac717efc24ef7db1d3e1444","amp;dn":"%5BCiN%5D+Orson+Welles+-+Touch+Of+Evil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe1be37f59d62b26ac717efc24ef7db1d3e1444","infoHashBuffer":{"type":"Buffer","data":[171,225,190,55,245,157,98,178,106,199,23,239,194,78,247,219,29,62,20,68]},"announce":[],"urlList":[]}}