{"title":"Dos.Chalados.Y.Muchas.Curvas.Xvid.Screener.","uid":3404704,"size":726269952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad5d85c05a30c76d529b8fed56aed418d55bb16c&amp;dn=Dos.Chalados.Y.Muchas.Curvas.Xvid.Screener.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcctorro","files":1,"time":1131025585,"description":"sipnosis.Los primos Bo y Luke Duke, amantes de la diversi&amp;oacute;n y de la velocidad, est&amp;aacute;n de nuevo en la carretera y no para nada bueno; les acompa&amp;ntilde;a su prima Daisy Duke, la orgullosa propietaria de los shorts m&amp;aacute;s cortos de todo el Sur. El condado de Hazzard cuenta con algunas de las carreteras secundarias que m&amp;aacute;s ejes destrozan, un terror&amp;iacute;fico licor ilegal y las granjeras m&amp;aacute;s atractivas de toda Georgia, y los chicos Duke disfrutan de las tres cosas. Con frecuencia. El negocio de la familia Duke es la destilaci&amp;oacute;n ilegal de licor, y el t&amp;iacute;o Jesse prepara el brebaje m&amp;aacute;s apetitoso de todo el Sur. La mayor&amp;iacute;a de las veces, los chicos se encuentran en el lado equivocado de la ley mientras conducen a toda velocidad para hacer sus entregas, implicando a la oficina del sheriff en desenfrenadas persecuciones, en su famoso Dodge Charger naranja, el General Lee. Despu&amp;eacute;s de un largo d&amp;iacute;a de trabajo, no hay nada como relajarse con una cerveza helada en el mejor bar del condado de Hazzard, el Boar?s Nest, en el que Daisy trabaja como camarera. De vez en cuando, un forastero comete el error de tomarse demasiadas confianzas con la chica m&amp;aacute;s guapa del condado. Pero pronto descubre (por equivocaci&amp;oacute;n) que Daisy no es s&amp;oacute;lo una cara bonita, es dura como una Duke, y con Bo y Luke de por medio, eso normalmente significa una violenta pelea de bar al viejo estilo. Pero &amp;uacute;ltimamente no todo es destilaci&amp;oacute;n ilegal y granjeras, cuando Bo y Luke descubren pruebas de que las propiedades de sus vecinos est&amp;aacute;n siendo ilegalmente confiscadas por el deshonesto comisionado Boss Hogg, su &amp;uacute;nica oportunidad de proteger a su ciudad natal es conducir el coche a toda velocidad en intento desesperado por salvar el condado de Hazzard","torrent":{"xt":"urn:btih:ad5d85c05a30c76d529b8fed56aed418d55bb16c","amp;dn":"Dos.Chalados.Y.Muchas.Curvas.Xvid.Screener.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad5d85c05a30c76d529b8fed56aed418d55bb16c","infoHashBuffer":{"type":"Buffer","data":[173,93,133,192,90,48,199,109,82,155,143,237,86,174,212,24,213,91,177,108]},"announce":[],"urlList":[]}}