{"title":"skiday ohio river newburge beach party","uid":3502841,"size":200318756,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:ae8909a75674bec32aaef403f10d59eec4000b7e&amp;dn=skiday+ohio+river+newburge+beach+party&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drcam","files":1,"time":1152724551,"description":"This is my first upload. I don&amp;#039;t know if I got the codec right. So if not, let me know. \n\nThis is home video from the largest river party in the U.S. It is held on Newburge beach in kentucky below newburge dam. Lots of fun in the sun\n\nTHE EVENT\nOver the past 27 years, SkiDay has evolved into one of the ?largest river beach events in the United States? according to the U.S. Coast Guard. SkiDay is presented as a day of music, contests and prize giveaways. The ?event?, however, is actually the boaters themselves, congregating to celebrate their chosen pastime. Now the icon of the boaters? social calendar, SkiDay is considered by the boaters of the Tri-State as ?our day?.\n\nIn addition to the music, contests and prizes, SkiDay boasts two wildly popular events that have become iconic to the thousands of attendees; ?The King of the Beach Competition? and ?The World Famous SkiDay Bikini Contest?.\n\nJennifer Copeland - Last year, Ski Day 2005 was proud to announce that rising starlet and spokesmodel for &quot;Ski&quot; Citrus Beverage, Jennifer Copeland, would grace the beaches of SkiDay 2005. Her playfull and provocative full page ads for &quot;Ski&quot; have been famously seen throughout the U.S. Well, SkiDay loved her and now Jennifer will be here again in person at SkiDay 2006 to autograph your very own &quot;Ski-Jennifer Copeland&quot; Poster.\n\nThink about it...SkiDay on the Ohio, Ski Citrus Beverage and the Official Spokesmodel for Ski, Jennifer Copeland. It was meant to be, party people!\n\nÂ· Teresa Noreen ? Exciting new national personality and model, Teresa Noreen has become familiar to fans of 103GBF as the new Miss GBF. She can currently be seen gracing the awesome 103GBF billboards that proclaim ?You Rock!? And now, get ready to meet this amazing woman in person at SKIDay 2006!","torrent":{"xt":"urn:btih:ae8909a75674bec32aaef403f10d59eec4000b7e","amp;dn":"skiday+ohio+river+newburge+beach+party","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae8909a75674bec32aaef403f10d59eec4000b7e","infoHashBuffer":{"type":"Buffer","data":[174,137,9,167,86,116,190,195,42,174,244,3,241,13,89,238,196,0,11,126]},"announce":[],"urlList":[]}}