{"title":"Candy Barr - Vintage Stripper - Tribute","uid":3429587,"size":140248037,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:aed6615302c51bb6d52af088aed2e1dcf52c3677&amp;dn=Candy+Barr+-+Vintage+Stripper+-+Tribute&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"antijocko12","files":124,"time":1136767532,"description":"A collection of movies and images in tribute to Candy Barr. \n\nCandy Barr, a well-known exotic dancer from the 1950s who settled into a quiet small-town life in Texas, has died of pneumonia. She was 70. Barr, who was born Juanita Dale Slusher on July 6, 1935, in Edna, Texas, died Friday at a Victoria hospital, the Abilene Reporter-News reported in Sunday editions.\n\nSlavik Funeral Home in Edna confirmed the death of Juanita Phillips and verified that she was also known as Candy Barr. Barr rose to prominence as an exotic dancer in Dallas in the late 1950s. She performed in Los Angeles and Las Vegas and at one point earned $2,000 per week.\n\nShe was associated with Dallas nightclub owner Jack Ruby, who was accused of gunning down Lee Harvey Oswald, the man suspected of assassinating President Kennedy.\n\nAt 16, Barr starred in one of the most famous stag movies, &quot;Smart Alec,&quot; in 1951. She was known for her choreography and trained actress Joan Collins for the 1960 movie &quot;Seven Thieves.&quot; Her career was derailed in 1959 when she was sentenced to 15 years in prison by a Dallas judge for possessing less than an ounce of marijuana. She served about three years and later moved to Brownwood.\n\nBarr was indicted for marijuana possession in Brownwood in 1970, but the charges were dismissed. She later disappeared from public view, eventually moving from Brownwood to Edna in 1992. Barr was married four times and had at least one child, a daughter, the newspaper reported. No funeral service is planned.\n\n","torrent":{"xt":"urn:btih:aed6615302c51bb6d52af088aed2e1dcf52c3677","amp;dn":"Candy+Barr+-+Vintage+Stripper+-+Tribute","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aed6615302c51bb6d52af088aed2e1dcf52c3677","infoHashBuffer":{"type":"Buffer","data":[174,214,97,83,2,197,27,182,213,42,240,136,174,210,225,220,245,44,54,119]},"announce":[],"urlList":[]}}