{"title":"Blitz3D","uid":3506522,"size":44750739,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aee4880a561885bd02af5f7731a2e1a20c93e5a9&amp;dn=Blitz3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Blubbler","files":1,"time":1153700248,"description":"Overview\nIf you&amp;#039;ve been yearning to create games but have been frustrated by the complexity of programming languages such as C++ or Java, you&amp;#039;ve come to the right place!\n\nBlitz3D provides a simple yet powerful environment for game creation - simple, because its based around the popular and easy to use BASIC programming language; and powerful, thanks to a highly optimized underlying 2D/3D engine.\n\nBlitz3D includes many commands to help you out with game creation - but not too many! Rather than confuse you with tons of commands, Blitz3D&amp;#039;s command set has been carefully designed to provide maximum flexibility for minimum effort.\n\nAnd if you get stuck, there is always the huge Blitz3D user community to call upon for help. Buying Blitz3D provides you with access to the official Blitz Research forums, home to thousands of dedicated and talented Blitz3D enthusiasts.\n\nCan you write commercial quality games in Blitz3D? Why not - others are! Great titles such as Best Friends, Wonderland and Juno Nemesis were written in Blitz. In fact, many shareware authors are moving to Blitz from languages such as C++ due to the faster development time.\n\nCurious? Why not check out the demo! Read on for a brief description of just some of Blitz3D&amp;#039;s features...\n\nSuper flexible entity system\nBlitz3D is designed around the idea of entities. Typically, a 3D game will consist of many types of 3D elements such as cameras, lights, meshes and so on. In Blitz3D, these are all considered to be entities. This means that the same commands can be used to manipulate and deal with a wide range of 3D objects - for example, the TurnEntity command can be used to turn a camera, a light, a mesh, or even a massive terrain!\n\nMeshes\nMeshes are the workhorse of any 3D engine. Blitz allows you to either create your own meshes from scratch, or load existing meshes in either X, 3DS or B3D format. The B3D format is unique to Blitz3D, and has been designed to provide for all the features of the Blitz3D engine. B3D exporters are available for a wide range of modelling software including 3D Studio, Lightwave and Truespace. Blitz3D meshes provide features such as vertex colors and multiple texture coordinate sets.\n\nTerrains\nBlitz3D terrains can be used to generate apparently HUGE scenes! This is achieved through a trick known as LOD (level-of-detail) reduction. This completely automatic process works by picking a set of polygons which approximates the shape of a very high resolution heightmap. Blitz3D terrains can also be modified in realtime - great for blowing holes in things!\n\nSprites\nSprites are simply textured 2D rectangles - easy to setup and great for things like particle effects, heads-up-displays and so on. Sprites can be setup to automatically orient themselves to face the camera, giving the illusion of a spherical object, but without the overhead of drawing a ton of polygons.\n\nCameras\nBlitz3D cameras offer the programmer direct control over viewport, zoom, clipping range, fog effects and even offer an isometric mode. Multiple cameras are also no problem - simply use CreateCamera as many times as you want!\n\nLights\nBlitz3D offers directional lights, point lights and spot lights. You can control the color, range and &amp;#039;cone&amp;#039; of lights with ease.\n\nSuper flexible brush system\nBlitz3D makes extensive use of the idea of brushes to color, texture and otherwise manipulate the appearance of entities. Brushes offer a wide range of effects such as tinting, multitexturing and specular highlights.\n\nMultitexturing\nMultitexturing allows you to apply up to 8 layers of texture to an entity. This can be used to achieve such effects as lightmapping, detail texturing, specular highlights and a host more. The multitexturing system in Blitz3D also allows you to precisely control how textures are combined together.\n\nEnvironment mapping\nEnvironment mapping creates the illusion of reflections with in a scene. Blitz3D provides 2 forms of environment mapping - spherical or cubic. Cubic environment maps can even be updated in realtime, providing for awesome, dynamic reflection effects.\n\nAnd a whole lot more...","torrent":{"xt":"urn:btih:aee4880a561885bd02af5f7731a2e1a20c93e5a9","amp;dn":"Blitz3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee4880a561885bd02af5f7731a2e1a20c93e5a9","infoHashBuffer":{"type":"Buffer","data":[174,228,136,10,86,24,133,189,2,175,95,119,49,162,225,162,12,147,229,169]},"announce":[],"urlList":[]}}