{"title":"Double.Agent.2003.DVDRip.DivX-CiMG [Koreanmovies]","uid":3459916,"size":1466643029,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aee84ee56058769fc9c268cfbe722ace1d1982fe&amp;dn=Double.Agent.2003.DVDRip.DivX-CiMG+%5BKoreanmovies%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"koreanmovies","files":7,"time":1142838137,"description":"These days, spy movies suck big and loud, the flag-bearer for suckiness being the ailing James Bond franchise. Whatever happened to movies like THE SPY WHO CAME IN FROM THE COLD or THE THIRD MAN?\nSimple: they moved to Korea.\n\nMarking the return of acting icon, Han Suk-Kyu (SHIRI, CHRISTMAS IN AUGUST), after a three year retirement, DOUBLE AGENT is a tamped-down, winter&amp;#039;s chill of a film. Bringing to life the bad old days of the Cold War it gives us the calculating human chess games of John LeCarre at his best. A stomach-churning look at the 1980&amp;#039;s anti-communist madness that turned patriots into torturers, its plot hinges on the minutiae of a spy&amp;#039;s life: the accidental photograph, a name dropped during a confession, a car sitting at the end of a darkened street.\n\nHan Suk-Kyu plays a North Korean defector who comes over Checkpoint Charlie. After a brutal trip to Namsan Mountain (the South Korean CIA&amp;#039;s head office; &quot;going to Namsan&quot; used to be a euphemism for being tortured) his motives for defecting are deemed pure and he starts working for the South Korean Central Intelligence Agency. But is he a South Korean spy? A North Korean spy pretending to be a South Korean spy? Or a North Korean spy pretending to be a South Korean spy pretending to be...\n\nDOUBLE AGENT replicates the 80&amp;#039;s in perfect detail, from the clothes, to the politics, to the retro soundtrack. But ultimately it&amp;#039;s a character-driven movie where the question isn&amp;#039;t what happens, but how. Han Suk-Kyu&amp;#039;s performance as a patriot who will twist himself into whatever shape his masters desire is hypnotically intense. There&amp;#039;s repressed violence in everything he does and the screen vibrates with bad voodoo even when he&amp;#039;s just sitting there, listening. Running on a treadmill that&amp;#039;s going too fast, he has to keep running or he&amp;#039;ll fall into the machinery and be ground to a pulp. From the minute we first see him we can see his expiration date - it&amp;#039;s stamped on his forehead. A man this twisted up, under this much pressure, is going to go to pieces sooner or later. In this case, it&amp;#039;s sooner. Producing, as well as starring, the Korean press jokingly referred to this as Han Suk-Kyu&amp;#039;s directorial debut based on reports from the set that he was telling first-time director, Kim Hyung-Jeong, where to put the camera in every shot. Well, he was right. This is probably the only adult film to hit the screens between now and September and it&amp;#039;s so razor sharp and precise that it hums like a high voltage line.\n\nDOUBLE AGENT is for everyone who loves spy movies but hates one-liners. Here, espionage isn&amp;#039;t a rah-rah thrill ride, but a carnivorous hall of mirrors where people walk in, and husks walk out.\n\n\n\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.\t","torrent":{"xt":"urn:btih:aee84ee56058769fc9c268cfbe722ace1d1982fe","amp;dn":"Double.Agent.2003.DVDRip.DivX-CiMG+%5BKoreanmovies%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee84ee56058769fc9c268cfbe722ace1d1982fe","infoHashBuffer":{"type":"Buffer","data":[174,232,78,229,96,88,118,159,201,194,104,207,190,114,42,206,29,25,130,254]},"announce":[],"urlList":[]}}