{"title":"Rainbow Difficult To Cure 1981 (EAC-APE-covers)","uid":3276328,"size":260493613,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b026d14a827652900ab90cd57c6de3c11936c681&amp;dn=Rainbow+Difficult+To+Cure+1981+%28EAC-APE-covers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ritchie","files":1,"time":1105662633,"description":"Rainbow ditched vocalist Graham Bonnet after Down to Earth, hiring former Fandango singer Joe Lynn Turner as their frontman. As it turns out, Turner is less hyperbolic than his predecessor, which fits the focused polish of Difficult to Cure. Where Down to Earth was a streamlined version of early Rainbow, Difficult to Cure is a shot at crossover. Problem is, the band never comes up with the right crossover songs. Russ Ballard's &amp;quot;I Surrender&amp;quot; comes close, but much of the record is fairly undistinguished, riding on strident melodies and big riffs that are never quite memorable. It's all given a contemporary sheen, with plenty of studio gloss that now instantly evokes the early '80s. On that level, it's somewhat of an entertaining artifact -- anyone pining for an example of what album-oriented radio sounded like in the pre-MTV years should check this out -- but it's never more than that, since the bids at chart success are only occasionally memorable (&amp;quot;I Surrender,&amp;quot; &amp;quot;Magic&amp;quot;). Perhaps Blackmore felt stifled by the exacting nature of Difficult to Cure's attempt at crossover -- witness how &amp;quot;Spotlight Kid&amp;quot; veers from a dexterous Blackmore solo to a ridiculous keyboard run, then just verges on collapse -- and that's the reason why each side ends with a pretentious pseudo-classical instrumental that functions as nothing more than a guitar showcase. Certainly, his playing is impeccable, but both numbers are really awkward (particularly the title track, based on Beethoven's Ninth Symphony and with a weirdly synthesized pulse as a rhythmic underpinning) and just highlight the fact that the record would have been better if Blackmore had channeled that energy into the rest of the album.","torrent":{"xt":"urn:btih:b026d14a827652900ab90cd57c6de3c11936c681","amp;dn":"Rainbow+Difficult+To+Cure+1981+%28EAC-APE-covers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b026d14a827652900ab90cd57c6de3c11936c681","infoHashBuffer":{"type":"Buffer","data":[176,38,209,74,130,118,82,144,10,185,12,213,124,109,227,193,25,54,198,129]},"announce":[],"urlList":[]}}