{"title":"WROX - ISBN 0764579169 - Beginning RSS and Atom Programming-2005","uid":3438175,"size":7923770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b068c6b4312aca08e8c5ad7ab34f6c64f42efd0f&amp;dn=WROX+-+ISBN+0764579169+-+Beginning+RSS+and+Atom+Programming-2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"macbabe","files":1,"time":1138705590,"description":"Beginning RSS and Atom Programming\nby Danny Ayers, Andrew Watt\nISBN: 0-7645-7916-9\nMay 2005\n775 pages \n\n\nRSS and Atom are specifications that give users the power to subscribe to information they want to receive and give content developers tools to provide continuous subscriptions to willing recipients in a spam-free setting. RSS and Atom are the technical power behind the growing millions of blogs on the Web. Blogs change the Web from a set of static pages or sites requiring programming expertise to update to an ever changing, constantly updated landscape that anyone can contribute to. RSS and Atom syndication provides users an easy way to track new information on as many Web sites as they want. This book offers you insight to understanding the issues facing the user community so you can meet users&amp;#039; needs by writing software and Web sites using RSS and Atom feeds.\nBeginning with an introduction to all the current and coming versions of RSS and Atom, you&amp;#039;ll go step by step through the process of producing, aggregating, and storing information feeds. When you&amp;#039;re finished, you&amp;#039;ll be able to produce client software and Web sites that create, manipulate, aggregate, and display information feeds effectively.\n\n&quot;This book is full of practical advice and tips for consuming, producing, and manipulating information feeds. I only wish I had a book like this when I started writing RSS Bandit.&quot; - Dare Obasanjo, RSS Bandit creator: http://www.rssbandit.org/","torrent":{"xt":"urn:btih:b068c6b4312aca08e8c5ad7ab34f6c64f42efd0f","amp;dn":"WROX+-+ISBN+0764579169+-+Beginning+RSS+and+Atom+Programming-2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b068c6b4312aca08e8c5ad7ab34f6c64f42efd0f","infoHashBuffer":{"type":"Buffer","data":[176,104,198,180,49,42,202,8,232,197,173,122,179,79,108,100,244,46,253,15]},"announce":[],"urlList":[]}}