{"title":"Opera 9.0 Technical Preview 2 Build 8326 (29. March)","uid":3464246,"size":3886592,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b11f6d7febce73b0cc9cd780f917a372f4771fe2&amp;dn=Opera+9.0+Technical+Preview+2+Build+8326+%2829.+March%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blackrave123","files":1,"time":1143754170,"description":"This is the world&amp;#039;s best Internet browser. Surf fast, secure and spyware-clean with Opera.\n\nFeatures:\n\nWe&amp;#039;ve cleaned up our front yard. The Opera 8 interface is designed to make the advanced functions easy and effective to use. Menus, toolbars and other elements have undergone our &quot;slim and clean&quot;-routine. Opera offers the largest browsing area in the industry. \nTabbed browsing and pop-up blocking\n\nOpera pioneered tabs and pop-up blocking ages ago. But they&amp;#039;re still key features that more and more people start enjoying. With tabs you can open multiple pages within the same application window. Opera lets you control whether to block all pop-ups, or open only the ones that you have requested.  \nIntegrated search\n\nSearch your favorite sites, for example Google, eBay, or Amazon without having to go to their Web pages. Use the integrated search window or search directly in the address field using shortcuts (e.g. writing &quot;g Opera&quot; in the address field will search for &quot;Opera&quot; using Google).  \nSecurity\n\nStay away from spy-ware, viruses, and other malicious applications that silently attack your computer while you are surfing the Web. For example, Opera displays security information inside the address bar, located next to the padlock icon that indicates the level of security present on a site. Opera 8 also provides protection against phishing attacks and automatically checks for security updates. More about security \nSpeed\n\nWe&amp;#039;re holding on to our claim: &quot;The Fastest Browser on Earth&quot;. In Opera 8, further improvements have been made in the way the browser reads pages to allow you to fly the Web. \n\nFor further information on just how good our rewritten scripting engine is, go to: (Browser speed comparison) \nPassword manager\n\nOpera&amp;#039;s password manager, the Wand, remembers your usernames and passwords so you will not have to. The password manager can store more than one username and password combination for each page, and will let you choose which one to use if multiple combinations are stored.  \nCustomization\n\nUsing the &amp;#039;appearance&amp;#039; dialog you can make Opera look almost any way you want. Move buttons and search fields, add and remove toolbars, and so forth. Opera skins can change the look of your browser by giving it the icons and buttons of your choice.  \nFit to window width\n\nOpera&amp;#039;s &quot;fit to window width&quot;-feature means no more horizontal scrolling and improved ability to print entire Web pages. In combination with Opera&amp;#039;s Zoom function, you can magnify Web pages dramatically and still view them without having to scroll sideways.  \nVoice\n\nOpera is the first browser to prepare for a future of Web sites offering interactive, voice-enabled shopping and booking systems. You can browse the Web using spoken commands, such as &quot;Opera next link&quot;, &quot;Opera back&quot;, or &quot;Opera speak&quot;. The latter command will make Opera read Web page content and e-mail messages to you aloud ,adding usability as either a screen reader or advanced dictionary. Voice is currently offered in English and works on Windows 2000 and XP. A headset with a microphone is required to use Voice. \nAdditional features\nFull support for Gmail\nSupport for Atom newsfeeds\nFirst Web browser to natively support Scalable Vector Graphics (SVG)\n\n\nChangelog For The New Build\n\n-Fixed timestamp bug in Mail.\n-Fixed copy bug where space was inserted before special characters.\n-Fixed bug where links from widgets opened in new window not tab.\n-Remember widgets independent of startup option.\n-Reloading open message when IMAP is checking.\n-Fixed bug where widget handler stole focus from opera when starting.\n-Script dialogs now have the option to stop scripts running on the current page, in order to prevent further dialogs from appearing.\n\nDownloaded from http://my.opera.com/desktopteam","torrent":{"xt":"urn:btih:b11f6d7febce73b0cc9cd780f917a372f4771fe2","amp;dn":"Opera+9.0+Technical+Preview+2+Build+8326+%2829.+March%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11f6d7febce73b0cc9cd780f917a372f4771fe2","infoHashBuffer":{"type":"Buffer","data":[177,31,109,127,235,206,115,176,204,156,215,128,249,23,163,114,244,119,31,226]},"announce":[],"urlList":[]}}