{"title":"Cool Edit 2000","uid":3294530,"size":8627160,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b26e9289d6833719ada873275f22942d4b2273af&amp;dn=Cool+Edit+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorrentAppz","files":6,"time":1109256848,"description":"Did you know that you have a recording studio in your computer? \n\nYou really do! If your Windows computer has a sound card or sound module \n(as almost all do), Cool Edit 2000 can turn it into a recording studio with \nall of the features used by professional audio engineers. You can use it to \nrecord your own music, voice or other audio, edit it, mix it with other audio \n  or musical parts, add effects like Reverb, Chorus, and Echo to it, equalize \n  it, and master it so that you can burn it to a CD, post it on the \n  World Wide Web, or email it. Once you get started, you'll be amazed at what \n  you can achieve! \n\n  So what can you do with Cool Edit 2000? Once you've got something recorded or \n  loaded into it, you can cut, paste, and move audio around just as you do text \n  in a word processor. It slices! It dices! And if you make a mistake, the undo \n  feature will let you back up and try it again.\n\n  Want to put your voice in Carnegie Hall? Give it that 60's flange? Boost \n  the bass? Cool Edit 2000 has more than twenty fantastic audio effects and \n  tools like Echo, Flange, Compression, Amplify, Noise Reduction, Reverb, \n  Time/Pitch stretch, and much more.\n\n  Cool Edit 2000 also has powerful analysis tools. You can examine the frequency\n  components and other details about your audio with the Frequency Analysis, \n  Statistics, and Spectral View features. \n\n  When you're all done, you can compress your audio MP3 or Real Media G2 to \n  post on the web or email it to your friends. If you'd rather burn it to CD, \n  Cool Edit 2000 can prepare the audio for that. If you've found yourself on \n  the leading edge, and need audio for DVD, you'll appreciate Cool Edit 2000's \n  support for 24-bit/96kHz files.","torrent":{"xt":"urn:btih:b26e9289d6833719ada873275f22942d4b2273af","amp;dn":"Cool+Edit+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26e9289d6833719ada873275f22942d4b2273af","infoHashBuffer":{"type":"Buffer","data":[178,110,146,137,214,131,55,25,173,168,115,39,95,34,148,45,75,34,115,175]},"announce":[],"urlList":[]}}