{"title":"Xbox - RLT -  Prisoner Of War","uid":3389146,"size":651407363,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:b492916163f63f77d738331022639ecb47cd4b36&amp;dn=Xbox+-+RLT+-++Prisoner+Of+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shady78","files":1,"time":1127882297,"description":"Ntsc\nEnglish\n100 percent retail\n\n\n\n\n\nlink\nhttp://www.xbox.com/en-us/prisonerofwar/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=prisonerofwar\n\n\nPrisoner of War is a new kind of escape adventure game that captures the intrigue, danger and heroism of Allied escape attempts from POW camps during World War II. Only the player's bravery, stealth and cunning will win the day! \n \nThe routine of an Allied Prisoner of War in a 1941 POW camp is ruled by the daily cycles of regimented routine ? roll calls, mealtimes, exercise and the ever-present guard patrols. However, for the more determined prisoner, identifying and exploiting the loopholes in such a routine opens all kinds of possibilities...\n \nFor Captain Lewis Stone, American airman and POW in Stalag Luft, it's those loopholes that could provide the key to uncovering German military secrets and mounting a daring escape plan.\n \nHeld a POW, Stone makes contact with a cadre of long-term prisoners and he discovers a new weapon is indeed being developed in the camp by German scientists. Using quick wits, information and stealth, Stone has to work around the guards to report his findings to Churchill's Special Operations Executive in London. Fearing that the weapon development may give Hitler an unbeatable edge in World War II, London charges Stone with uncovering the Nazi's plans.\n\n\n\nFeatures  \n \n \n\nTravel between very different and realistically modelled Prisoner of War camps including Stalag Luft and Colditz Castle \nMany different missions and goals insure a variety of gameplay; making use of disguises, posing as a German guard, stealing cars and even sabotaging equipment \nGame environment changes through revisiting locations in different seasons \nFellow prisoners can assist Stone in different ways ? possibly for a price \nEngineer escapes and call in Allied air strikes for support \nTone, timing and style of the dynamic score changes and develops at the player's pace depending on how the game is played\n \n \n \nGame Information  \n \n \nPublisher\nCodemasters \n\nDeveloper\nWide Games Limited \n\nStreet Date\nJuly 2002 \n\nPrice\n$49.99 \n\n \nRating\nTeen\n\n \n\n \n \n \n \n  \n \n\n\n\n","torrent":{"xt":"urn:btih:b492916163f63f77d738331022639ecb47cd4b36","amp;dn":"Xbox+-+RLT+-++Prisoner+Of+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b492916163f63f77d738331022639ecb47cd4b36","infoHashBuffer":{"type":"Buffer","data":[180,146,145,97,99,246,63,119,215,56,51,16,34,99,158,203,71,205,75,54]},"announce":[],"urlList":[]}}