{"title":"The Prophecy Code","uid":3396652,"size":6131048399,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4ee71525e7c4af0f957d1cc0808265bfcde9fe4&amp;dn=The+Prophecy+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MrCheez","files":21,"time":1129350907,"description":"The Prophecy Code\n\n\nThe present is a time of overwhelming interest to all living. Rulers and statesmen, men who occupy positions of trust and authority, thinking men and women of all classes, have their attention fixed upon the events taking place about us. They are watching the strained, restless relations that exist among the nations. They observe the intensity that is taking possession of every earthly element, and they recognize that something great and decisive is about to take place--that the world is on the verge of a stupendous crisis.\n\nAngels are now restraining the winds of strife, that they may not blow until the world shall be warned of its coming doom; but a storm is gathering, ready to burst upon the earth; and when God shall bid His angels loose the winds, there will be such a scene of strife as no pen can picture.\n\nThe Bible, and the Bible only, gives a correct view of these things. Here are revealed the great final scenes in the history of our world, events that already are casting their shadows before, the sound of their approach causing the earth to tremble and men's hearts to fail them for fear.","torrent":{"xt":"urn:btih:b4ee71525e7c4af0f957d1cc0808265bfcde9fe4","amp;dn":"The+Prophecy+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4ee71525e7c4af0f957d1cc0808265bfcde9fe4","infoHashBuffer":{"type":"Buffer","data":[180,238,113,82,94,124,74,240,249,87,209,204,8,8,38,91,252,222,159,228]},"announce":[],"urlList":[]}}