{"title":"Michael Murphey - Swans Against The Sun (1975/VBR) vinyl-rip","uid":3408191,"size":68051047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b4f61bb4332f08b486ef202fa106263459a2aa68&amp;dn=Michael+Murphey+-+Swans+Against+The+Sun+%281975%2FVBR%29+vinyl-rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reride","files":13,"time":1131750157,"description":"With guests that include Willie Nelson, John Denver, and Charlie Daniels, 1976's Swans Against the Sun is a little different in some respects when compared to rest of Michael Martin Murphey's material. It's not that the music is contrary or eccentric itself, it's the fact that there's a little more juice and fire added to the tracks than usual when compared to the rest of Murphey's albums. But this slight change of pace is definitely for the better, and many of the tracks sound refreshing and novel. Murphey travels in and out of the country music norm, and he even lets John Denver sing a version of Hank Williams' &quot;Mansion on the Hill,&quot; which is truly one of the album's highlights. Easily the best cut on Swans, &quot;Renegade&quot; broke into the Top 40 on the pop side, reaching number 39 and netting Murphey his fourth Top 40 pop hit. As far as the rest of the tracks, most of them hold up as catchy hybrids of country and country-rock, like &quot;Seasons Change,&quot; &quot;Wild West Show,&quot; and the affecting &quot;Dancing in the Meadow.&quot; Swans Against the Sun was a brave release for Murphey in a sense, since many figured it would have to live up to 1975's Blue Sky - Night Thunder, which yielded hits in both &quot;Wildfire&quot; and &quot;Carolina in the Pines,&quot; yet aside from the &quot;Renegade&quot; single, its makeup, character, and overall presence sound substantially less commercial. ~ Mike DeGagne, All Music Guide","torrent":{"xt":"urn:btih:b4f61bb4332f08b486ef202fa106263459a2aa68","amp;dn":"Michael+Murphey+-+Swans+Against+The+Sun+%281975%2FVBR%29+vinyl-rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f61bb4332f08b486ef202fa106263459a2aa68","infoHashBuffer":{"type":"Buffer","data":[180,246,27,180,51,47,8,180,134,239,32,47,161,6,38,52,89,162,170,104]},"announce":[],"urlList":[]}}