{"title":"Zionist War Crimes - The Case For The Prosecution","uid":3422373,"size":111441344,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b53e9a8f6681de6341e69b8a8194e0f29836f083&amp;dn=Zionist+War+Crimes+-+The+Case+For+The+Prosecution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1134988672,"description":"Several decades ago, people lived peacefully among one another in the Mid-East. Today, however, things have changed considerably. And the violence has spread considerably--far outside of the realm of the Palestinian-Israeli dispute.\n\nThis video takes you back in time. It shows actual footage of Israelis and Arabs dancing together in the streets, when violence was uncommon. Traversing the time lines, this video then takes you on a journey from the days of Herzl to today, showing numerous scenes that many of us in the West are completely ignorant--such as what occurred in Deir Yassin, Jenin, Lebanon, and many other cities that raised the Arabs' ire. \n\nIt also describes the Israelis' attack on the USS Liberty, which caused many innocent U.S. Navy crewmembers to die. The attack on the U.S. Library of Information in Egypt by the Israelis is also shown. \n\nYou will see much rare footage, which has been previously unknown to most of us in the West. Most of this footage was taken by individuals with video cameras, since camera crews are often forbidden in the midst of these ongoing battles. This video is not for the timid, and condemns all acts of violence, whether these acts are from Israelis or Arabs. However, &quot;Zionist War Crimes&quot; is unique in that it offers an objective view of what has occurred in the Mid-East, and recognizes that violence begets violence--something which all people should avoid.\n\nRuntime......: 01:05:50\nVideo Codec..: Windows Media Video 9\nVideo Bitrate: 200 Kbps.\nAudio Codec..: Windows Media Audio 8\nAudio Bitrate: 32 kbps, 32 kHz, stereo\nFrame Size...: 320 x 240","torrent":{"xt":"urn:btih:b53e9a8f6681de6341e69b8a8194e0f29836f083","amp;dn":"Zionist+War+Crimes+-+The+Case+For+The+Prosecution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53e9a8f6681de6341e69b8a8194e0f29836f083","infoHashBuffer":{"type":"Buffer","data":[181,62,154,143,102,129,222,99,65,230,155,138,129,148,224,242,152,54,240,131]},"announce":[],"urlList":[]}}