{"title":"Test Dept - Pax Britannica (VBR)","uid":3379327,"size":54996602,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b57be233ff1a5017b8eed477c1ac21f0a79316fd&amp;dn=Test+Dept+-+Pax+Britannica+%28VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MALAI","files":13,"time":1125917157,"description":"Pax Britannica: An Oratorio In Five Movements by Test Department\n\nReleased:\t09/10/1996\nLabel Name:\tInvisible Records\nProducer:\tKen Thomas; Test Department\n\nPersonnel includes: Test Department; The Scottish Chamber Orchestra; The Edinburgh Schola Cantorum.Recorded at Cava Sound Workshops, Glasgow, Scotland.\n\n\nTest Dept emerged in the early '80s as an ensemble of British men with short-cropped hair banging on large metal things in disused factory spaces, monasteries and the like. They seemed the slightest bit silly, but think of how they must feel - how could they have predicted that the sort of impossibly muscular music they were making on 1984's Beating The Retreat  and their post-industrial visual aesthetic could lead to Marilyn Manson on one hand- and the cheerful trashcan-bashing Stomp! on the other.\n\nWhile they're most revered by industrial music fans - especially those who regard the first years of Einst&amp;uuml;rzende Neubauten and other Europeans keen on smashing bricks together as the halcyon days - Test Dept have undergone two distinct states of evolution since their first bout of notoriety, as heard on two recent discs (released by Invisible in the U.S. and K.K. here). Pax Brittanica from 1991 is an anti-imperialist, anti Thatcher oratorio performed with the Scottish Chamber Orchestra and the Schola Cantorum. The show was a perfect example of Test Dept's tradition of putting on massive agit-prop spectacles, proving their devotion to finding a common (and often polemical) language amongst the disciplines of visual art, theatre and new music.\n\n\n\n\n","torrent":{"xt":"urn:btih:b57be233ff1a5017b8eed477c1ac21f0a79316fd","amp;dn":"Test+Dept+-+Pax+Britannica+%28VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b57be233ff1a5017b8eed477c1ac21f0a79316fd","infoHashBuffer":{"type":"Buffer","data":[181,123,226,51,255,26,80,23,184,238,212,119,193,172,33,240,167,147,22,253]},"announce":[],"urlList":[]}}