{"title":"OSx86 10.4.3 Build 8F1111","uid":3412703,"size":3012765286,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b58337d197aa09d380eb48d8bce539e021a739db&amp;dn=OSx86+10.4.3+Build+8F1111&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigarlo609","files":1,"time":1132708539,"description":"Hot off the presses.  This one has the universal binary of iTunes 6.\n\ntaken from osx86project.org:\n\nWe've received unconfirmed reports concerning a few interesting new toys under the hood of OSx86 10.4.3, including a vastly improved Rosetta and brand new ATI drivers - each far more complete than in previous builds.\n\nFirst, the Rosetta emulation platform in 10.4.3 build 8F1111A has been upgraded to feature full G4 support, including Altivec. This not only adds a new layer of compatibility to Rosetta, but also improved speed for Altivec-equipped applications. This upgrade is reportedly available as a small downloadable update to build 8F1111. \n\nAlso, new ATI drivers available in 10.4.3 seem to offer much greater support for PC ATI graphics chipsets. Preliminary reports indicate that they may support most of the 9000 line, and parts of the X series, including mobile chipsets. Apparently NVIDIA systems have not been given this treatment. Is this discrepancy simply due to the pace of driver porting at Apple, or will ATI graphics hold a special place in the Mactel world?\n\nOn a side note, the weekend brought a newly leaked copy of OSx86 10.4.3 build 8F1111, the most recent seed from Apple. This seed, with its universal binary of iTunes, is a newer version than the build which was recently cracked.","torrent":{"xt":"urn:btih:b58337d197aa09d380eb48d8bce539e021a739db","amp;dn":"OSx86+10.4.3+Build+8F1111","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58337d197aa09d380eb48d8bce539e021a739db","infoHashBuffer":{"type":"Buffer","data":[181,131,55,209,151,170,9,211,128,235,72,216,188,229,57,224,33,167,57,219]},"announce":[],"urlList":[]}}