{"title":"Lee Clayton - Lee Clayton (1973/VBR)vinyl-rip","uid":3392683,"size":56967683,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b619ec9397f6e25a1be2bffe6204d478f1fa7ba2&amp;dn=Lee+Clayton+-+Lee+Clayton+%281973%2FVBR%29vinyl-rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Reride","files":11,"time":1128549523,"description":"Best-known for penning the outlaw country anthem &quot;Ladies Love Outlaws,&quot; singer/songwriter Lee Clayton never achieved the same level of notoriety as some of the artists who recorded his songs. Yet in spite of a limited singing voice, he crafted some expressive, highly personal music in his own right. Clayton grew up in Oak Ridge, TN, and took up the steel guitar at age nine; after just a year and a half, he was good enough to perform on local radio. After a stint in the Air Force, Clayton moved to Nashville in 1969 to make it in the music business, and scored his first big success when Waylon Jennings turned &quot;Ladies Love Outlaws&quot; into a hit anthem in 1972. Clayton recorded his own self-titled debut album for MCA the following year, but despite critical praise, it wasn't commercially successful. Clayton left Nashville for Joshua Springs, CA, but continued to pen songs for other artists; among his most notable contributions were Jerry Jeff Walker's &quot;Lone Wolf&quot; and Willie Nelson's &quot;If You Could Touch Her at All.&quot; His success as a songwriter encouraged him to return to Nashville, and he signed a solo deal with Capitol in 1977. Two acclaimed albums -- 1978's Border Affair and 1979's Naked Child -- followed, and Clayton embarked on his first world tour. However, immediately following the release of 1981's The Dream Goes On, he abruptly quit the music business, instead devoting his energies to writing; the '80s produced two autobiographical books and a play, +Little Boy Blue. Clayton did eventually return to recording with 1990's Another Night, a live album recorded in Oslo, Norway; the same year, the Highwaymen recorded his &quot;Silver Stallion.&quot; However, little has been heard from him since. ~ Steve Huey, All Music Guide","torrent":{"xt":"urn:btih:b619ec9397f6e25a1be2bffe6204d478f1fa7ba2","amp;dn":"Lee+Clayton+-+Lee+Clayton+%281973%2FVBR%29vinyl-rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b619ec9397f6e25a1be2bffe6204d478f1fa7ba2","infoHashBuffer":{"type":"Buffer","data":[182,25,236,147,151,246,226,90,27,226,191,254,98,4,212,120,241,250,123,162]},"announce":[],"urlList":[]}}