{"title":"Alfred Hitchcock - 1959 - North by Northwest [DUAL Span-Eng]","uid":3296981,"size":831907417,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b67810a2a915ec795a1069b44d888cfde20f23c9&amp;dn=Alfred+Hitchcock+-+1959+-+North+by+Northwest+%5BDUAL+Span-Eng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":7,"time":1109753958,"description":"Title: North by Northwest\n\nYear: 1959\n\nDirector: Alfred Hitchcock\n\nCharacters: Cary Grant (Roger Thornhill), Eva Marie Saint (Eve Kendall), James Mason (Phillip Vandamm), Martin Landau (Leonard Jessie), Philip Coolidge (Dr. Cross), Leo G. Carroll (The Professor), Robert Ellenstein (Ned Glass)\n\nReview: The quick-paced, glamorous espionage thriller includes a tongue-in-cheek odyssey away from the city - a perilous adventure for a man who is normally sheltered by his wealth and prestige. A light-hearted and complacent hero/bystander (a successful Manhattan advertising executive in a corporate Brooks Brothers suit) is suddenly totally vulnerable, isolated, and caught up in an unexplainable series of events - after being accustomed to making up 'the truth' with slick ad copy for marketing purposes. After an abduction, he is victimized (mistaken for a government undercover Federal agent by a group of foreign spies), and then on-the-run as an implicated murder suspect (after being framed for a UN official's murder). He is pursued (cross-country across part of the US) by a seeming conspiratorial group of spies, the police, and the FBI. The American is eventually forced to assume another man's identity (George Kaplan, a non-existent US agent), while confronted with murder, mayhem, a world of spies and counterspies, a domineering and unbelieving mother, and an untrustworthy, mysterious blonde, femme fatale lover. His final salvation occurs on the Presidential faces carved on Mount Rushmore - the most modern American image of all. \nAs with many of Hitchcock's films, there were Academy Award nominations, but no Oscars. This film was nominated for three awards: Best Story and Screenplay (Ernest Lehman), Best Color Art Direction/Set Decoration, and Best Film Editing (George Tomasini). [Some believe that the film's premise was based on the famous 1956 international espionage case titled: &amp;quot;The Galindez Affair.&amp;quot;] The film also included a superb score by Bernard Herrmann. However, there were no nominations for Best Picture, Best Director, or Best Score, to name only a few.\n \nSpanish-English with Spanish-English subs\n(Xvid-mp3)\n\nEnjoy!!!","torrent":{"xt":"urn:btih:b67810a2a915ec795a1069b44d888cfde20f23c9","amp;dn":"Alfred+Hitchcock+-+1959+-+North+by+Northwest+%5BDUAL+Span-Eng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67810a2a915ec795a1069b44d888cfde20f23c9","infoHashBuffer":{"type":"Buffer","data":[182,120,16,162,169,21,236,121,90,16,105,180,77,136,140,253,226,15,35,201]},"announce":[],"urlList":[]}}