{"title":"littleman","uid":3504092,"size":502292480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b6af1cf2769bc324c9074a3507144be6744c885c&amp;dn=littleman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kernsgeorge","files":1,"time":1153083947,"description":"Fate brings a childless couple a bundle of joy -- who happens to have a criminal record -- in this comedy directed by Keenen Ivory Wayans. Calvin Simms (Marlon Wayans) is a master criminal who with the help of his friend and sidekick, Percy (Tracy Morgan), plans a daring robbery of a museum where one of the world&amp;#039;s largest diamonds is on display. One of reasons Calvin is able to get inside secure areas is his size -- Calvin is dwarf who stands less than two feet tall, and can slip in unnoticed where more conventionally sized people would not. While Calvin is able to get the diamond, he&amp;#039;s nearly caught by the police while making his getaway, and stashes the jewel in a bag carried by a passerby. Eager to recover the diamond from the unwitting accomplice, Calvin and Percy figure out a way to get into his house -- they dress Calvin up as a baby, and leave him on the doorstep of the passerby&amp;#039;s home. As it happens, the couple who live there (Shawn Wayans and Kerry Washington) have been wanting to have a baby, and they eagerly take the new arrival under their wing, embracing the joys of parenthood while ignoring some of the toddler&amp;#039;s unusual behavior.","torrent":{"xt":"urn:btih:b6af1cf2769bc324c9074a3507144be6744c885c","amp;dn":"littleman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6af1cf2769bc324c9074a3507144be6744c885c","infoHashBuffer":{"type":"Buffer","data":[182,175,28,242,118,155,195,36,201,7,74,53,7,20,75,230,116,76,136,92]},"announce":[],"urlList":[]}}