{"title":"WWE (Vince &amp; Chavo) Press Conference on the death of Eddie","uid":3409831,"size":172169220,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b6c94f0e3abc7fc575e1b35d57b1fcbeb4cb6ebe&amp;dn=WWE+%28Vince+%26+Chavo%29+Press+Conference+on+the+death+of+Eddie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wwefan","files":1,"time":1132099798,"description":"R.I.P. Eddie\n\nWe will miss you and we already do.  One of the best reasons to turn on Smackdown! was you and we will miss your charism and huge heart.\n\nYou are an inspiration to us all and more than you would ever know. The world has lost a great person, but Heaven has been made greater.\n\nThe spirit of Latino Heat will live on.  Viva La Raza forever.\n\n\n\nThe Raw and Smackdown! shows were together in Minneapolis, MN.  It was scheduled as a Supershow.  Because of this, Raw is a 4-hour tribute to Eddie.  Raw is one half, Smackdown! the other half.  I want to clear this up since people have been asking a lot about it.\n\nThose that haven't read or heard, here you are.\n----------------------------------------------------------------\n\nHere is what Vickie Guerrero had to say to WWE.com:\n\n?It was heart failure. It was from his past ? the drinking and the drug abuse. They found signs of heart disease. She (the examiner) said that the blood vessels were very worn and narrow, and that just showed all the abuse from the scheduling of work and his past. And Eddie just worked out like crazy all the time. It made his heart grow bigger and work harder and the vessels were getting smaller, and that?s what caused the heart failure. He went into a deep sleep.\n\nAs soon as they saw his heart, they saw the lining of his heart already had the heart disease. There was no trauma, and Eddie hadn?t hurt himself in any way. It answered a lot of questions. I knew Eddie wasn?t feeling very good for the last week. He was home and kept saying he wasn?t feeling good and we thought it was just ?road tired.? So we thought he just had to rest. It answered a lot of my questions, too, because he was just so exhausted. She said it was normal because the heart was working so hard.\n\nWhen he didn?t call me last night and the night before I knew it was for real, because he would call me every night. I miss his phone calls. I cried through the whole thing (last night).\n\nI loved his laugh. His laugh was the best.\n\nWe just celebrated his four-year sobriety last Thursday. We just thought we had life by the handful. We thought we had it all figured out. He worked so hard to make a better life for us.\n\nI?m just overwhelmed by how people are coming out. It?s touched my heart a lot.\n\nEverybody was just in awe last night in how beautifully everything was put together.\n\nAll my life was wrestling. All he did was take care of them and live for that. And I don?t know what to do now.?","torrent":{"xt":"urn:btih:b6c94f0e3abc7fc575e1b35d57b1fcbeb4cb6ebe","amp;dn":"WWE+%28Vince+%26+Chavo%29+Press+Conference+on+the+death+of+Eddie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6c94f0e3abc7fc575e1b35d57b1fcbeb4cb6ebe","infoHashBuffer":{"type":"Buffer","data":[182,201,79,14,58,188,127,197,117,225,179,93,87,177,252,190,180,203,110,190]},"announce":[],"urlList":[]}}