{"title":"Der.SchlÃƒÆ’Ã‚Â¤fer.(ger.-eng.).xvid.[DVDRip].by.j0ck1ng3r.avi","uid":3383993,"size":733997056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b703554c0b1f2df15cedbe0a5850c8cbbeb07069&amp;dn=Der.Schl%C3%83%C6%92%C3%82%C2%A4fer.%28ger.-eng.%29.xvid.%5BDVDRip%5D.by.j0ck1ng3r.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Distribution2005","files":1,"time":1126898145,"description":"ENGLISH:\n\nWoody Allen's films are generally treasured among other comedies because of their wit and charm. Many critics would agree, though, that Allen's earlier films were among his best. One of those movies was a lighthearted film called `Sleeper,' which starred a younger version of Allen and a younger, but always beautiful Diane Keaton. Although `Sleeper' leaves a person in stitches from laughter, its one flaw is that it lacks an ending. But don't let that stop you from seeing this comedy classic. In the end, who cares where it goes because it's just flat out funny. `Sleeper' is the story of Miles Monroe (Allen), who is cryogenically frozen in 1973 after having a procedure in a hospital. He is awoken nearly 200 years later by a group of scientists who want Monroe to help them defeat the leader of their society, as America's future consists of a totalitarian state. While on his adventure through this futuristic world, Monroe meets a beautiful woman named Luna Schlosser (Keaton) who he begins to have a love interest in. The two team up to try to oust their tyrannical government and bring about freedom and prosperity. `Sleeper' was hysterical from beginning to end. The very opening scene shows Monroe covered in tin foil-clearly scientists in 1973 found new and amazing uses for this wonderful kitchen product. As soon as Monroe awakens, he is disoriented, smiling aimlessly into space and walking backwards and into people. Allen's comical blend of intellect and charm shows up soon after. The futuristic society is comprised of people who have no historical references for the events of the past 200 years, as their leader has undoubtedly outlawed certain forms of knowledge that could lead to rebellion. They use Monroe to fill in the historical gaps by showing him pictures of famous twentieth century individuals, such as Joseph Stalin. Monroe provides his own synopsis of their contributions to the world in his own clever way, as he does also for former President Nixon. Allen's writing, direction and performance were hilarious. Rarely do we see writing as clever and sidesplitting in today's comedies. The only other comic director today that could even compare to Allen would be Christopher Guest, whose mockumentary films such as `Best In Show,' and the recent `A Mighty Wind,' have a real source of comedy. Most present comedies are trivial, filled with rehashed jokes that depend more on toilet humor than any form of real wittiness. The film's only problem is that after an hour and a half, it doesn't seem to know what to do with itself. It ends on a clever note about love with the protagonists somehow managing to save themselves, but not really the day. They realize that perhaps the only thing worth fighting for, in the end is love. All in all, `Sleeper' was a very funny farce on science fiction stories, and it cemented Allen's ability to be an engaging and funny in his films. ***\n\n\n\nGERMAN:\n\nMiles Monroe hat 200 Jahre tiefgefroren verschlafen, als ihn zwei Wissenschaftler heimlich auftauen. Man schreibt das Jahr 2174; Amerika ist ein autorit&amp;auml;rer Polizeistaat mit einem allm&amp;auml;chtigen &quot;F&amp;uuml;hrer&quot;, genie&amp;szlig;t automatischen Sex und l&amp;auml;sst sich von Robotern bedienen.\n\nMiles, Klarinettist und Inhaber eines vegetarischen Restaurants, wurde 1974 in Tiefschlaf versetzt und eingefroren, als es bei der Behandlung seines Magengeschw&amp;uuml;rs Komplikationen gab. Wiederaufgetaut kann er mit erstaunlichen Informationen &amp;uuml;ber seine damaligen Zeitgenossen aufwarten, ehe er sich vor&amp;uuml;bergehend in einen Roboter verwandeln muss, um den Nachstellungen der Staatspolizei zu entgehen.\n\nSo ger&amp;auml;t er an die attraktive Luna und st&amp;ouml;&amp;szlig;t nach aufregenden Verfolgungsjagden und anderen irren Abenteuern zu einer Untergrundorganisation, f&amp;uuml;r die er Kopf und Kragen riskiert, als es gilt, die Nase des get&amp;ouml;teten Diktator zu entf&amp;uuml;hren, damit der &quot;F&amp;uuml;hrer&quot; nicht geklont werden kann!\n\nWoody Allen nutzte seine &amp;uuml;berm&amp;uuml;tige Sciencefiction-Kom&amp;ouml;die zu einer satirischen Abrechnung mit hoch stehenden Zeitgenossen und fragw&amp;uuml;rdigen Zeiterscheinungen. Frivoler Wortwitz und gekonnte Slapstickkomik verbinden sich zu einer skurrilen Groteske, in der eine totalit&amp;auml;re Gesellschaft der L&amp;auml;cherlichkeit preisgegeben wird.","torrent":{"xt":"urn:btih:b703554c0b1f2df15cedbe0a5850c8cbbeb07069","amp;dn":"Der.Schl%C3%83%C6%92%C3%82%C2%A4fer.%28ger.-eng.%29.xvid.%5BDVDRip%5D.by.j0ck1ng3r.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b703554c0b1f2df15cedbe0a5850c8cbbeb07069","infoHashBuffer":{"type":"Buffer","data":[183,3,85,76,11,31,45,241,92,237,190,10,88,80,200,203,190,176,112,105]},"announce":[],"urlList":[]}}