{"title":"East-Tec Eraser 2005 v6.0.0.115","uid":3297969,"size":2374164,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b76b475bc6d8be50bfce65ce6be5ef3c2a490c06&amp;dn=East-Tec+Eraser+2005+v6.0.0.115&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jax","files":4,"time":1109949057,"description":"-=*BLURB*=-\n\nProtect your data and privacy and remove all evidence of your computer and online activity with East-Tec Eraser 2005\n\nEraser goes beyond U.S. Department of Defense standards for the permanent erasure of digital information and easily removes every trace of sensitive data from your computer. Completely destroy information stored without your knowledge or approval: Internet history, Web pages and pictures from sites visited on the Internet, unwanted cookies, chatroom conversations, deleted e-mail messages, temporary files, the Windows swap file, the Recycle Bin, previously deleted files, valuable corporate trade secrets, business plans, personal files, photos or confidential letters, etc. East-Tec Eraser 2005 offers full support for popular browsers (Internet Explorer, Netscape Navigator, America Online, MSN Explorer, Opera), for Peer2Peer applications (Kazaa, Kazaa Lite, iMesh, Napster, Morpheus, Direct Connect, Limewire, Shareaza, etc.), and for other popular programs such as Windows Media Player, RealPlayer, Yahoo Messenger, ICQ, etc. Eraser has an intuitive interface and wizards that guide you through all the necessary steps needed to protect your privacy and sensitive information. Other features include support for custom privacy needs, user-defined erasure methods, command-line parameters, integration with Windows Explorer, and password protection.\n\nBenefits:\n\nPrevent your sensitive information from falling into the wrong hands.\n\nPrevent colleagues, customers, or family members to see where you've been on the Internet.\n\nMake sure that the information stored by Windows or by your programs without your knowledge or approval does not compromise your privacy.\n\nPrevent identity theft. Identity thieves obtain your personal information and use it without your knowledge to commit fraud or theft. The Federal Trade Commission recommends fighting identity theft by using &amp;quot;wipe&amp;quot; utility programs (like East-Tec Eraser 2005) to destroy information you no longer need and want to delete.\n\nMake sure nobody recovers your deleted information. East-Tec Eraser 2005 has erasure methods that meet and exceed the standards of the United States Department Of Defense (DOD 5220.22) and of the Naval Information Systems Management Center.\n\nSpeed up system performance and recover valuable hard disk space.\n\n\n----------------------------------------------------------------------------------------\n\nSeeded by Jax","torrent":{"xt":"urn:btih:b76b475bc6d8be50bfce65ce6be5ef3c2a490c06","amp;dn":"East-Tec+Eraser+2005+v6.0.0.115","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b76b475bc6d8be50bfce65ce6be5ef3c2a490c06","infoHashBuffer":{"type":"Buffer","data":[183,107,71,91,198,216,190,80,191,206,101,206,107,229,239,60,42,73,12,6]},"announce":[],"urlList":[]}}