{"title":"Cykle - Cykle Featuring The Young Ones 1969 (Rare US Psych)","uid":3393037,"size":121792558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8147bbe32175e2cccca80834bc9abaf5abeefdb&amp;dn=Cykle+-+Cykle+Featuring+The+Young+Ones+1969+%28Rare+US+Psych%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"buzzard","files":19,"time":1128630361,"description":"Cykle - Cykle Featuring The Young Ones 1967-1969\n\nsize:            116 mb\nbitrate:        320\n\n\nThe Gear Fab official reissues hit the racks at last! Featured on the legendary 'Endless Journey' comps Cykle are in the top 20 US '60s psych bands. Mind bending wah-wah fuzz guitar, undulating keyboard freakouts, acid inspired lyrics and a frantic wired vocalist. \n\n1. Too Much Lovin' - (with The Young Ones)\n2. Harbor Melon - (with The Young Ones)\n3. Big Teaser - (with The Young Ones)\n4. It's You - (with The Young Ones)\n5. If You Can\n6. Walkout (Of My Mind)\n7. Maiden Girl\n8. Walkin' Through My Mind\n9. A Little Faith\n10. It's Her\n11. Lesson To Learn\n12. In Love My Friend\n13. Do My Thing\n14. What You Do To Me\n15. In My Dreams - (with Jimmy Sossamon)\n16. In My Dreams - (with The Rhodes Scholars)\n17. What's On Your Mind - (with The Rhodes Scholar)\n\n   Reviews: \n        Opinions divide on this, some think it an absolute monster while others (like me) are less impressed. Sure, there are some awesome garagepsych tracks here, most of which have been comp'd, but like Mystic Siva there's also a fair share of slow numbers that seem to go nowhere. Drummer is about 3 times as good as any other band member. The &quot;production&quot; (or whatever) is pretty flat in places though I've heard claim the original's superior soundwise. Cool cheesy sleeve. [PL]\n        ---\n        Melodic dual fuzz garage psych with a great, ringing organ sound. Mix of snotty rhythm fuzz punk and moody organ rockers, fun effects, strong vocals. A truly special record with the perfect mix of teen innocence and aggression. [RM]\n        ---\n        Half the time this sounds like a perfect garage band album; the other half it floats right by without making any impression. The truth surely lies somewhere in between. Incredibly clean production is almost too smooth for its own good. They have a likeable youthful spirit, but in the long run don?t have much to say lyrically or musically. Unmelodic vocals don?t match the energetic guitar and keyboard playing. [AM]\n        ---\n        Local teen garage album that sounds/looks more like '67 than '69, so don't let the release date scare you. Maybe the band had been going for a coupla years before finally deciding to make an LP so some of the songs might've been written as early as '67? Liberal doses of fuzz, vox organ and snotty Sky Saxon vocals in the punkpsych tracks makes for great listening. The slower tracks are moody, but doesn't quite match the quality of the punkers. On side two the quality drops somewhat and the ending 7:26 track gets a bit tedious, to say the least. About 50% of the LP delivers all the way and the rest is definitely weaker. All originals though, which is a plus. One of the better sounding Gear Fab reissues btw. [MM]","torrent":{"xt":"urn:btih:b8147bbe32175e2cccca80834bc9abaf5abeefdb","amp;dn":"Cykle+-+Cykle+Featuring+The+Young+Ones+1969+%28Rare+US+Psych%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8147bbe32175e2cccca80834bc9abaf5abeefdb","infoHashBuffer":{"type":"Buffer","data":[184,20,123,190,50,23,94,44,204,202,128,131,75,201,171,175,90,190,239,219]},"announce":[],"urlList":[]}}