{"title":"The Third Man [CiN]","uid":3280760,"size":1494791678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc0ab33e4afdff4517eef93bb05409e0f283cea9&amp;dn=The+Third+Man+%5BCiN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pippin","files":4,"time":1106438775,"description":"I include The Third Man (Criterion) in my Welles series though its strictly speaking not a Welles film - He didnt direct it but its probably his most famous role.\n\n&lt;p&gt;\n&lt;img src=&quot;http://server3.uploadit.org/files/Pippin-ThirdMan.jpg&quot; /&gt;\n&lt;/p&gt;\n\nOne of the few films where the hero's (or anti-hero) belated entrance is actually worth waiting for! The scene was just voted best entrance scene in film history. But there are many other great things about it, from the Harry Lime Theme, played on a zither, which became a huge hit to the dramatic background of a bombed-out Vienna. I include director and friend of Welles Peter Bogdanovich's introduction to the film - among other things, he has a funny story to tell about Welles' part as Harry Lime. English subtitles included.\n&lt;p&gt;\nAmazon.com: The fractured Europe post-World War II is perfectly captured in Carol Reed's masterpiece thriller, set in a Vienna still shell-shocked from battle. Holly Martins (Joseph Cotten) is an alcoholic pulp writer come to visit his old friend Harry Lime (Orson Welles). But when Cotton first arrives in Vienna, Lime's funeral is under way. From Lime's girlfriend and an occupying British officer, Martins learns of allegations of Lime's involvement in racketeering, which Martins vows to clear from his friend's reputation. As he is drawn deeper into postwar intrigue, Martins finds layer under layer of deception, which he desperately tries to sort out. Welles's long-delayed entrance in the film has become one of the hallmarks of modern cinematography, and it is just one of dozens of cockeyed camera angles that seem to mirror the off-kilter postwar society. Cotten and Welles give career-making performances, and the Anton Karas zither theme will haunt you.\n&lt;/p&gt;\nCodec: DivX Pro 5.2.1\nResolution: 640x480\nFramerate: 23.976 fps\nAspect Ratio: 4:3\nBitrate: 1782 kbit/s\nAudio: Mp3PRO @ 64 kbit/s (Mono)\n&lt;p&gt;\n&lt;A HREF=&quot;http://www.piratbyran.org/?view=forum&amp;a=thread&amp;id=19235&quot;&gt;Cineastklubben&lt;/A&gt;\n&lt;/p&gt;","torrent":{"xt":"urn:btih:bc0ab33e4afdff4517eef93bb05409e0f283cea9","amp;dn":"The+Third+Man+%5BCiN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc0ab33e4afdff4517eef93bb05409e0f283cea9","infoHashBuffer":{"type":"Buffer","data":[188,10,179,62,74,253,255,69,23,238,249,59,176,84,9,224,242,131,206,169]},"announce":[],"urlList":[]}}