{"title":"iPod Media Studio version 2.1.1","uid":3457430,"size":4197832,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc1c97303b3ddf0ba1694b05bd2eea96e7540818&amp;dn=iPod+Media+Studio+version+2.1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jurgeng","files":1,"time":1142365900,"description":"Now 300% faster ! Watch DVD, home movies, feature films and TV-series on your video iPod in great quality, in full screen, zoomed mode. Transfer DVD to iPod in three clicks. This software may be purchased online from our webstore.\n\nA 60 Gb iPod may store up to 200 hours of home movies and tv recordings or one hundred full length feature films. Consumers can watch their content on the go, on supported models.\n\nThe software installs an encoding package on a Windows XP computer, users pick any video file from their harddrive, CD or DVD and with only three clicks, the software turns it into a compressed movie file, which will play on the MPEG4-mediaplayer on the iPod. The headset or the built-in speaker can be used to listen to the sound. Subtitled and foreign language DVDs are also supported.\n\nEnjoy movies with an amazingly sharp picture and stereo CD-quality sound. The ideal solution for frequent travellers or to keep the kids happy in the back of the car. The software captures all content (AVI, MPEG1, DivX, XVID, VOB, ASF) on all drives (harddrive, CD, DVD, removable) and encodes it to iPod.\n\nThe free tryout version allows users to convert 3 minutes of all content and doesn&amp;#039;t expire. Runs on Windows XP/2000/NT (no Mac version).","torrent":{"xt":"urn:btih:bc1c97303b3ddf0ba1694b05bd2eea96e7540818","amp;dn":"iPod+Media+Studio+version+2.1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1c97303b3ddf0ba1694b05bd2eea96e7540818","infoHashBuffer":{"type":"Buffer","data":[188,28,151,48,59,61,223,11,161,105,75,5,189,46,234,150,231,84,8,24]},"announce":[],"urlList":[]}}