{"title":"May Blitz - May Blitz 1970","uid":3392485,"size":95676544,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd2ecb027f78e41286d08eaba3fc8752781a7f42&amp;dn=May+Blitz+-+May+Blitz+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"buzzard","files":11,"time":1128518776,"description":"May Blitz - May Blitz 1970\n\n[IMG]http://img350.imageshack.us/img350/2378/mbrh32xi.jpg[/IMG]\n\nsize:           91 mb\nbitrate:       320\n\nPersonnel:\nKeith Baker - Drums\nJamie Black - Guitar, Vocals\nTony Newman - Vibes, Drums\nTerry Poole - Bass\nReid Hudson - Bass, Vocals\n\nAlbums:\nMay Blitz (Vertigo 6360 007) 1970 (reissued on Repertoire - 1994, IMS 7026)\nSecond of May (Vertigo 6360 037) 1971 (reissued on Repertoire - 1994, IMS 7027) \n\nTony Newman had previously played with Sounds Incorporated and the Jeff Beck Group. His powerhouse drumming suited this heavy rock act's loud aggressive sound, which was liberally laced with echoed feedback guitar.  The first album is the best of the two; both vinyls are highly sought-after on the collector's market.  The group was known for their heavy, blues-tinged, lumbering progressive rock style, typical of the era.  May Blitz were also featured on the Vertigo Annual 1970 compilation, playing &quot;I Don't Know&quot; from their debut album. Jamie Black went on to play with F.B.I. in the late '70s.\n\nThe original line-up of  May Blitz, formed in 1969, contained guitarist/vocalist Jamie Black and ex-Bakerloo members: bassist Terry Poole and drummer Keith Baker.  However, before any recording took place, Poole left for a career in session work (Graham Bond,  Vinegar Joe) and Baker accepted an offer to join Uriah Heep, appearing on their &quot;Salisbury&quot; LP.  Reid Hudson therefore took over the bass duties whilst ex-Sounds Incorporated/Jeff Beck Group stickman Tony Newman took over the drum stool.\n\nThe trio's aggressive out'n'out hard rock style brought them to the attention of progressive label Vertigo Records who saw May Blitz as being in the same vein as Black Sabbath and Uriah Heep, both of whom were signed to the label.  Their debut self-titled LP (Vertigo 6360 007) was released in mid-1970 and contained seven lengthy self-composed tracks, distinguished by the use of echoed feedback guitar playing from Black.  Though not a chart success, original vinyl copies of the album complete with gatefold sleeve and Vertigo's famous 'swirl' logo, now command prices of 50 British Pounds and up on the collectors' market.  Just over six months later, in early 1971, they released their second LP, &quot;The 2nd of May&quot; (Vertigo 6360 037) which again came in a highly collectable gatefold sleeve.  However, the eight tracks, again, mostly written by all three members, failed to live up to the power and excitement of the first album and so shortly after its release they disbanded.\n\nTony Newman joined Three Man Army and appeared on the LPs, &quot;Three Man Army&quot; and &quot;Two&quot; before forming Boxer with Mike Patto and releasing &quot;Below the Belt&quot; and &quot;Bloodletting&quot; albums.  He also worked with the likes of David Bowie, Marc Bolan, Mick Ronson, Whitesnake and Chris Spedding and has remained an in-demand session musician. As for Jamie Black and Reid Hudson, it would seem they disappeared form music altogether. \n\n\nMay Blitz: May Blitz (1970)\nMay Blitz was a short lived British-based trio that consisted of two Canadians and an Englishman. The two Canadians were guitarist and vocalist James Black and bassist Reid Hudson, with the Englishman being drummer Tony Newman, formerly of the Jeff Beck Group. This band basically combined psychedelia with blues and hard rock that's not unlike the Jimi Hendrix Experience or Cream.\nMay Blitz only released two albums, this one, which is their debut, and The 2nd of May in 1971 before breaking up. The opening song, &quot;Smoking The Day Away&quot; sounds a lot like Hendrix, in fact, my brother was convinced it was Hendrix when he first heard it. The song has tends to be drug-oriented, and you can practically smell the marijuana smoke hearing this. The song is also loaded with some killer guitar jams. &quot;I Don't Know&quot; is much in the same vein, with rather strong hippie overtones (the lyrics deal with the back to the land movement of the hippies of that time).\n&quot;Dreaming&quot; starts off acoustic and mellow, but before you know it, you get blasted with some truly insane drumming and more killer solos. &quot;Squeet&quot; is one of my favorites, I can't really explain it, but the lyrics are pretty silly, it keeps &quot;Squeet all over the walls&quot; over and over, then the band goes off soloing again.\n&quot;Tomorrow May Come&quot; is another favorite of mine, it's a really cool and mellow psychedelic piece. &quot;Fire Queen&quot; is a totally wild song that sounds a whole lot like The Crazy World of Arthur Brown (James Black sounds a whole lot like Brown on this song), the only difference is this song is dominated by guitar rather than Hammond organ.\nThe album closes with &quot;Virgin Waters&quot;, it's the closest thing to prog rock on this album, but still sticks to their bluesy hard rock roots. I really love that spoken dialog. This is a truly wild album and if the description of their music sounds interesting to you, get this album.\n\n[IMG]http://img350.imageshack.us/img350/2113/cover1xq.jpg[/IMG]\n\nMembers:\n- James Black: lead vocals, guitar\n- Reid Hudson: bass\n- Tony Newman: drums\n\n1.Smoking The Day Away\n2.I Don't Know\n3.Dreaming\n4.Squeet\n5.Tomorrow May Come\n6.Fire Queen\n7.Virgin Waters\n","torrent":{"xt":"urn:btih:bd2ecb027f78e41286d08eaba3fc8752781a7f42","amp;dn":"May+Blitz+-+May+Blitz+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2ecb027f78e41286d08eaba3fc8752781a7f42","infoHashBuffer":{"type":"Buffer","data":[189,46,203,2,127,120,228,18,134,208,142,171,163,252,135,82,120,26,127,66]},"announce":[],"urlList":[]}}