{"title":"Jewish Ritual Murder Revisited - The Hidden Cult (Excerpt)","uid":3387481,"size":42474644,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:bd63ea0f0096b0c5e46b6bb92579d38c3dc25f85&amp;dn=Jewish+Ritual+Murder+Revisited+-+The+Hidden+Cult+%28Excerpt%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1127591649,"description":"From me to to tastor1138 *lol*\n\nSynopsis: &quot;Recently, a great controversy has been occurring in Russia, which has angered many Jews. It involves a statement signed by thousands of Russia?s most elite-- its most brilliant intellectuals and leaders. The people who signed it are members of Russia?s Duma (the equivalent of the U.S. Senate), professors at the most prestigious universities, editors of newspapers and magazines, heads of the Orthodox Churches, and many other well-respected professionals--even chess champion Boris Spassky. The reason why the statement has angered Jews worldwide deals with its content, which criticizes the double-standard of certain ?hate laws? only being applied to non-Jews, when Jewish writings are often much worse. However, there is one paragraph, in particular, that really generates the anger of Jews who read it:\n\n&quot;...[T]he Jewish religion is anti-Christian and misanthropic to the point of ritual murder. Many examples of this ritual extremism were documented in courts. (For example, see the study of the well-known scholar V. I. Dal?, Rozyskanie o ubinenii yevreyami khristianskikh mladentsev i upotreblenii krovi ikh [?Criminal investigation into the murder by Jews of Christian infants and the use of their blood.?] St. Petersburg, 1884)...?\n\nRitual murder? Jews? Surely, this must be simply anti-Jewish propaganda?  Who is this ?V.I. Dal? cited?  Certainly, he must have been just a neo-Nazi anti-Semite (even though he lived in the 1800s, long before there was ever even a thought of a Nazi-party)?  If it were only that simple, perhaps the statement could be easily dismissed. \n\n?V.I. Dal,? who wrote the book cited, turns out to be Dr. Vladimir Ivanovich Dal, perhaps Russia?s greatest linguist and author of its ?Living Dictionary,? easily the equivalent of America?s Webster?s Dictionary. He is well-respected in Russia, and was recently even shown on a postage stamp there.\n\nOf course, when you look into this matter, it turns out not to merely be a Russian phenomenon--accusing extremist Jews of this foul act of ritual murder--but a claim that follows Jews wherever they live. Germany, Spain, France, Austria, England, Syria, Jordan, Austria, Italy, and even America--in all these places, Jews have been found guilty of murdering children, often as part of some bizarre occult rites.\n\nMany people have written about this topic: Dr. Arnold Leese, Dr. Hellmutt Schramm, Dr. Philip DeVier, Dr. Harrell Rhome, Dr. Edward Fields, Attorney and Duma Member G.G. Zamyslovsky, Russian Poet V.V. Rozanov, numerous Popes, Martin Luther (the founder of the Lutheran Church), King Ferdinand of Spain, and many other well-respected people throughout the course of time.  Were they merely ?hate mongers,? as Jews might say, or was there something more?\n\nSome who study such matters may recall the May 1, 1989 Oprah Winfrey Show, and how a Jewish girl came out and told how members of her family--and other prominent Jews who were involved in the government and in other respectable jobs--had been involved in the cruel act of human sacrifice.  She described the situation in detail. Curiously enough, that very same year, a child?s skeletal remains had been discovered in a synagogue?s basement.&quot;\n\nRuntime......: 00:26:14\nVideo Codec..: Windows Media Video 9\nVideo Bitrate: 200 Kbps.\nAudio Codec..: Windows Media Audio 8\nAudio Bitrate: 32 kbps, 32 kHz, stereo\nFrame Size...: 320 x 240","torrent":{"xt":"urn:btih:bd63ea0f0096b0c5e46b6bb92579d38c3dc25f85","amp;dn":"Jewish+Ritual+Murder+Revisited+-+The+Hidden+Cult+%28Excerpt%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd63ea0f0096b0c5e46b6bb92579d38c3dc25f85","infoHashBuffer":{"type":"Buffer","data":[189,99,234,15,0,150,176,197,228,107,107,185,37,121,211,140,61,194,95,133]},"announce":[],"urlList":[]}}