{"title":"Oceans.Twelve.REAL.PROPER.DVDR-Centropy","uid":3300099,"size":4787352196,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bd6eea6587afc39869e58e7a58eeb0848882e75e&amp;dn=Oceans.Twelve.REAL.PROPER.DVDR-Centropy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spaz420","files":98,"time":1110403125,"description":"Initial seed &amp;amp; release provided by AntinousK.\n\nCentropy - Finest VCD/DVD release crew :\n\nTitle.............: Ocean's Twelve      \nRipper...........: Brad Pitt\nDate.............: 09-03-2005\nSupplier.........: George Clooney\nQuality..........: DVDR\nArchives........: 95*50\nGenre...........: Comedy/Crime/Thriller\nRating..........: 6.1/10\n\nFirst of all :\n\nWe're sorry the real deal took this much time, but we\nweren't sure IF we should bring out a real proper, while we had every\nright to do so in the first place.                                    \n\nWe discussed it alot amongst ourselves and came to the conclusion that  \n\n1-click-rips shouldn't be celebrated as they are nowadays in the scene.\nWe always tried (and still do) to bring the scene the best possible    \nreleases in the best possible quality, and it may be silly, but that's  \nwhat we expect from other crews too.                                    \n\nWhat we are trying to say is that we don't mind being beaten if it is  \nby a quality crew with a quality product. If you are faster than us,  \nand deliver quality : respect. But nowadays sites, in the struggle to  \nbe regarded as a topsite, take on riffraff groups who have no intention\nof bringing quality, but just to rush out stuff to pimp their groupname.\nIt might be nice they have a supply.. but does that mean the scene      \nshould allow crap to be pre'd? Should the scene even allow these groups\nthe light of day?\n\nThere was a time groups like this were dealt with,  \nswiftly.. but alas - those days seem long past.                        \n\nSince we believe things can still change for the better, we decided to  \nbring the scene a quality rip of this dvd.                              \nAnd oh.. we even have proper reasons ! Here we go:                    \n\nMPTDVD release                                                    \n\n* Subs                                                                  \nEnglish subs are on by default. Foreign subs are unusable while I      \ntested by using daemon/mpc. There are also 2 substreams specified as    \nchinese which contain nothing. While using my standalone they work from\nmenu, but trying the subtitle button on my remote english is the only choice.                                                                                                                                      \n* Menu                                                                  \nTried to strip out the french LU's, but managed to keep the french      \nsubtitle menu. Examining it in ifoedit shows complete disarray when    \ncomparing to original. All in all.. menu is raped. There's no nice word\nfor it.                                                                \n\n* Missing Scenes                                                        \nMissing 18 seconds of footage at around 1:08:20 (MPT dvdr time). For  \nsome reason this is exactly where BRUTUS xvid has its CD change.      \n\n* Picture Quality                                                      \nBlur-o-matic.                                                          \n\n*Interlacing                                                          \nExamining the sample I found one single frame that shows interlacing.  \nNot really a worthy reason we think but kept in for completeness sake.  \nI wouldn't be suprised if there were more interlaced frames, but it    \nalready was obvious that this was a 1-clicker, so no point on checking  \nit all.                                                                \n\n* VIDEO_TS.VOB                                                          \nThere is none on the original DVD9 - there is one in this release.      \n1-clickers tend to create these files for you.. and thus leave a trace.\n\n* DVDInfo Pro                                                          \nImplementation id DVD Shrink                                            \n\n\nSHINBET release                                                        \n\n* Audio Tracks                                                          \nKept both 5.1ch and 2.0ch english. Also didn't remove the ID's for the  \nstripped tracks (french and reserved) not included.                    \n\n* Menu                                                                  \nKept all of the french LU's and reencoded the english ones to save      \nspace. Didn't menu-edit audio menu so stripped audios are selectable    \nand point to non-existant audio tracks.                                \n\n* Picture Quality                                                      \nPoor at best.                                                          \n\n* Extra                                                                \nAlthough the original DVD9 doesn't carry many extras, they HAVE to be  \nripped on this one to preserve watchable dvd-bitrate. ShinBet didn't    \nbother to remove neither the trailers in front of the movie, nor the    \ncompany-logo, nor the copyright notices, nor the trailer of the movie  \nitself. Which brings us to :                                            \n\n* Bitrate                                                              \nSpecified bitrate in nfo is 4700 kbit/s. Extracting the .m2v yields a  \nfile thats 3.607.116.434 bytes. Runtime is 125 minutes.                \nCalculating 3607116434 / (125 * 60) / 1024 * 8 gives us 3757 kbit/s.    \nCompare that to our 4205. But i'm sure that was just a typo tho, right?\n\n* DVDInfo Pro                                                          \nImplementation id DVD Shrink                                            \n\n\nWhich brings us to our own stats :\n\nVideo: 6-pass CCE reencode @ 4205 kbps.                              \nAudio: 5.1 English.                                                  \nSubs: English, Spanish, French.                                      \nRipped: Extras, logo's, rest of the audio, and french menu to get      \nbitrate at a decent level.                                    \nSource: WS. Retail R1\n\nIn conclusion we thank you for reading this far and sincerely hope      \nthat you don't have to read another one like it as much as we hope      \nanother one like it doesn't have to be written.                        \n\nP.S.                                                                    \nRemember who released Ocean's Eleven DVDR almost 3 years ago?      \n\n*Movie Cast\n\nImdb :  Check out -&amp;gt; http://www.imdb.com/title/tt0349903/\n\nCentropy Information\n\nPlease remember: we do this for FUN. We do not make money        \noff this whole business. If people tell you                          \nthey're in Centropy, they're lying.We do not condone            \npeople selling illegal copies of movies for profit.              \nIn fact, all of us go to the movies regularly and pay for        \nour tickets just like everyone else.                            \nIf everyone only watched illegal copies, there would be          \nno money to make new movies.                                      \n\nGreetings to our fellow release crews..","torrent":{"xt":"urn:btih:bd6eea6587afc39869e58e7a58eeb0848882e75e","amp;dn":"Oceans.Twelve.REAL.PROPER.DVDR-Centropy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd6eea6587afc39869e58e7a58eeb0848882e75e","infoHashBuffer":{"type":"Buffer","data":[189,110,234,101,135,175,195,152,105,229,142,122,88,238,176,132,136,130,231,94]},"announce":[],"urlList":[]}}