{"title":"Mark Thomas - Thomas Country","uid":3442911,"size":426127567,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bdedf39fc79b5db7d15fb32bc3e3e6810721670c&amp;dn=Mark+Thomas+-+Thomas+Country&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crimsone","files":2,"time":1139603189,"description":"Mark Thomas turns current affairs reporter... without quite leaving comedy behind, as he investigated those who claim to speak for the countryside and asked who and what they really represent.\n\nBefore an invited audience he mercilessly dissected the arguments and image of the pro-country lobby and exposed how moneyed interests are behind many of its activities. And by posing as a right-wing farmer ruthlessly parodied some of the most extreme country attitudes.\n\nMark posed as a rich, right-wing farmer who has made a pile of money in the City and now wanted to introduce &amp;#039;a business agenda for revitalising the countryside&amp;#039;. This character, &amp;#039;Farmer Mark&amp;#039;, parodied the self-interest of some larger farmers, determined to milk the state of subsidies, plough up meadows and hedgerows if it yields more funds, and keep country lovers as far from their property as possible.\n\n&amp;#039;Farmer Mark&amp;#039; even staged a debate at a country fair between himself and environmental campaigner George Monbiot. The country audience seemed to prefer the excessive views of &amp;#039;Farmer Mark&amp;#039; and gave Monbiot a rough time when he advocates the right to roam and tougher environmental protection.\n\n&amp;#039;Farmer Mark&amp;#039; even went as far as campaigning against picnics and kite-flying - although this turned out to be a policy actually advocated by the National Farming Union.\n\nIn another guise Mark turned up at a Hunt posing as a pest control expert, relentlessly parodying the argument that fox-hunting is really just a way of keeping down a rural pest. Dressed in white overalls, with the slogan &amp;#039;We kill more for less - foxes our speciality&amp;#039;, Mark tries to persuade the bemused huntsmen to go home and let him exterminate the foxes.","torrent":{"xt":"urn:btih:bdedf39fc79b5db7d15fb32bc3e3e6810721670c","amp;dn":"Mark+Thomas+-+Thomas+Country","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdedf39fc79b5db7d15fb32bc3e3e6810721670c","infoHashBuffer":{"type":"Buffer","data":[189,237,243,159,199,155,93,183,209,95,179,43,195,227,230,129,7,33,103,12]},"announce":[],"urlList":[]}}