{"title":"ghosts of rwanda","uid":3303677,"size":146876885,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bebd7877cd2c2bd909d333b2b62b44aa9ae352c2&amp;dn=ghosts+of+rwanda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thebum","files":9,"time":1111191162,"description":"Saved streams of semi-high-quality (320x240) wmvs from http://www.pbs.org/wgbh/pages/frontline/shows/ghosts/video/\n\n(show home page: http://www.pbs.org/wgbh/pages/frontline/shows/ghosts/)\n\nDescription/summary of videos:\n\n\n\nThe Warning\t\n\nAn informant tells Gen. Dallaire about the Hutu extremists' extermination plans. But Kofi Annan's U.N. peacekeeping office is skeptical; Annan tells Dallaire not to raid arms caches and avoid using any force.\n\nSeeing that no action is being taken by Dallaire's U.N. forces, the extremists are now confident that the U.N. won't stand in their way. On April 6th the Rwanda president's plane is shot down and the killing begins. Dallaire again requests U.N. guidance and again is told to avoid armed conflict.\n\n(12:57)\n\n\nIn the Face of Evil\t\n\nAs the slaughter intensifies, the International Red Cross mission in Rwanda does not leave, and its leader, Philippe Gaillard, soon finds himself having to confront the extremist regime.\n\nMeanwhile, a Rwandan human rights activist travels to Washington to meet with officials and ask for stronger U.S. action. But as she is there lobbying, the U.S. and the entire U.N. Security Council vote to withdraw 90% of Gen. Dallaire's forces.\n\n(10:22)\n\n\nHeroes and Bystanders\t\n\nIn this excerpt, it is four weeks into the genocide and the Red Cross has estimated that 300,000 Rwandans have already been killed. The Clinton administration leaves the handling of the crisis to an interagency working group whose hands are tied by the government's policy of non-intervention.\n\nAs the world leaves Rwanda to its fate, a young U.N. peacekeeper, Capt. Mbaye Diagne, is saving hundreds of lives, and Gen. Dallaire, the U.N. force commander, is confronting the death squad commanders.\n\n(19:07)\n\n\nEpilogue\t\n\nAs the years pass, world leaders - who did little as genocide happened on their watch - came to places like Nyarabuye on pilgrimages of contrition. Eventually, President Clinton himself comes to Rwanda.\n\n(8:34)\n\n\nA Journalist's Moral Witness\t\n\nFergal Keane is a BBC correspondent who, for over a decade, has reported from various international crises areas. In late May and early June of 1994, as the killings in Rwanda were drawing to a close -- but as pockets of Tutsis were still being hunted down -- Keane travelled for several weeks with the advancing Tutsi RPF forces. Here are excerpts from his powerful interview with FRONTLINE -- an interview which is, in essence, a testimony of moral witness. After Rwanda, he says, it is impossible for him to ever feel the same again about societies, humanity, and himself.\n\n(5:54)\n\n\nThe Man Everybody Remembers\t\n\nHe was Capt. Mbaye Diagne, a young Senegalese army officer who served as an unarmed U.N. military observer in Rwanda and whose story is part of FRONTLINE's documentary, &amp;quot;Ghosts of Rwanda.&amp;quot; In a short written profile, producer Greg Barker offers more about Diagne and his acts of heroism during the genocide. And three people who knew Diagne in Rwanda also tell their stories and anecdotes about what he was like. Finally, here on this page, FRONTLINE offers excerpts from Capt. Diagne's own home video, which he filmed over a two-week period -- from mid-May until his death on May 31, 1994 -- at a time when the killing was reaching its peak.\n\n(7:52)\n\n\nThe Last American Left\t\n\nSoon after the killing began, Carl Wilkens, an Adventist missionary, put his wife and children on a U.S. convoy out of Rwanda. But he decided to stay behind with Rwandan colleagues and workers who'd sought refuge in his home. By the night of April 10th, he was the only American left in Rwanda.\n\nThe first three weeks, the violence forced Wilkens to stay in his house and he videotaped and talked about what he was seeing and hearing. Later, he ventured out each day to help save lives by bringing supplies to orphanages and negotiating with the extremists. He remained in Rwanda throughout the genocide.\n\n(8:40)","torrent":{"xt":"urn:btih:bebd7877cd2c2bd909d333b2b62b44aa9ae352c2","amp;dn":"ghosts+of+rwanda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bebd7877cd2c2bd909d333b2b62b44aa9ae352c2","infoHashBuffer":{"type":"Buffer","data":[190,189,120,119,205,44,43,217,9,211,51,178,182,43,68,170,154,227,82,194]},"announce":[],"urlList":[]}}