{"title":"Steelers_2005_Season-Super_Bowl_XL_Champions_DVDRip-AMF","uid":3456372,"size":1468358703,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf7bad7669ffefd86cd6f8ea4f9d35d0c5463888&amp;dn=Steelers_2005_Season-Super_Bowl_XL_Champions_DVDRip-AMF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"klassiks","files":2,"time":1142139105,"description":"The Pittsburgh Steelers quest for a fifth Super Bowl title was an epic journey that took 26 years to complete. In 2004, the Steelers finished with the best record in the history of the AFC, only to lose the championship game for the fifth time in their last six tries. The loss was particularly painful for the Steeler family because many suspected it would be the final game of Jerome Bettis&amp;#039; career. But the 5th all-time leading rusher in NFL history returned in 2005, hoping for one more shot at a title. In Week 14, with the team 7-5 and the season on the line, Bettis ran for 101 yards and two touchdowns in a 21-9 victory over the NFC North champion Chicago Bears. The Steelers did not lose again. Highlighted by a &quot;heart-stopping&quot; sequence that will forever be known in Pittsburgh as the Immaculate Redemption, the Steelers improbable run to a title included wins on the road over the top three seeds in the AFC, the Cincinnati Bengals, the Indianapolis Colts and the Denver Broncos. In Super Bowl XL, played in Jerome Bettis&amp;#039; hometown of Detroit, the Steelers defeated the Seattle Seahawks and became the first sixth seed in NFL history to win it all. Own a piece of history! The most anticipated and watched sporting event of the year. Complete with highlights from the Steelers regular season, playoffs and the big game itself. The 2006 release contains over 3 full hours of action, along with the pre-game, post-game, half-time shows and tons of behind-the-scenes footage.\n\nThis is in XVID","torrent":{"xt":"urn:btih:bf7bad7669ffefd86cd6f8ea4f9d35d0c5463888","amp;dn":"Steelers_2005_Season-Super_Bowl_XL_Champions_DVDRip-AMF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7bad7669ffefd86cd6f8ea4f9d35d0c5463888","infoHashBuffer":{"type":"Buffer","data":[191,123,173,118,105,255,239,216,108,214,248,234,79,157,53,208,197,70,56,136]},"announce":[],"urlList":[]}}