{"title":"Busted","uid":3496964,"size":458229465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfed97805fda8dda9e00814ab680a4d386331e38&amp;dn=Busted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SectionEight","files":2,"time":1150876243,"description":"Statistics about police contact and arrests:\n\nIn 2000, police made 1,579,566 total arrests for drug abuse violations. 81%?or 1,279,448?of these total drug arrests were for possession. 46.5%?or 734,497 of all drug arrests?were for marijuana offenses. And of the total marijuana arrests, 646,042 (88%) were for possession alone.\nSources: Federal Bureau of Investigation, Uniform Crime Reports for the United States 2000 (Washington DC: US Government Printing Office, 2001), pp. 215-216, Tables 29 and 4.1.\n\nPrisoners sentenced for drug offenses constitute the largest group of Federal inmates (61%) in 1999, up from 53% in 1990. On September 30, 1999, Federal prisons held 63,360 sentenced drug offenders, compared to 30,470 at yearend 1990.\nOver 80% of the increase in the federal prison population from 1985 to 1995 was due to drug convictions.\nSource: Beck, Allen J., PhD, US Department of Justice, Bureau of Justice Statistics, Prisoners in 1999 (Washington, DC: US Department of Justice, August 2000), p. 12 and Table 21.\n\nNonviolent offenders accounted for eighty-four percent (84%) of the increase in state and federal prison admissions since 1980.\nSource:Ambrosio, T. &amp; Schiraldi, V., Executive Summary-February 1997 (Washington DC: The Justice Policy Institute, 1997).\n\nAn estimated 43.8 million people 16 years or older?or about 21 percent of the population that age?had at least one face-to-face contact with the police during 1999. About 52 percent of these interactions were during traffic stops (page 2).\n\n\n\nCreated by Flex Your Rights and narrated by retired ACLU director Ira Glasser, BUSTED realistically depicts the pressure and confusion of common police encounters. In an entertaining and revealing manner, BUSTED illustrates the right and wrong ways to handle different police encounters and pays special attention to demonstrating how you, the viewer, can courteously and confidently refuse police searches.\n\nDo you think a police encounter would be stressful?\nIt doesn?t have to be!\n\nLet?s suppose?\n\n\nYou are pulled over and the officer asks you if you know how fast you were going?\nHow should you respond?\n\nYou are pulled over and the officer asks to search your car?\nHow can you say no? Does refusing make you seem guilty of something?\n\nYou are being cited for a crime, and the officer tells you that he will lessen or even rip up your ticket if you answer his questions?\nWhat should you do?\n\nYou have a party that gets a bit loud, before you know it, the police are knocking at your door?.\nHow should you handle this situation?\n\n\n\nAre you a concerned citizen who simply does not want to have to go through the humiliation of a police search?\n\nBUSTED can help you!\n\nAre you an individual who uses drugs recreationally and doesn?t want to go to jail for a petty drug offense?\n\nBUSTED can help you!\n\nAre you a citizen who believes that police often overstep their bounds in the techniques they use to interrogate and prosecute individuals?\n\nBUSTED can help you!\n\n\nFor more information please visit http://www.flexyourrights.org.\n","torrent":{"xt":"urn:btih:bfed97805fda8dda9e00814ab680a4d386331e38","amp;dn":"Busted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfed97805fda8dda9e00814ab680a4d386331e38","infoHashBuffer":{"type":"Buffer","data":[191,237,151,128,95,218,141,218,158,0,129,74,182,128,164,211,134,51,30,56]},"announce":[],"urlList":[]}}