{"title":"Xbox - RLT - NHL 2K3","uid":3385917,"size":1121197293,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:c1e0a2ced5b0e5e06399ac3fe7793d96120858d6&amp;dn=Xbox+-+RLT+-+NHL+2K3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shady78","files":1,"time":1127284980,"description":"ntsc\nenglish\n100% retail\n\n\n\nlink\nhttp://www.xbox.com/en-us/nhl2k3/default.htm?level1=enusgames&amp;level2=catalog&amp;level3=nhl2k3\n\n\n\n\nMore than just familiar faces and numbers, Sega Sports NHL 2K3 delivers player realism down to size, skill, and behavior, resulting in individuals that exhibit accurate styles of play.  Grinders battle for pucks in the corners, elite players see the ice and create opportunities, and fast skaters exploit their speed. The all-new Franchise Mode lets you capitalize on player accuracy to develop a team that plays your brand of hockey. Now you can draft hotshot rookies, trade for players who compliment your team, compensate for injured players, and more. Bringing it all together is a new ESPN broadcast system where scores, highlights and more are presented in the network's famous style, poising Sega Sports NHL 2K3 in prime position for a repeat season as the leader in hockey realism.\n\n\n\nFeatures  \n \n \n\nESPN Broadcast Presentation ? True to the sports fan, player introductions, game highlights, replays, scores and more are displayed in the famous ESPN style \nAll New Franchise Mode ? Create a team and develop it into a dynasty. Play the roles of general manager, coach, scout, player, and more. \nDetailed Player Attributes ? Each player is rated in over 50 different categories, resulting in unique players that perform like their real-world counterparts. \nComplete Lines Control ? Set lines based upon your own strategy and maintain full control over how and when you cycle them. \nImproved Play Execution ? Teammates work together to set up plays and execute strategy. Defense-minded teams may choke the zones, while faster teams tend to play a more wide-open style. \nDynamic Graphics and Lighting ? Next-gen technology meticulously displays details such as glass reflections, ice texture, uniform fabric, and decals. \nXbox Live?! ? Plug your game into the action! Link your Xbox computer entertainment system to the Net and go head-to-head against gamers nationwide.\n \n \n \nGame Information  \n \n \nPublisher\nSEGA&amp;reg; \n\nDeveloper\nVisual Concepts \n\nStreet Date\nNovember 2002 \n\nPrice\n$49.99 \n\n \nRating\nEveryone\n \n \n \n \n \n \n","torrent":{"xt":"urn:btih:c1e0a2ced5b0e5e06399ac3fe7793d96120858d6","amp;dn":"Xbox+-+RLT+-+NHL+2K3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e0a2ced5b0e5e06399ac3fe7793d96120858d6","infoHashBuffer":{"type":"Buffer","data":[193,224,162,206,213,176,229,224,99,153,172,63,231,121,61,150,18,8,88,214]},"announce":[],"urlList":[]}}