{"title":"Hijacking Catastrophe","uid":3495263,"size":751899200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c285ba3c393915dd4e75753d193f8b93760a1c72&amp;dn=Hijacking+Catastrophe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"felham2006","files":6,"time":1150237142,"description":"This is the best and most carefully factual examination of the radical plans of the Bush administration that I&amp;#039;ve seen yet.  Take it from the mouths of former military and Pentagon personnel, not from Michael Moore!  But you&amp;#039;ll find that what they say is very close to his more sensible statements.\n\nThe DVD has a buttload of extras, let me know if they&amp;#039;re wanted, you can see what they are by checking the JPGs accompanying this post.\n\n-- impeachNow\n\n\nVCD compliant MPEG-1 - fits 650mb (70 min)\n\n\nSYNOPSIS:\nHijacking Catastrophe: 9/11, Fear &amp; the Selling of American Empire examines how a radical fringe of the Republican Party used the trauma of the 9/11 terror attacks to advance a pre-existing agenda to radically transform American foreign policy while rolling back civil liberties and social programs at home. \n\nThe documentary places the Bush Administration&amp;#039;s false justifications for war in Iraq within the larger context of a two-decade struggle by neoconservatives to dramatically increase military spending in the wake of the Cold War, and to expand American power globally by means of military force. \n\nAt the same time, the documentary argues that the Bush Administration has sold this radical and controversial plan for aggressive American military intervention by deliberately manipulating intelligence, political imagery, and the fears of the American people after 9/11. \n\nNarrated by Julian Bond, Hijacking Catastrophe features interviews with more than twenty prominent political observers, including Pentagon whistleblower Lt. Colonel Karen Kwiatkowski, who witnessed first-hand how the Bush Administration set up a sophisticated propaganda operation to link the anxieties generated by 9/11 to a pre-existing foreign policy agenda that included a preemptive war on Iraq.\n\nJoining Kwiatkowski in a wide-ranging, accessible, and ultimately empowering analysis are former Chief UN Weapons Inspector Scott Ritter, former Pentagon analyst Daniel Ellsberg, Nobel Peace Prize Laureate Jody Williams, Pulitzer Prize-winning author Norman Mailer, MIT professor Noam Chomsky, Code Pink founder Medea Benjamin, defense policy analyst William Hartung, author Chalmers Johnson, Army Special Forces Master Sergeant Stan Goff (Ret.). \n\nAt its core, the film places the deceptions of the Bush Administration within the larger frame of questions seldom posed in the mainstream: What, exactly, is the agenda that drove the administration&amp;#039;s pre-war deceptions? How is 9/11 being used to sell this agenda? And what are the stakes for America, Americans, and the world if this agenda succeeds in being fully implemented during a second Bush term?\n","torrent":{"xt":"urn:btih:c285ba3c393915dd4e75753d193f8b93760a1c72","amp;dn":"Hijacking+Catastrophe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c285ba3c393915dd4e75753d193f8b93760a1c72","infoHashBuffer":{"type":"Buffer","data":[194,133,186,60,57,57,21,221,78,117,117,61,25,63,139,147,118,10,28,114]},"announce":[],"urlList":[]}}