{"title":"Raw.Deal.Eng-Dutch-MultiSub","uid":3379218,"size":4653500416,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c35c158698fb6b307fa856b02bbfbb93c7e2f8c4&amp;dn=Raw.Deal.Eng-Dutch-MultiSub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kalin1102","files":18,"time":1125884142,"description":"Arnold is an ex-FBI man turned small town sheriff. He was forced to leave the FBI because he lost his temper with a suspect who molested and mutilated a\n\nlittle girl and beat the crap out of the offending villain. Because this is a big step down for him, he's having problems with his wife, who misses their old life in New York.\n\nThen Arnold is asked by an old pal to infiltrate a hot Chicago mafia ring and destroy them from the inside. Why? Because the old pal's son was killed and he wants to get even through Arnold.\n\nArnold gives up his trademark spiked hair look for the slicked back look, trades in his leather jacket for the double breasted suits, has a semi-affair with Kathryn Harold, and when Robert Davi nearly kills his old friend and then starts raising hell and even manages to settle the score with a crooked old FBI associate - the same guy who cost him his FBI job in the first place!\n\nFilm ends happily with the old friend making a complete recovery and Arnold\n\nnot only fixing his relationship with his wife but knocking her up too with their first child.\n\nArnold is fun to watch as always, but this one just doesn't measure up to\n\n&quot;Terminator&quot;, &quot;Commando&quot;, &quot;Predator&quot; or &quot;The Running Man&quot; among Arnold's\n\nother contributions to cinema. \n\nEnjoy","torrent":{"xt":"urn:btih:c35c158698fb6b307fa856b02bbfbb93c7e2f8c4","amp;dn":"Raw.Deal.Eng-Dutch-MultiSub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c35c158698fb6b307fa856b02bbfbb93c7e2f8c4","infoHashBuffer":{"type":"Buffer","data":[195,92,21,134,152,251,107,48,127,168,86,176,43,191,187,147,199,226,248,196]},"announce":[],"urlList":[]}}