{"title":"The Philosophy of Zionism and Israel","uid":3400761,"size":67328004,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:c3f3778282dd99fd5dd6adc97ff5eb9b84a07e38&amp;dn=The+Philosophy+of+Zionism+and+Israel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1130165961,"description":"Made by http://www.harunyahya.com/ .It covers the conflict between Israelis and Palestinians. It contains occasional quotes from the Qur'an, which you may find it hard to relate to, especially in light of the New Testament. But it doesn't matter. It is otherwise factual, and probably surprisingly objective to minds, that has ben worked over by mainstreammedia.\n\nIntro: &quot;Terror ... War, exile and slaughter ...\n\nFor decades now the Holy Land has been a place of blood, tears and suffering ... Yet there was a time when Palestine was a byword for peace, tolerance and justice. Members of different religions lived together as brothers and worshipped in a spirit of mutual respect and tolerance.\n\nThis time of peace went down in history as that of Muslim administrations. The region came under Islamic rule with the capture of Palestine by Caliph Umar in 637 AD. This new administration displayed great tolerance towards the Christians and Jews in the country. As a requirement of Islamic values, Muslim administrations allowed the members of different religions to live according to their own beliefs. The Ottomans captured the region in 1517 and displayed the same tolerance and justice as the previous Muslim administrations. They developed a climate of peace and freedom in the region that is still a model today. Thanks to the ?nation system,? which allowed people with different faiths to live according to their own beliefs, Christians and Jews enjoyed an environment of tolerance, security and freedom in Ottoman lands.&quot;\n\nVideo Codec: MPG1\nVideo: ? kbit/s\nRuntime: 38 min. 29 sec.\nAudio Format: 32 kbit/s\nFrame Size: 320x240","torrent":{"xt":"urn:btih:c3f3778282dd99fd5dd6adc97ff5eb9b84a07e38","amp;dn":"The+Philosophy+of+Zionism+and+Israel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f3778282dd99fd5dd6adc97ff5eb9b84a07e38","infoHashBuffer":{"type":"Buffer","data":[195,243,119,130,130,221,153,253,93,214,173,201,127,245,235,155,132,160,126,56]},"announce":[],"urlList":[]}}