{"title":"Global Governance: The Quiet War Against American Independence","uid":3416404,"size":260812510,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c45abd05acffe182ddb5ea0795046969b240c0f3&amp;dn=Global+Governance%3A+The+Quiet+War+Against+American+Independence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1133503041,"description":"In 1966, a Georgetown University professor published a big book about the elite Network which he said controls America. His book approved of their plan for global, or world, control to supersede our self-government by &quot;We the people.&quot; The professor had a profound effect on one of his students. \n\nIn 1992, that student became President of the United States and Bill Clinton credited Professor Carroll Quigley with forming his vision for the future. In the next several years, he pushed for several United Nations treaties (including some rejected by Presidents Reagan and Bush) which are designed to control human behavior, energy consumption, private property, and natural resources. The President issued a secret order (PDD 25) to place American armed forces under foreign command and in foreign uniform, and he began using U.S. troops as global cops and social workers. His Administration is steadily putting American trade and property under the control of international organizations.\n \nGlobal Governance: The Quiet War Against American Independence contains exclusive interviews with national news makers on the front lines of the quiet war. This compelling program documents the treaties and UN conferences that are undermining American independence and paving the way for global control. \n\nSenator Jesse Helms, U.S. Representative Helen Chenoweth, Ambassador Jeane Kirkpatrick, and Senator John Ashcroft join a long list of experts who form a disturbing picture of the &quot;global governance&quot; movement.\n\nGenre: Documentary \nVideo Codec: DivX 5\nVideo: 624 ~kbit/s\nRuntime: 55 Min \nAudio Format: ~64 kbit/s MP3 CBR \nAspect Ratio: 4:3 \nFrame Size: 320x224 \nFramerate: 29,970 fps\nLanguage: English","torrent":{"xt":"urn:btih:c45abd05acffe182ddb5ea0795046969b240c0f3","amp;dn":"Global+Governance%3A+The+Quiet+War+Against+American+Independence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45abd05acffe182ddb5ea0795046969b240c0f3","infoHashBuffer":{"type":"Buffer","data":[196,90,189,5,172,255,225,130,221,181,234,7,149,4,105,105,178,64,192,243]},"announce":[],"urlList":[]}}