{"title":"LA MALDICIÃ“N 2004(JU ON)","uid":3375758,"size":4696027136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c4785726677bc59cf41ff60f75f6a7a9f8d4f970&amp;dn=LA+MALDICI%C3%93N+2004%28JU+ON%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"PEITX","files":27,"time":1125226405,"description":"T&amp;iacute;tulo original: Ju-On: The Grudge\nA&amp;ntilde;o: 2003\nPa&amp;iacute;s:  Jap&amp;oacute;n\nDuraci&amp;oacute;n: 92 min\nEstreno en Espa&amp;ntilde;a: 18-02-2004\nEstreno en USA: 23-07-2004\nDirector: Takashi Shimizu\nReparto: Megumi Okina, Misaki Ito, Misa Uehara, Yui Ichikawa, Kanji Tsuda, Kayoko Shibata, Yukako Kukuri, Shuri Matsuda, Yoji Tanaka, Takashi Matsuyama, Yuya Ozeki, Takako Fuji, Chikara Ishikura, Chikako Isomura, Daisuke Honda \nProductora: Lions Gate Films / Vitagraph Films\nG&amp;eacute;nero: Terror  \n \n \nSinopsis: The Grudge: La Maldici&amp;oacute;n es una tela de ara&amp;ntilde;a en la que diversos personajes conectados entre s&amp;iacute; se ven atrapados por un fen&amp;oacute;meno sobrenatural que les conduce irremisiblemente hacia la muerte. Nishina Rika, una trabajadora social voluntaria, se ve obligada a visitar una casa ocupada tan solo por una anciana postrada en el lecho llamada Sachie. El edificio transpira una extra&amp;ntilde;a atm&amp;oacute;sfera y es evidente que la mujer vive aterrorizada, pero su enfermedad degenerativa le impide comunicarse con normalidad manteni&amp;eacute;ndola aislada en una especie de limbo. En el segundo piso, Rika descubre un armario sellado con cinta. De pronto, alguien parece rascar las paredes intentando salir. Rika retira toda la cinta y se encuentra a un peque&amp;ntilde;o magullado con un gato negro entre las manos... Echamos la vista atr&amp;aacute;s. Algunos d&amp;iacute;as antes, el hijo de Sachie, Katsuya, regresa a casa del trabajo y se encuentra a su esposa Kazumi tendida en el lecho sin sentido. Examina sus ojos en blanco pero no haya respuesta. Cuando nota una presencia detr&amp;aacute;s de &amp;eacute;l, se gira y descubre algo que le deja at&amp;oacute;nito... El d&amp;iacute;a en que Rika acude a la llamada, la hermana de Katsuya, Hitomi se ve agredida en el trabajo por un esp&amp;iacute;ritu furioso; logra librarse de &amp;eacute;l pero presencia la muerte de un guardia de seguridad que ha asistido a investigar lo que sucede. Hitomi huye a su apartamento. Alguien llama a la puerta; ella observa por la mirilla: quien permanece all&amp;iacute; derecho es su hermano. Cuando abre la puerta, no hay nadie esperando... Se descubre el cuerpo de Sachie, y con &amp;eacute;l a Rika, quien se halla en estado de shock, pero sin herida alguna. Los inspectores de polic&amp;iacute;a reparan en que hay mucha gente que ha ido desapareciendo en esta casa, y acuden a Toyama, el detective que investig&amp;oacute; el primero de esos incidentes, en el que un hombre llamado Saeki Takeo asesin&amp;oacute; a su esposa Kayako. El cuerpo del hijo del matrimonio, Toshio, de seis a&amp;ntilde;os de edad en aquel entonces, nunca fue hallado.\n  \n\n\nDatos del ripeo: \n\nFuente original: DvD 9 \n\nProgramas: DvD Remake, DvD Rebuilder + HC. \n\nAudio: Japon&amp;eacute;s y Castellano, ambos 5.1 \n\nSut&amp;iacute;tulos: Castellano \n\nAcceso directo a escenas. \n\nExtras: Ficha de los actores, doblaje y director. \n\nSe comparte en carpeta VIDEO_TS \n\nTasa internet: 3 megas / 1 mega \n\nEncendido siempre. \n\n","torrent":{"xt":"urn:btih:c4785726677bc59cf41ff60f75f6a7a9f8d4f970","amp;dn":"LA+MALDICI%C3%93N+2004%28JU+ON%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4785726677bc59cf41ff60f75f6a7a9f8d4f970","infoHashBuffer":{"type":"Buffer","data":[196,120,87,38,103,123,197,156,244,31,246,15,117,246,167,169,248,212,249,112]},"announce":[],"urlList":[]}}