{"title":"Welcome Back Kotter 01-12 California dreamin'","uid":3417389,"size":193387794,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c613bb6d9266ac5467e97d1a6fae80f7f9de6269&amp;dn=Welcome+Back+Kotter+01-12+California+dreamin%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jack flame","files":1,"time":1133731336,"description":"This is the one and only Welcome Back Kotter series with John Travolta.  Cult Favorite!  After waiting and serching the torrent sites for many months, I finally decided to buy the DVD-Rs.  I have all 95 epesides and will put them out if there is a demand for them.  I urge everyone to share (seed) these and introduce them on other sites if you wish.  My aim is to make these accessible to the world because I beleive this should be free.  enjoy!\n\nAbout quality,\nDo not expect great or even &quot;good&quot; quality.  I think these were originally recorded on VHS from TV, then tranferred to dvd.  In my opinion, quality is acceptable for anyone (like me) who loved the show.  It looks better on tv than on your computer monitor. Do not select &quot;full screen&quot; option.  Besides, this low quality adds to the ambiance like watching a 70's clasic TV show on an old tube. \nIf I see alot of interest, I will make available images of the dvds that I have so they can play in your dvd player.\nAgain this is for die hard WBK fans so try not to comment on the crappy quality.  download one or two episodes and see if it is worth it for you.  I would appreciate all other comments.\n\nRemember:  SEED PLEASE!","torrent":{"xt":"urn:btih:c613bb6d9266ac5467e97d1a6fae80f7f9de6269","amp;dn":"Welcome+Back+Kotter+01-12+California+dreamin%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c613bb6d9266ac5467e97d1a6fae80f7f9de6269","infoHashBuffer":{"type":"Buffer","data":[198,19,187,109,146,102,172,84,103,233,125,26,111,174,128,247,249,222,98,105]},"announce":[],"urlList":[]}}