{"title":"Troll - Drep De Kristne","uid":3424734,"size":81964783,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9e6e9fbd86fa4b5b3ae7983f4ca2d9f2b162f1a&amp;dn=Troll+-+Drep+De+Kristne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sagroth","files":9,"time":1135645430,"description":"Troll\n\nCheesy atmospheric black metal from the third cycle of modern metal, when it slid more toward theatrical rock. Demonman Nagash, formerly of wide-audience melodic stadium black metal band Dimmu Borgir, heads this thrashing effort.\n\nDrep de Kristne\nDamnation \t\n1996\nProduction: Clear with an emphasis on digital tones and other clarity as distorted organic sounds are swept into the background.\n\nReview: In order to achieve the epic stylings of the topic scenario presented, black metal bands often incorporate complex orchestrations of simple metal and melodic symphonic additions. While this approach affords a freedom to repetition it demands a more complex articulation of central theme, meaning inherent developing self-referential properties and a range of possibilities.\n\nTroll approach the requirements of this subgenre by developing a range of narrative probabilities within a riff, but often fall short at the essence of their creation where little but gesturing exists, and the lack of coherence often makes the &quot;epic&quot; symphonic touches more flashy cheese than dazzling aesthetic. The keyboard practices as a lead instrument, with simple phrase melodies a la Satyricon flashing over a background riff beat and melodic tremelo, building the bass for vocals and keyboards.\n\nTracklist:\n\n1. Kristenhat\n2. Naar Solen Blekner Bort\n3. Med Vold Skal Takes Kistenliv\n4. Trollberg\n5. I Saler av Sten\n6. Troll Riket\n7. Gud's Fall\n8. Drep De Kristne\nLength: 36:10\n\ntroll drep de kristne\nCopyright &amp;copy; 1996 Damnation\n\nThese melodies, while well articulated, are often what we would call goofy: self-obliviously tangential to any center, they embellish without evoking a motif. This lead to a narrativism which Troll apply brilliantly in the style of a movie soundtrack, keeping action rushing past in the texture and shifting rhythmic space of the song while allowing the keyboard to repeat its melody long enough to make it unbearably pop.\n\nLuckily the savior is that the music is not terrible, and that Uncle Nagash Blackheart knows how to put together an engaging tune with both rhythm and the melodrama of vastly visible parts colliding in the morbid play of clich&amp;eacute; deconstruction. With the relatively happy keyboards over the subdued but abrasive guitar, this makes an almost ideologically detached pursuit of the seemingly frivolous, but the sheer power of the pop in the punch keeps this album from falling dead on its face.","torrent":{"xt":"urn:btih:c9e6e9fbd86fa4b5b3ae7983f4ca2d9f2b162f1a","amp;dn":"Troll+-+Drep+De+Kristne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e6e9fbd86fa4b5b3ae7983f4ca2d9f2b162f1a","infoHashBuffer":{"type":"Buffer","data":[201,230,233,251,216,111,164,181,179,174,121,131,244,202,45,159,43,22,47,26]},"announce":[],"urlList":[]}}