{"title":"Alex Jones Radio - Gen. Janis Kapinski &amp; Scott Ritter","uid":3401277,"size":31790725,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:d09b53317d20fe584d7756a4124c052228d463c2&amp;dn=Alex+Jones+Radio+-+Gen.+Janis+Kapinski+%26+Scott+Ritter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ReVIsed","files":3,"time":1130269637,"description":"Interview with Gen. Janis Karpinski:\nThe General commanding troops in Iraq whose career was ruined in the Abu Ghraib torture scandal, Janis Karpinski, appeared on the Alex Jones Show yesterday and made some amazing revelations.\n\nArmy Reserve Brig. Gen. Janis Karpinski will be reduced to the rank of colonel as a result of an Army Inspector General investigation into a scandal that tarnished the United States' reputation abroad and set in motion a string of high-level inquiries.\n\nKarpinski was the only general punished in the abuse of detainees at Abu Ghraib prison in Iraq. Her Army Reserve unit was in charge of the prison compound when Iraqi detainees were physically abused and sexually humiliated by military police and intelligence soldiers in the fall of 2003.\n\nKarpinski had previously admitted that rather than being an isolated incident under her command, the abuses were, &quot;the result of conflicting orders and confused standards extending from the military commanders in Iraq all the way to the summit of civilian leadership in Washington.&quot;\n\nThe General described how the abuses came to pass and how she was used as the scapegoat.\n\nRead the whole story here: http://prisonplanet.com/articles/october2005/251005Karpinski.htm\n\nInterview with Scott Ritter:\nFormer United Nations weapons inspector and Marine Scott Ritter appeared on The Alex Jones Show and stated that he wouldn't rule out the possibility of the Bush administration staging a terror attack in order to jolt a wavering foreign policy agenda back on track.\n\nRitter compared the atmosphere within the administration to that during the time of Watergate, where Nixon considered utilizing America's nuclear arsenal to create a devastating diversion from domestic calamity.\n\n&quot;Nothing this administration would do would surprise me, they're desperate right now.&quot;\n\nRead the whole story here:http://www.prisonplanet.com/articles/october2005/241005weaponsinspector.htm","torrent":{"xt":"urn:btih:d09b53317d20fe584d7756a4124c052228d463c2","amp;dn":"Alex+Jones+Radio+-+Gen.+Janis+Kapinski+%26+Scott+Ritter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d09b53317d20fe584d7756a4124c052228d463c2","infoHashBuffer":{"type":"Buffer","data":[208,155,83,49,125,32,254,88,77,119,86,164,18,76,5,34,40,212,99,194]},"announce":[],"urlList":[]}}