{"title":"Richard Burmer - Mosiac (1984) - New Age @224","uid":3437678,"size":80556171,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d214b43b0e63805844dcd5e4f5fb8e391ebd8751&amp;dn=Richard+Burmer+-+Mosiac+%281984%29+-+New+Age+%40224&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blissynths","files":12,"time":1138589034,"description":"-------------------------------------------------------------------\n              Richard Burmer - Mosaic\n-------------------------------------------------------------------\n\nArtist...............: Richard Burmer\nAlbum................: Mosaic\nGenre................: New Age\nSource...............: NMR\nYear.................: 1984\nRipper...............: NMR\nCodec................: LAME 3.92\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 224kbps)\nChannels.............: Stereo / 48000 hz\nTags.................: ID3 v1.1, ID3 v2.3\nInformation..........: \n\nRipped by............: Drunken Pyscho \n\nIncluded.............: NFO\n\n\n-------------------------------------------------------------------\n                       Tracklisting\n-------------------------------------------------------------------\n\n01. (00:04:21) Richard Burmer - Physics\n02. (00:06:10) Richard Burmer - Solarsex\n03. (00:05:04) Richard Burmer - Winter On The Wind\n04. (00:02:16) Richard Burmer - Riverbend\n05. (00:06:56) Richard Burmer - The Serum\n06. (00:02:32) Richard Burmer - '88\n07. (00:04:41) Richard Burmer - Ave Pladaelio\n08. (00:04:23) Richard Burmer - The Hill\n09. (00:03:45) Richard Burmer - Under Shaded Water\n10. (00:03:14) Richard Burmer - Lamento Di Tristan\n11. (00:04:34) Richard Burmer - Ela-a (Theme No.2)\n\nPlaying Time.........: 00:47:56\nTotal Size...........: 76.82 MB\n\n\n\n\n-------------------------------------------------------------------\nPhysics\nInspired by this science. An impression of the playful interaction of the \natoms and their astounding levels of energy which exist.\n\nSolarsex\nMusic for sun bathing. A day of finding a quiet place and reclining to \nallow the sun to deliver that wonderful sensation. Closing my eyes to \nview a parade of various daydreams and opening them again to the \nrealization of an irreproachable day.\n\nWinter on the Wind\nA composition for the time of year when the trees are bare and the \ntemperature drops. Various birds begin their migration while others \nstay. The &quot;winter birds&quot; seem to cycle from the open field in my \nbackyard, to a limb of a barren tree, then to areas near the house. \nSometimes I do not see them at all. When the snow arrives and I am \nsitting comfortably by the fire, I think of those who live winter on the \nwind.\n\nRiverbend\nWhen I was young, I lived near a river named &quot;The Shiawassee&quot;. \nChildren would go there to fish, play and create adventures or \nsometimes just sit on the bank to rest. Without any bridge near by, I \nwas unable to go to the other side. Eventually, I realized there was \nonly a field with a small community airport. Still, the mystery inspired \nsome incredible dreams and this piece of music would easily be an \naccompaniment to one of those dreams.\n\nThe Serum\nThis composition is divided into three movements. The first slams into \na vertigo playground which refuses to provide an exit but suggesting \nthat &quot;The Serum&quot; may be a cure. With no other choice, it is taken. \nThis leads into the second movement. Here we find an exotic rhythm \nslowly building. Things are a little quieter now. A bell tolls and a female \nvoice forms a vortex around you which disappears as more \npercussion enters. This slams (yes, again!) into the third movement \nwhich builds only to show you there is no serum here. The final drum \nhits and you are left alone in limbo.\n\n'88\nThis is a piece which is actually a reflection of a dream I had around '\n82. I was at my parents' house for Christmas dinner. On the counter \nnear the kitchen was a greeting card addressed to me. One of those \noversize cards. I opened it to find a grade school picture of myself \nglued inside. The only thing I recall of the writing was that the words \nthat were written were alternating by each word, one in pen, the next \nin felt tip ink, some in charcoal. The message escapes me. I looked at \nthe postmark to find where this disturbing card came from. No city or \nstate was visible, but it was dated '88.\n\nAve Pladaelio\nA piece to pay homage to my early search, techniques, philosophy of \ncreating the sound I wish my music to have. &quot;Pladaelio&quot; -- a self \nconcieved word of which I know of no origin. Developed eventually into \na term &quot;Pladaelio-phonics&quot;.\n\nThe Hill\nThis composition was inspired by an area of land that my brother Bob \nand his wife Suzy own on the Leelanau Penninsula, near Traverse \nCity, Michigan. On his request to visit him, I drove to see this place he \nspoke so highly of. It was mid-summer, as I recall. At one point, Bob \nand I took a walk along with their dogs, Tupelo and Randy. Late \nafternoon was approaching, when we came to this hill. Looking \ntowards the woods in the distance, you could see a bit of Lake \nLeelanau. Winds would start to blow and Bob said to me, &quot;Sometimes \nyou can almost feel the souls of dead sailors passing by&quot;. I will never \nforget that special moment, Bob. Thanks.\n\nUnder Shaded Water\nThis piece could almost go hand-in-hand with a Maxfield Parrish \nsetting. Resting underwater in a small pond surrounded by a canopy \nof trees on a sunny day.\n\nLamento Di Tristan\nMy own interpretation of one of my favorite 14th Century pieces. The \nidea was to take the basic form and embellish it, as well as create \nsome complimentary parts to a piece that so strongly enchants me.\n\nEla-a (Theme No.2)\nA composition to sign-off with. Time to go home. I also think of \nwalking along the beaches at night in Sountern California. Ela-a (\nanother self-conceived word) is this entity which rises from the sea \njust to smile and say good-bye.\n\nCredits:\nComposed, Performed and Produced by Richard Burmer\nRecorded by Richard Burmer at Symmetrical Sound\nMixed by Richard Burmer and Darwin Foye at EFX systems, Burbank, \nCA\nMastered by Clete Baker and Doug Pennington\nSound recorders -- Omaha, NE\n*Lamento Di Tristan arranged by Richard Burmer\n\nRichard Burmer Emulator, Synthesizers, Mellotron and Chamberlain\nDebra Burmer vocals on &quot;The Serum&quot; and &quot;Ave Pladaelio&quot;\nDennis Baglama Saxophone on &quot;Solarsex&quot; and &quot;The Serum&quot;\nDon Swanson bells and cymbals on &quot;Solarsex&quot;\n\n-------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:d214b43b0e63805844dcd5e4f5fb8e391ebd8751","amp;dn":"Richard+Burmer+-+Mosiac+%281984%29+-+New+Age+%40224","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d214b43b0e63805844dcd5e4f5fb8e391ebd8751","infoHashBuffer":{"type":"Buffer","data":[210,20,180,59,14,99,128,88,68,220,213,228,245,251,142,57,30,189,135,81]},"announce":[],"urlList":[]}}