{"title":"Chris_Marker_Le_fond_de_l'air_et_rouge","uid":3373999,"size":1881050028,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d246874d80b23a6fc60d93f984773bf1f65d5db9&amp;dn=Chris_Marker_Le_fond_de_l%5C%27air_et_rouge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"auctor","files":8,"time":1124889984,"description":"http://www.imdb.com/title/tt0076042/\n\nDir : Chris Marker \n\n1977\n\n (Le Fond de l'air est rouge) is Marker's magnum opus: a 3-hour overview of the success and failure of the left during the 1960s and 70s. He brilliantly interweaves footage from the Vietnam War, May '68 in Paris, the Soviet invasion of Czechoslovakia, Fidel Castro, Che Guevara, the Shah of Iran, Regis Debray, Salvador Allende, et alia.\n\nReleased in France in 1978, restored and &quot;re-actualized&quot; by Marker fifteen years later (after the fall of the Soviet Union), First Run/Icarus Films is proud to release the film now for the first time in the United States.\n\nDescribed by Marker as &quot;scenes of the Third World War,&quot; the film is divided into two parts, each weaving together two strands:\n\nPart 1: Fragile Hands\n1. From Vietnam to Che's death\n2. May 1968 and all that.\n\nPart 2: Severed Hands\n1. From Spring in Prague to the Common Program of Government in France\n2. From Chile to - to what?\n\nDirector's Statement\n\n&quot;Scenes of the third World War 1967-1977.\n\nSome think the third World War will be set off by a nuclear missile. For me, that's the way it will end. In the meantime, the figures of an intricate game are developing, a game whose de-coding will give historians of the future - if they are still around - a very hard time. A weird game. Its rules change as the match evolves. To start with, the super powers' rivalry transforms itself not only into a Holy Alliance of the Rich against the Poor, but also into a selective co-elimination of Revolutionary Vanguards, wherever bombs would endanger sources of raw materials. As well as into the manipulation of these vanguards to pursue goals that are not their own. During the last ten years, some groups of forces (often more instinctive than organized) have been trying to play the game themselves - even if they knocked over the pieces. Wherever they tried, they failed. Nevertheless, it's been their being that has the most profoundly transformed politics in our time. This film intends to show some of the steps of this transformation.\n- Chris Marker\n\nIn girum imus nocte et consumimur igni...","torrent":{"xt":"urn:btih:d246874d80b23a6fc60d93f984773bf1f65d5db9","amp;dn":"Chris_Marker_Le_fond_de_l%5C%27air_et_rouge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d246874d80b23a6fc60d93f984773bf1f65d5db9","infoHashBuffer":{"type":"Buffer","data":[210,70,135,77,128,178,58,111,198,13,147,249,132,119,59,241,246,93,93,185]},"announce":[],"urlList":[]}}