{"title":"MI-5 Season 1 Disc 1 - DVD Rip NTSC English - All extras include","uid":3497712,"size":4688599040,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d2556f72c4bdde383063d0a6bb1f28e608a6dce4&amp;dn=MI-5+Season+1+Disc+1+-+DVD+Rip+NTSC+English+-+All+extras+include&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"jms30","files":1,"time":1151089774,"description":"MI-5 Season 1\nDVD Rip + all extras\nLanguages : English\n\nJohn Le Carre for the Internet generation, the BBC&amp;#039;s MI-5 is a smart combination of TV cop show and George Smiley-esque espionage shenanigans that pulls no punches in its depiction of an MI-5 (the British CIA) team fighting a covert war on the streets of London. This is adult, post-watershed drama clearly inspired by the hard-hitting style of shows as 24 and The Sopranos. The strong ensemble cast is led by charismatic Matthew MacFadyen as Tom Quinn, star spy of &quot;Section B,&quot; the counterterrorism branch headed by Harry Pearce (Peter Firth). Keeley Hawes, David Oyelowo, and tough-cookie Jenny Agutter make up the team. And as with its British predecessors, Cracker and Prime Suspect, MI-5 (titled Spooks originally) also delves fearlessly into the characters&amp;#039; turbulent personal lives, here given an added twist by their constant need to deceive even those they love. The six episodes of the BAFTA Award-winning first season tackle a variety of tough issues, including religious fanaticism, racism, governmental cover-ups, and, naturally enough, the lingering shadow of Irish terrorism. Throughout, the show strikes a fine balance between a James Bond-ian techno-obsession with spy gadgets and more character-based action, with crisp writing and direction that ratchets up the tension a notch further with every episode. The final cliffhanger is an unforgettable TV moment, and one that leaves viewers agog for next season.\n\n# Available Audio Tracks: English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo)\n# All 6 full-length episodes with cast and crew commentaries\n# Behind-the scenes segments for each episode including exclusive information and spoiler alerts\n# Featurettes including cast &amp; crew profiles and interviews, the look of the series, terminology, origins, deleted scenes and more","torrent":{"xt":"urn:btih:d2556f72c4bdde383063d0a6bb1f28e608a6dce4","amp;dn":"MI-5+Season+1+Disc+1+-+DVD+Rip+NTSC+English+-+All+extras+include","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2556f72c4bdde383063d0a6bb1f28e608a6dce4","infoHashBuffer":{"type":"Buffer","data":[210,85,111,114,196,189,222,56,48,99,208,166,187,31,40,230,8,166,220,228]},"announce":[],"urlList":[]}}