{"title":"Paul McCartney - In the World Tonight (1997).avi","uid":3298391,"size":733206528,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d2725d3e6895ac130a897e446bc94b1cb6931e47&amp;dn=Paul+McCartney+-+In+the+World+Tonight+%281997%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Eagles","files":1,"time":1110046316,"description":"Following fast on his work on The Beatles Anthology, Paul McCartney was inspired to make his 1997 release, Flaming Pie, a tribute in part to his days with the Fab Four, and one of the best things he'd done in 20 years. The songs are laid-back, breezy, and soulful, like Paul has remembered everything he used to be. We can thank Anthology for that, and also for this documentary on the making of Flaming Pie, a record of the making of a record. The title, Flaming Pie, Paul tells us, is from an article written by John Lennon for the local paper, The Mersey Beat, in 1961. In the story, John says he had a vision that a man came to him on a flaming pie and said, &amp;quot;From this day you are the Beatles with an A.&amp;quot; So that's that. The documentary itself is partway between a music video and a proper documentary, with Paul getting silly at times, and at other times sounding a poignant note unwittingly, such as when he sings a love song to Linda. The sound on the disc is excellent, making this a worthy addition to the library of any fan of the Beatles or McCartney. With a little help from his friends: Ringo Starr, Steve Miller, George Martin, Lenny Kravitz, Linda McCartney, and (surprise) Bill Clinton. \n\n\n01:13:26\n\n\n512 x 384","torrent":{"xt":"urn:btih:d2725d3e6895ac130a897e446bc94b1cb6931e47","amp;dn":"Paul+McCartney+-+In+the+World+Tonight+%281997%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2725d3e6895ac130a897e446bc94b1cb6931e47","infoHashBuffer":{"type":"Buffer","data":[210,114,93,62,104,149,172,19,10,137,126,68,107,201,75,28,182,147,30,71]},"announce":[],"urlList":[]}}