{"title":"Tercera Identidad DVDrip [Spanish]","uid":3385677,"size":731416576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3e01f9f43872a817e67bc260fa75d1efa7f265d&amp;dn=Tercera+Identidad+DVDrip+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Divxtotal.CoM","files":1,"time":1127238950,"description":"Direcci&amp;oacute;n: Marek Kanievska.\nPa&amp;iacute;ses: USA, Canad&amp;aacute; y Reino Unido.\nA&amp;ntilde;o: 2004.\nDuraci&amp;oacute;n: 103 min.\nG&amp;eacute;nero: Drama rom&amp;aacute;ntico, thriller.\nInterpretaci&amp;oacute;n: Sharon Stone (Sally), Rupert Everett (Leo Cauffield), Julian Wadham (Andrew Darcy), Michael Cochrane (Dick Madsen), Ann Lambton (Cynthia Cauffield), Jim Piddock (George Quennell), Richard McMillan (Angus Petherbridge), Mimi Kuzyk (Leslie Quennell), Emily VanCamp (Jen Tyler), Tamara Hope (Lucy Cauffield).\nGui&amp;oacute;n: Jim Piddock.\nProducci&amp;oacute;n: Richard Lalonde, Jan H. Vocke, Jason Piette y Michael L. Cowan.\nM&amp;uacute;sica: Normand Corbeil.\nFotograf&amp;iacute;a: Jean L&amp;eacute;pine.\nMontaje: Yvann Thibaudeau.\nDise&amp;ntilde;o de producci&amp;oacute;n: Anne Pritchard.\nDirecci&amp;oacute;n art&amp;iacute;stica: Isabelle Guay.\nEstreno en Espa&amp;ntilde;a: 17 Junio 2005. \n\n--------------------------------------------------------------------------------\n\nSINOPSIS\n\nEn 1956, la artista norteamericana Sally Tyler (Sharon Stone) vive en Beirut con su esposo, Paul (John Bourgeois), un corresponsal del New York Times. Con Paul frecuentemente au-sente ocupado en alguna labor, el matrimonio sufre una gran presi&amp;oacute;n y desamor; Sally, una mujer brillante e inteli-gente, se ve a menudo sola en una ciudad que, en aquellos d&amp;iacute;as, era un remolino cosmopolita que vibraba de actividad social. Y es bajo esas circunstancias que se cruza con el apuesto y enigm&amp;aacute;tico Leo Cauffield (Rupert Everett). &amp;Eacute;ste, en la actualidad un correspon-sal en el Oriente Medio para el London Times, hab&amp;iacute;a sido jefe de la divisi&amp;oacute;n de contraespionaje M16 de la inteligencia brit&amp;aacute;nica. Tam-bi&amp;eacute;n es un padre de familia solitario que lleva mucho tiempo alejado de su esposa y madre de sus hijos. El momento en que Sally co-noce a Leo parece detenerse en el tiempo; la mutua atracci&amp;oacute;n es extraordinaria e inmediata. Incapaz de seguir viviendo con el ator-mentador secreto de esta relaci&amp;oacute;n que cada vez va a m&amp;aacute;s, Sally acaba por confesarlo a Paul, su marido, y a&amp;ntilde;ade que debe seguir su coraz&amp;oacute;n y arriesgarse a perderlo todo. Paul no se entromete, por lo que Sally y Leo contraen matrimonio en 1959. Los pocos a&amp;ntilde;os que siguen son los m&amp;aacute;s felices en las vidas de ambos hasta que, s&amp;uacute;bitamente, en el curso de una violenta tormenta vespertina en enero de 1963, Leo desaparece sin dejar rastro. Fuera de s&amp;iacute;, an-gustiada y desesperada por saber qu&amp;eacute; le ha ocurrido a su marido, la Embajada brit&amp;aacute;nica la sorprende con la guardia baja cuando le in-forma que albergan la sospecha de una deserci&amp;oacute;n por parte de Leo, a quien suponen en la Rusia comunista. Mientras trata de juntar, desafiante, todas las piezas del misterioso rompecabezas del pa-sado, resiguiendo su apasionada relaci&amp;oacute;n con Leo y el historial de &amp;eacute;ste como uno de los esp&amp;iacute;as m&amp;aacute;s importantes del siglo XX, la infati-gable b&amp;uacute;squeda de la verdad que Sally sostiene le lleva a Londres, Nueva York, y finalmente a Mosc&amp;uacute;. En lo que deviene un emocio-nante cl&amp;iacute;max a vida o muerte, Sally acaba por enfrentarse cara a cara con el conflicto secular entre el amor y el deber mientras el Este y el Oeste colisionan en un momento irrepetible de la historia del siglo XX. Basada en una historia aut&amp;eacute;ntica, &quot;Tercera Identidad&quot; es un drama rom&amp;aacute;ntico con mucho suspense enfrentado al contex-to del espionaje propio de los tiempos de la Guerra Fr&amp;iacute;a, y se cen-tra en las situaciones extremas por las que dos personas deber&amp;aacute;n pasar en busca de su mutuo amor y convicciones.\n","torrent":{"xt":"urn:btih:d3e01f9f43872a817e67bc260fa75d1efa7f265d","amp;dn":"Tercera+Identidad+DVDrip+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3e01f9f43872a817e67bc260fa75d1efa7f265d","infoHashBuffer":{"type":"Buffer","data":[211,224,31,159,67,135,42,129,126,103,188,38,15,167,93,30,250,127,38,93]},"announce":[],"urlList":[]}}