{"title":"XBMC Xbox Media Center 1.1.0 2005-03-31 [Y]","uid":3309835,"size":32049411,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d4dbd35fca2abc0d32efa3da0ea0728168ff44ca&amp;dn=XBMC+Xbox+Media+Center+1.1.0+2005-03-31+%5BY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ythan","files":1,"time":1112318062,"description":"31-03-2005 fixed: kai, crash when removing newly added contact when &amp;quot;just signed in&amp;quot; toast message is still on screen\n31-03-2005 fixed: kai, crash when removing last contact\n31-03-2005 fixed: kai toast dialog only shows the last notification in the queue\n31-03-2005 added: New built-in command XBMC.ReloadSkin()\n31-03-2005 fixed: Several translation strings in My Weather.\n31-03-2005 added: support for MusicBrainz id's from ogg and mp3 tags\n31-03-2005 added: Initial support for SMB share username/password prompting if it's not set in XBoxMediaCenter.xml.  Thanks to BillJam for the patch.\n30-03-2005 fixed: Webserver password reset to No Pass did not reset correctly.\n30-03-2005 fixed: Srt subtitles out of sync with framerateadjuster enabled after last fix\n30-03-2005 changed: Stacking now uses Regular Expressions for finding where to stack.  They're specified in XBoxMediaCenter.xml.  Most people probably don't need to change the defaults.\n30-03-2005 changed: Sorting in Video views is a little more intelligent.  Sorts numbers separately (eg Disk 1... Disk 10) are sorted correctly).\n30-03-2005 fixed: Correctly retrieve movie title + movie writing credits from IMDb.\n29-03-2005 fixed: duplicate album entries in My Music Nav window for Various Artists albums when no artist filter is applied\n29-03-2005 fixed: Videodatabase wasn't retrieving boolean values from database correctly (ex. FrameRateAdjustment wherent being restored)\n29-03-2005 fixed: Incorrect options given to mplayer when framerateadjustement was enabled. Could have been cause of problems with autosync and subtitles.\n28-03-2005 updated: Chinese (Traditional) language file (Thnx to woozc)\n28-03-2004 updated: Polish language file (Thnx to napek)\n28-03-2005 added: user-agent to mplayer.conf, &amp;quot;MPEG&amp;quot; needed for old SHOUTcast-servers. Please leave intact.\n27-03-2005 changed: Made sure triggers submit a keypress wen released. Makes sure ff/rw resumes properly on trigger release\n27-05 2005 updated: mplayer.dll, fixes rewind jumps back to beginning when resuming playback.\n26-03-2005 changed: UseTags and FindRemoteThumbs are automatically enabled when a music scan starts, and restored when completed\n25-03-2005 fixed: tbn thumbnails on iso9660 discs\n23-03-2005 updated: Korean language file (Thnx to akoako)\n23-03-2004 updated: Polish language file (Thnx to napek)\n23-03-2005 fixed: &amp;quot;..&amp;quot; item was always hidden in DVD folders.\n22-03-2005 fixed: [ 1095213 ] Error handleing of xboxmediacenter.xml.\n22-03-2005 added: VideoPlayer.Cover infoimage to the infomanager.\n22-03-2005 fixed: Harddisk spin up when fast fowarding (or display of any control in full screen video).\n22-03-2005 fixed: The settings table in the video database needs clearing out for audio stream problems.\n21-03-2005 changed: dvd thumbs are no longer considered remote so they are cached regardless of the FindRemoteThumbs setting \n21-03-2005 fixed: correct album thumbs are displayed when multiple albums are in the same directory (be sure to enable ID3 tag reading before scanning)\n21-03-2005 changed: network.ipaddress infolabel prefixes &amp;quot;IP: &amp;quot; to the ip address.\n21-03-2005 fixed: Audio stream settings caused problems on saving video info if the audio stream was  stereo.  Plus, the stereo/left/right setting was not saved on a per-video basis.  Caused no audio on playback after the Audio options from the OSD had been accessed last time the video was played.\n21-03-2005 added: Options in settings.xml to adjust the max A/V and subs delays.\n21-03-2005 changed: Autorun priority runs: DVD-&amp;gt;(S)VCD-&amp;gt;PICTURE disc-&amp;gt;Video-&amp;gt;Music-&amp;gt;Pictures.\n21-03-2005 fixed: [ 1165273 ] Resume Play doesn't work on stacked items.\n21-03-2005 fixed: Only the first item in a stacked video appeared in the database views.\n21-03-2005 removed: Fuzzy stacking.\n21-03-2005 fixed: Slideshow on a dir with just 1 item in it would cause a crash.\n21-03-2005 fixed: Homepage buttonscroller images were deallocated and reallocated every frame.  No decent workaround available at present, so they are always allocated.\n21-03-2005 fixed: After seek or ff/rw in music, first 1/4 of a second of audio is from another part of the file.\n21-03-2005 changed: Removed autosync=30 from mplayer.conf as it shouldn't be needed with the better audiorender accuracy.\n21-03-2005 changed: Improved xbmc's audio renderers accuracy in reporting correct amount in buffers. \n20-03-2005 fixed: Htmlparser didnt account for a true ampersand (example: genre 'R&amp;amp;B' from allmusic.com was parsed as 'R')\n20-03-2005 fixed: [ 1166726 ] Playback of some AVI files is corrupted.\n19-03-2005 added: &amp;lt;keepaspectratio&amp;gt; tag to images + infoimages.  Fixes SF bug 1162592.\n19-03-2005 changed: Games bookmark defaults to F: now (so that the &amp;lt;default&amp;gt; tag works correctly)\n19-03-2005 fixed: Progress control didn't offset from the window's &amp;lt;posx&amp;gt;, &amp;lt;posy&amp;gt; coordinates.  Skins that have worked around this bug need fixing.\n19-03-2005 fixed: Subtitle size in Hardware overlays mode.\n19-03-2005 added: &amp;lt;autodetectFG&amp;gt; tag to XBoxMediaCenter.xml.  Set to false if you have an old bios that causes a crash on autodetection.\n19-03-2005 fixed: Overlays dim on screensaver activate while video is paused.\n19-03-2005 fixed: MusicPlayer and VideoPlayer labels only return something if there is the appropriate media type playing.\n18-03-2005 fixed: Play action in My Music Nav does not interfere with unpausing, or returning playback speed to 1\n18-03-2005 added: When music is paused, the play button will unpause","torrent":{"xt":"urn:btih:d4dbd35fca2abc0d32efa3da0ea0728168ff44ca","amp;dn":"XBMC+Xbox+Media+Center+1.1.0+2005-03-31+%5BY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4dbd35fca2abc0d32efa3da0ea0728168ff44ca","infoHashBuffer":{"type":"Buffer","data":[212,219,211,95,202,42,188,13,50,239,163,218,14,160,114,129,104,255,68,202]},"announce":[],"urlList":[]}}