{"title":"John Sandford - Hidden Prey (Abridged 5-CD Audiobook)","uid":3435010,"size":146451601,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d509c9757b9e8d2244c53f2b5eb6c8ac079337f6&amp;dn=John+Sandford+-+Hidden+Prey+%28Abridged+5-CD+Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mj8k03","files":62,"time":1138060628,"description":"John Sandford - Hidden Prey (Abridged 5-CD Audiobook)\n\n*******************************************************************************\n                                  Description\n*******************************************************************************\n\n\nDet. Lucas Davenport has battled some real demons over the past 15 Prey novels\nand drifted in and out of lust and love with a host of women. But now he's\nhappily married to the lovely Weather; has a nine-month-old son, Sam; and takes\ncare of his 12-year-old ward, Letty West. Sure, he's got a measure of the old\nangst, but he's growing accustomed to the good life, spending quality time alone on the couch drinking beer and watching TV golf. His new job is running \nthe Office of Regional Research at the Minnesota Bureau of Criminal Apprehension\nwhere he looks into various crimes and &quot;fixes shit&quot; for the governor. So whena\ndead Russian shows up on the docks in Duluth, Lucas is assigned to shepherd the\nlady investigator, Nadya Kalin, being sent by the Russian government. From the\nvery first pages, the reader knows it's teenager Carl Walther who has killed the\nRussian. What makes the book intriguing is the manner in which the sagacious\nDavenport goes about uncovering the rest of the co-conspirators-a gang of\nMinnesota-based Communist spies headed by Carl's grandpa, 92-year-old ex-KGB\ncolonel Burt Walther. That Sandford makes this unlikely plot believable is a\nmark of his mastery of the technical aspects of the mystery form and a testament\nto his overall writing skills. Readers will be pleased with this relaxed version\nof the moody Minneapolis investigator. In past novels, the womanizing Davenport\nwould have romanced the good-looking Russian lady, but the new Davenport is\ncontent to play the part of friend and protector and go back to his cozy family\nwith an unstained and remarkably contented soul.\n                    --Publishers Weekly","torrent":{"xt":"urn:btih:d509c9757b9e8d2244c53f2b5eb6c8ac079337f6","amp;dn":"John+Sandford+-+Hidden+Prey+%28Abridged+5-CD+Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d509c9757b9e8d2244c53f2b5eb6c8ac079337f6","infoHashBuffer":{"type":"Buffer","data":[213,9,201,117,123,158,141,34,68,197,63,43,94,182,200,172,7,147,55,246]},"announce":[],"urlList":[]}}