{"title":"Outpost Firewall v3.0.530.426 [Beta]","uid":3385565,"size":4007557,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7a77a075fd30422909c76bd2fcc394579e07b8a&amp;dn=Outpost+Firewall+v3.0.530.426+%5BBeta%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Neatofx","files":3,"time":1127175198,"description":"\nBeing online is fraught with dangers: Internet worms, spyware agents, Trojan horses, hijackers and more can wreak havoc, causing anything from slow performance to system crashes to full-blown identity theft. And to provide you with the kind of protection you need in these days of cyberthieves and online extortionists, your firewall must be able to monitor all inbound and outbound traffic and protect you from any unauthorized intrusion by rendering your PC invisible to anything that you haven?t authorized to see it.\nOutpost Firewall PRO Benefits\n\n  *\n\n    Know what's happening on your PC at all times\n    Outpost?s Network Activity Monitor watches every connection between your computer and the Internet, alerting you immediately to any communications that may be unauthorized so you can take appropriate action.\n  *\n\n    Automatic, intelligent protection against hacker attacks\n    Outpost?s Attack Detection automatically blocks network probes, zombie attacks, and other remote attempts to access your PC, using its continually-updated intrusion definitions database.\n  *\n\n    Keep your online activities private\n    Outpost?s Active Content Protection blocks potentially dangerous scripts that could hijack your browser, as well as other website components that can track your online behavior and surfing history.\n  *\n\n    Control how applications communicate\n    Outpost?s Component Control, Hidden Process Control, and Open Memory Control let you decide what applications and processes on your PC are allowed to do and what - if any- outbound connections they may make. Spyware can?t phone home from an Outpost-protected PC.\n  *\n\n    Understand the threats\n    Outpost?s Advanced Log Viewer lets you review the history of your Internet connections, including sites blocked, attacks repelled, and more than a dozen other security categories, helping you to optimize your protection.","torrent":{"xt":"urn:btih:d7a77a075fd30422909c76bd2fcc394579e07b8a","amp;dn":"Outpost+Firewall+v3.0.530.426+%5BBeta%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a77a075fd30422909c76bd2fcc394579e07b8a","infoHashBuffer":{"type":"Buffer","data":[215,167,122,7,95,211,4,34,144,156,118,189,47,204,57,69,121,224,123,138]},"announce":[],"urlList":[]}}