{"title":"Assorted bible movie torrents 2","uid":3408685,"size":308257,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d8d6a3b052522f1a406eef069bc9a58dd4f4ad8b&amp;dn=Assorted+bible+movie+torrents+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bucky katt","files":11,"time":1131848814,"description":"Assorted bible movie torrents 2\n\nThese are the torrent files for the following Bible movie DVD's\n\n\nAbraham DVD\nGospel Of John DVD 1 and 2\nJeremiah DVD\nJesus Of Nazareth DVD 1 and 2\nSolomon DVD\nThe Apocalypse (2002) DVD\n\n\n--- NEW ---\nDavid DVD\nJoshua DVD\nJacob DVD\nJoseph DVD\nMoses DVD\n\n\n\n\n\n=======================================================================\nAbraham DVD:\n\n3 hrs. 6 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\n The Old Testament story of Abraham and the trials he endures. Commanded by God to lead his family to the \n\npromised land of Canaan with the promise that if he does so, his descendants will become a great and \n\nnumerous tribe. His obedience, as well as that of his children and grandchildren, is severely tested as \n\nthey prove their faith to God.\n\n\n=======================================================================\nGospel Of John DVD 1 and 2:\n\nThis widely acclaimed motion picture is a meticulous recreation of the turbulent era of Jesus and the \n\nevents that changed the course of history! Narrated by Golden Globe nominee Christopher Plummer (Best \n\nSupporting Actor, AMERICAN TRAGEDY, 2000), it?s the bold and powerful story of Jesus as told by his \n\ndisciple John. The best-loved but least understood of the gospels, John presents a uniquely human \n\nportrait of courage and passion encompassing Jesus' entire three-year ministry, the final years of his \n\nlife. Intimate and reflective, THE GOSPEL OF JOHN offers an unparalleled opportunity to experience the \n\nincomparable life and times of Jesus Christ. \n\n=======================================================================\nJeremiah DVD:\n\nThe young Jeremiah grows up in a priest's family in the village of Anathoth, near Jerusalem. God appears \n\nto Jeremiah in different human guises on several occasions, and makes it clear to him that he has been \n\nselected to announce God's message to the people of Jerusalem: a mighty ruler from the north will attack \n\nthe Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One \n\nGod. No-one in Anathoth believes Jeremiah's prophecy, however. Instead, he is accused of blasphemy and is \n\nphysically attacked - and not even his family comes to his aid. Nevertheless, with the help of Baruch, a \n\ntemple scribe who hears Jeremiah's first sermon and becomes his disciple, Jeremiah succeeds in announcing \n\nthe word of God. The prophet's message of impending doom incurs only the wrath and rejection of the \n\nrulingclasses, the priesthood and the King. Jeremiah can find no audience, and lands up in captivity \n\nagain - but even though he even has to leave his true love for Judith to fate, he still sticks firmly to \n\nhis mission. It is only when war with the enemy forces from Babylon seems inevitable that the people of \n\nJerusalem start to grow restless, and Jeremiah gradually starts to win support. However the King, who is \n\ntaking the advice of the false prophet Hananiah, is certain that the country's powerful neighbours, the \n\nEgyptians, will come to his assistance. Shortly afterwards, however, the Babylonians lay siege to the \n\nHoly City. Although the King now believes Jeremiah, he still finds it impossible to make the decision to \n\nsurrender the city. Jerusalem goes up in flames, and the people are led off into exile in Babylon.\n\n\n=======================================================================\nJesus Of Nazareth DVD 1 and 2:\n\nimdb user rating 8.5/10 (1,408 votes)\n\n Editorial Reviews\nAmazon.com essential video\n\nOriginally made for TV in 1977, this in-depth (six hours plus) version of Jesus' life is so thorough that \n\nthe first hour is devoted solely to the story of his birth. The film doesn't skimp on some of the other \n\nlandmark events of this famous story either. Director Franco Zeffirelli gives more than 12 minutes screen \n\ntime each to the Last Supper and the Crucifixion. Passages of the Bible are quoted verbatim, the \n\nlocations have a Palestine-like authenticity, and,aside from some of the principals (Robert Powell as \n\nJesus, Olivia Hussey as Mary, and Stacy Keach as Barabbas), many of the non-Roman characters are actually \n\nplayed by Semitic-looking actors. Zeffirelli diligently provides the sociopolitical background that gave \n\nrise to Jesus' following and the crisis in belief it caused for the people of Israel (and one or two \n\nRomans). While not graphic by today's standards, some of the scenes--baby boys being ripped from their \n\nmothers' arms and slaughtered, nails being driven into Jesus' hands--may disturb young and/or sensitive \n\nchildren. --Kimberly Heinrichs\n\n\n=======================================================================\nSolomon DVD:\n\nLength:\n172 minutes\nSubtitles in English and Spanish\n\nSolomon is the tale of the king of Israel who rules his land with love, peace, and respect. When he meets \n\nthe Queen of Sheba, her beauty and charm immediately smite him, and he falls hopelessly in love. Against \n\nhis wishes and desires, she must return to her homeland, leaving the King in a state of deep depression, \n\ninevitably leading his kingdom to the verge of collapse.\n\n\n======================================================================\n\nThe Apocalypse (2002) DVD:\n\nRuntime: 97 min.\n \nAudio: English\nSubs : none\n\nmoviesunlimited.com:\n&quot;Richard Harris, in one of his last performances, stars as the Apostle John in this gripping biblical \n\ndrama. As the only living witness to Christ's crucifixion, John is visited in his Roman prison by a young \n\nChristian woman to whom he gives the written records of his visions that would become the Book of \n\nRevelation. With Vittoria Belvedere, Benjamin Sadler, Christian Kohlund.&quot;\n\n\nnetflix.com:\n &quot;Veteran actor Richard Harris portrays the apostle John, who has spent the last few years being held \n\ncaptive by the emperor of Rome. From the depths of captivity, John attempts to spread the word of the \n\nLord to anyone and everyone who expresses interest. When a young Christian woman manages to reach John, \n\nshe's given his many journals filled with past experiences, which later become the Book of Revelations.&quot;\n\n=======================================================================\nDavid DVD\n\nRuntime: 3 hrs. 10 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nAmazon Review (edited): by Alejandra Vernon\n\n This is a marvelous production, filmed in Morocco, with wonderful costumes, textiles, and rustic sets, \n\nmaking this telling of King David's life visually believable. It has some standout performances, and \n\nNathaniel Parker, always a favorite of mine, fares well as Israel's second king. As Saul, the casting of \n\nJonathan Pryce is an odd choice (Saul was &quot;a head taller than his people&quot; and there was &quot;not a man more \n\nhandsome than he&quot;) but it works, and he is exceptional as the tormented and demented king.\n\nGideon Turner is very good as the young David, Dominic Rowan is a great bit of casting as Absalom, and as \n\nJoab, Maurice Roeves is terrific. Other notables play the two prophets, Leonard Nimoy, in an appealing \n\nand powerful portrayal of Samuel, and Franco Nero as a handsome Nathan.\n\n The photography is lovely (by Raffaele Mertes) and the melodic score by Carlo Siliotto enhances the mood \n\n(the final title music is by Ennio Morricone).\n\nThe story line picks up at 1 Samuel, Chapter 9, with Saul looking for his father's mules, and proceeds \n\nthrough much of both books of Samuel, often being quite faithful to them. It is interspersed with the \n\noccasional Psalm, and writer Larry Gross has blended scripture and dialogue quite effectively. It is \n\ninteresting to watch this with Bible in hand, to see just how cleverly this has been done.\n\nThere are some moving scenes, like David's annointing, and his proposal to Abigail (played by the \n\nbeautiful Lina Sastri).  This is a way above-average film for television. There are a few gory battle \n\nscenes that would be too violent for the very young, but otherwise this is an excellent family film for \n\nolder children, with the complexity of King David making it a fascinating story for discussion and \n\nrepeated viewings. \n\n=======================================================================\nJoshua DVD\n\nRuntime: 90 min.\n\nAudio: English\nSubs : none\n\n\n The town of Auburn was always normal, to say the least. True, the people there weren't really a \n\n&quot;community&quot;, but they never noticed...until a stranger named Joshua rolled into town one morning. In \n\nsmall ways, Joshua began to help out around the town-helping a teen play guitar, helping save a marriage \n\nin danger, or teaching a bumbling priest how to speak about faith. An old Baptist church that came down \n\nin a storm is his next big project. With the help of stuttering Theo, who dreams of being a preacher, he \n\nbrings the town together to restore the old building. In this way, the whole town unites and becomes a \n\ncommunity. This attracts the attention of Father Tordone, who is a bitter man due to the fact that he \n\nlost a position in the Vatican. When the mysterious Joshua begins to show up in two places at once and \n\nmiraculously cures a blind woman, Father Tordone believes Joshua is a false prophet, trying to cheat \n\npeople. When his next huge miracle-reviving Theo from death after he falls from the roof of the newly \n\ncompleted church-overwhelms the town, Father Tordone seeks out an official condemnation from the Vatican. \n\nBut Joshua melts his icy heart, and the reformed Father becomes a Vatican member. Joshua sees the Pope \n\nhimself and reveals himself as Jesus! After his meeting, Joshua leaves-but the people of Auburn, with \n\ntheir dreams fufilled and their happiness increased.\n\n=======================================================================\n\nJacob DVD\n\nRuntime: 91 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\n\nhttp://www.imdb.com/title/tt0110175/\n\n In this inspiring tale from the biblical book of Genesis, young shepherd Jacob (Matthew Modine) falls in \n\nlove with and wants to marry pretty Rachel (Lara Flynn Boyle), the daughter of his Uncle Laban (Giancarlo \n\nGiannini). Lacking a dowry, Jacob toils seven years as his uncle's indentured servant to win Rachel's \n\nhand -- only to have the calculating Laban dupe him into another seven years of labor.\n\n=======================================================================\n\nJoseph DVD\n\nhttp://www.imdb.com/title/tt0113483/\n\nRuntime:  185 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\n  Joseph (Paul Mercurio) was cast into a pit by his jealous brothers and pled for mercy, but the brothers turned a deaf ear and sold their youngest sibling into slavery in Egypt. There, Joseph used his gift for divining dreams to become Pharaoh's most trusted aide, saving Egypt from seven years of famine. When his brothers traveled to Egypt in search of food, they ran straight into ? a forgiving Joseph! Ben Kingsley and Martin Landau co-star.\n\n=======================================================================\n\nMoses DVD\n\nhttp://www.imdb.com/title/tt0117086/\n\nRuntime:  188 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nPharaoh Ramses decrees the death of all Hebrew children, but Moses, placed in a basket in the Nile by his mother, is taken by a royal princess and raised as the brother of the heir to the throne of Egypt, Memefta. Moses is called by God to lead his people from Egypt to the promised land. A very reluctant prophet, feeling unworthy of the call, Moses accepts the task. After a series of plagues Memefta agrees to let the Hebrews go. With second thoughts, he pursues them to annihilation of his army in the parting of the Red Sea. Starvation is averted by manna from heaven, the ten commandments are given the people through Moses, they go astray with worship of the golden calf. Forty years of wandering in the wilderness, until finally they reach what will be their home (which Moses lives to see but not to enter).\n","torrent":{"xt":"urn:btih:d8d6a3b052522f1a406eef069bc9a58dd4f4ad8b","amp;dn":"Assorted+bible+movie+torrents+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d6a3b052522f1a406eef069bc9a58dd4f4ad8b","infoHashBuffer":{"type":"Buffer","data":[216,214,163,176,82,82,47,26,64,110,239,6,155,201,165,141,212,244,173,139]},"announce":[],"urlList":[]}}