{"title":"Need.For.Speed.Most.Wanted.NOS.SpeedBreaker.Cheat-ChUcKy","uid":3411802,"size":7359,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d8f3f1d0030201ec98bceed89b7001c1008fc9e4&amp;dn=Need.For.Speed.Most.Wanted.NOS.SpeedBreaker.Cheat-ChUcKy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RiP_ChUcKy","files":1,"time":1132533759,"description":"Hey hey!, my latest guide on how to get unlimited nos/speedbreaker in need for speed most wanted!, as usual, if you wont get the chance to download this textfile, ill post the entire thing right here, right now:\n\n\nHey guys!, my second cheat guide is finally here, this time we\nwill cheat our asses off by getting unlimited Nos/Speedbreaker\nin Need For Speed Most Wanted!\n\nNow its gonna be a lil hard, well, hopefully you will get the\nsame results as me, you can try this over and over if it doesnt\nwork the first time. (You might have done something wrong if it\ngives you bad results).\n\nFirst off we need Gameshock, i uploaded version 1.4 with crack\non piratebay.org. The thing is, the crack works like a time delay,\neach time your &quot;days left&quot; is low, you click on my crack and you\nwill get 30 new days, but theres still something that pisses me off,\nsince its not really cracked, its still trial version, it only lets \nyou make 5 new cheats each time its started, but we wont need all those\n5 cheats if you do this correctly, so here goes.. good luck!\n\n1. Open need for speed most wanted, go into free roam mode, and make\nsure you have FULL nos and speedbreaker. Now stand still with your car\nand press CTRL + ESC or ALT + TAB to go back to windows/desktop.\n\n2. Open GameShock, Press &quot;Find&quot; and a popup window will appear.\nChoose Speed.exe in the field where it says &quot;Process&quot;, &quot;Type&quot; should \nbe DWORD, i guess its already chosen though. Choose &quot;Unknown Value&quot; in\n&quot;Search For&quot; and then press Initialize. Wait untill its all done.\n\n3. Go back into the game, drive forward and press on NOS (just for a\nsecond or so, not too long), nos will decrease a little, now immedietly\n(before nos increases/goes up) press ctrl + esc or alt + tab to get back\nto windows/desktop.\n\n4. Since your NOS has gone down a little (decreased), you should now press\n&quot;Decrease&quot; button in GameShock, it will now search, wait untill its done.\n\n5. A little bit down on the window in gameshock it will tell you how many\nadresses/values it has found... you'l see &quot;Found:&quot; and a huge number.\n\n6. Now we need to get this huge number down, we go back into the game, use\nsome more NOS, (just a little), and then go back to gameshock again and press\non &quot;decrease&quot; button again, the number will now go down a little, but we need\nto make it go down even more... much more...\n\n7. Go back into the game, use more nos and then go back to gameshock and press\ndecrease, do this over and over untill you almost dont have any NOS left.\n\n8. Now when your low on NOS, go back into the game, drive around for a while\nuntill your NOS is almost FULL again. Now go back to gameshock and press on \n&quot;Increase&quot; instead of decrease, make sure to not click on the wrong one, or \nyou will have to start over from the beginning.\n\n9. Now we will have a few thousand numbers left. We need to decrease that number\neven more, continue with the last steps... (going into game, using nos, going back\nto gameshock and pressing on decrease. Then go into game again use nos, go back into\nGameshock and press on decrease, do this untill you dont have much NOS left, and when\nyour almost out of NOS, just drive around and fill it up, when its FULL, go to gameshock\nand press Increase instead of Decrease).\n\n10. Now do these steps over and over untill the number &quot;Found:&quot; wont go any lower, in\nmy case it stoped at 7 adresses found. So my guess is it will be the same for you.\nRemember, sometimes the number can be stuck in a higher number like 12, but just keep doing\nthe same steps over and over, it could be false alarm.\n\n11. Now when you have reached about 7 adresses, look for 3 adresses that has the exact same\n&quot;Read&quot; number, under &quot;Adress/Read&quot; (in some cases it might\njust be 2 adresses that has the same read number, but i think it will be 3). \n(Remember These will not have the same Adress though).\n\n12. Right click on one of the 3 adresses and click on &quot;New&quot;, then a new window will popup.\n\n13. Where it says &quot;Mode&quot; choose &quot;bit set&quot;, and then press OK.\n\n14. Do this with the other 2 adresses too, (the ones that had the same Read Number).\n\n15. Now Close the &quot;Find Cheat&quot; window, (its where you searched for values).\n\n16. Now in the main GameShock Window the 3 addresses will appear, press on &quot;Save&quot; at top\nof the Gameshock window and save this to a place where you will remember it, \nlike desktop or something. Name it something like &quot;Nos&quot;.\n\n17. Now keep gameshock window open, and go back into the game, try using NOS, if you\nhave succeeded, the NOS will refill itself constantly so you have unlimited NOS. \n(If it doesnt work, you did something wrong.. maybe you pressed decrease instead of\nincrease at the wrong time and stuff like that, just keep trying.\n\n18. Now close Gameshock, and open it again, A confirmation window might popup, pressing\n&quot;No&quot; or &quot;Yes&quot; doesnt matter, just press one. Then Press &quot;Open&quot; (if a window pops up, press\n&quot;OK&quot;). Now look for the file you saved earlier called &quot;NOS&quot; or whatever you named it.\n\n19. Do the exact same thing but with SpeedBreaker instead (The slowmotion time thingy).\nGo into game, stand still, (make sure you have full Speedbreaker). Go back to windows/desktop.\nPress &quot;Find&quot; in Gameshock and a new popup window will appear.\nChoose Speed.exe in the field where it says &quot;Process&quot;, &quot;Type&quot; should \nbe DWORD, i guess its already chosen though. Choose &quot;Unknown Value&quot; in\n&quot;Search For&quot; and then press Initialize. Wait untill its all done.\n\n20. Go back into the game, drive forward and press on SpeedBreaker (just for a\nsecond or so, not too long), SpeedBreaker will decrease a little, now immedietly\n(before Speedbreaker increases/goes up) press ctrl + esc or alt + tab to get back\nto windows/desktop.\n\n21. Now do the same thing as before with NOS, over and over Untill your &quot;Found&quot; number\nis down to about &quot;6&quot;.. (thats the results i got).. now find 2 adresses that have the exact\nsame &quot;Read&quot; number under &quot;Adress/Read&quot;. Yeah this time its 2 instead of 3 i guess, well\natleast for me it was. Do the same thing as before, right click on one of those 2 adresses,\npress on &quot;New&quot; and then change &quot;Mode&quot; to &quot;Bit Set&quot;, now do that with the second adress too.\n(Incase it would be 3 adresses with the same read number, do it with all 3 of them).\n\n22. Now Close the &quot;Find Cheat&quot; window.\n\n23. Now in the main GameShock Window the 2 addresses will appear, press on &quot;Save&quot; at top\nof the Gameshock window and save this to a place where you will remember it, \nlike desktop or something. Name it something like &quot;Nos And SpeedBreaker&quot;.\n\n24. Now keep gameshock window open, and go back into the game, try using SpeedBreaker, if you\nhave succeeded, the SpeedBreaker will refill itself constantly so you have unlimited SpeedBreaker. \n(If it doesnt work, you did something wrong.. maybe you pressed decrease instead of\nincrease at the wrong time and stuff like that, just keep trying.\n\n25. Now when you have succeeded with these, your done, but you have to keep Gameshock window\nopen for the cheats to work. If you stop playing and close the Gameshock window, you can\ncontinue cheating next time you start the game by starting Gameshock and pressing on &quot;Open&quot; and\nthen opening the file you saved called &quot;Nos And SpeedBreaker&quot; (If thats what you named the file).\n\nGood luck and enjoy if you succeeded!\nIf you have any problems or questions, contact me.\n\n\n\n/~ ChUcKy\n\nEmail: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;017368715e626974626a7841696e756c60686d2f626e6c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n","torrent":{"xt":"urn:btih:d8f3f1d0030201ec98bceed89b7001c1008fc9e4","amp;dn":"Need.For.Speed.Most.Wanted.NOS.SpeedBreaker.Cheat-ChUcKy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8f3f1d0030201ec98bceed89b7001c1008fc9e4","infoHashBuffer":{"type":"Buffer","data":[216,243,241,208,3,2,1,236,152,188,238,216,155,112,1,193,0,143,201,228]},"announce":[],"urlList":[]}}