{"title":"CDMenuPro Business Edition v5.00.01","uid":3391441,"size":6269154,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d921b75f35b879c535074ec5df7441f5f42b9ae5&amp;dn=CDMenuPro+Business+Edition+v5.00.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"useros","files":1,"time":1128298744,"description":"CDMenuPro is an easy-to-use CD Menu Creator for making Autorun CD Menu applications. The program comes complete with a large number of ready-to-use templates and project assistants, which make getting fast professional results child's play. CDMenuPro has been designed to create all the files necessary for autorun, to support a large number of trailers such as AVI, Intro, Sound, Splash Screen and to start your programs or documents reliably from your CD.\n\nMenu access control\nYou can now make accessing the menu dependent on a password and/or licensing agreement.\n\nArchiveSafe\nRestricting access to the menu, however, only makes sense when the data on the CD is also protected. And it is set against this background that we have developed a new program add-on: &quot;ArchiveSafe&quot;.\n\nNew viewer as an add-on program\nThe CDMenuPro software package now comes with two new Viewers:\nA RichText Viewer for presenting formatted text\nA Html Viewer for presenting Html files\nImproved Image Viewer.\n\nEmbedded Viewer\nCDMenuPro comes with two new embedded viewers:\nA RichText Viewer for presenting formatted text A Image Viewer\n\nCopyright and file information.\nIt is now possible to define the file information that is displayed in XP Windows Explorer's Tooltip window (producer, copyright, date, version)\n\nPowerPoint Starter\nThe PowerPoint Starter has been completely re-developed. A separate PowerPoint viewer can be specified for each Windows Version as an option\n\nPdf Starter\nThe Pdf Starter has been completely re-developed. A separate Pdf Reader can be specified for each Windows Version as an option\n\nEasier to use\nMenu objects can be positioned using the cursor keys.\nThe size of menu objects can be altered using the cursor keys.\nImproved cursor position display.\n\nMultiple improvements\nAn incredibly large number of small improvements have been integrated into this version, particularly with regard to making the program easier to use.\n","torrent":{"xt":"urn:btih:d921b75f35b879c535074ec5df7441f5f42b9ae5","amp;dn":"CDMenuPro+Business+Edition+v5.00.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d921b75f35b879c535074ec5df7441f5f42b9ae5","infoHashBuffer":{"type":"Buffer","data":[217,33,183,95,53,184,121,197,53,7,78,197,223,116,65,245,244,43,154,229]},"announce":[],"urlList":[]}}