{"title":"Equilibrium - PAL - Full DVD - English/German","uid":3282819,"size":6418806784,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d99f0d454c5c5d40ceeaada2f453cee705c285fc&amp;dn=Equilibrium+-+PAL+-+Full+DVD+-+English%2FGerman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Martin78","files":41,"time":1106961049,"description":"OK, because the other torrent has this &amp;quot;interesting&amp;quot; upload speed, I thought I get this for myself from the shop.\n\nUnfortunately no subs on this DVD, but Audio in German Dolby Digital and DTS, English Dolby Digital.\n\nReview:\nA broad science fiction thriller in a classic vein, Equilibrium takes a respectable stab at a Fahrenheit 451-like cautionary fable. The story finds Earth's post-World War III humankind in a state of severe emotional repression: If no one feels anything, no one will be inspired by dark passions to attack their neighbors. Writer-director Kurt Wimmer's monochromatic, Metropolis-influenced cityscape provides an excellent backdrop to the heavy-handed mission of John Preston (Christian Bale), a top cop who busts &amp;quot;sense offenders&amp;quot; and crushes sentimental, sensual, and artistic relics from a bygone era. Predictably, Preston becomes intrigued by his victims and that which they die to cherish; he stops taking his mandatory, mood-flattening drug and is even aroused by a doomed prisoner (Emily Watson). Wimmer's wrongheaded martial arts/dueling guns motif is sheer silliness (a battle over a puppy doesn't help), but Equilibrium should be seen for Bale's moving performance as a man shocked back to human feeling.","torrent":{"xt":"urn:btih:d99f0d454c5c5d40ceeaada2f453cee705c285fc","amp;dn":"Equilibrium+-+PAL+-+Full+DVD+-+English%2FGerman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99f0d454c5c5d40ceeaada2f453cee705c285fc","infoHashBuffer":{"type":"Buffer","data":[217,159,13,69,76,92,93,64,206,234,173,162,244,83,206,231,5,194,133,252]},"announce":[],"urlList":[]}}