{"title":"Lucasarts' Full Throttle - The Movie (Edited by VGMD)","uid":3373970,"size":510623284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9f0d75ebd454e8038124e5cc2f157f41e5ddf7d&amp;dn=Lucasarts%5C%27+Full+Throttle+-+The+Movie+%28Edited+by+VGMD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VGMD","files":1,"time":1124842313,"description":"Full Throttle\n-------------\n\nStarring...\n\nRoy Conrad    - Ben\nMark Hamill   - Corley Motors Vice President Adrian 'Rip' Ripburger\nKath Soucie   - Maureen Corley (Vultures) (voice)\nHamilton Camp - Corley Motors CEO Malcolm 'Old Man' X\n\n\nUsing in-game footage and some very minor tweaks, this movie tells the storyline of Ben's struggle to clear his and his biker gang's name when they are falsely accused of murder. The GUI is hidden throughout the movie, gameplay elements, cutscenes and dialogue that add little to the overall storyline have either been trimmed or completely removed.\n\nWhy did I do this? Boredom. This is a project that I worked on when I didn't have much to do, rainy Sundays and the like. I've enjoyed watching movies and have always wanted to try and participate in creating them, in any form. Unfortunately, I'm a far cry from an actor nor could I possibly write a script together to save my life. Still, I always enjoyed editing movies, so I decided to give his a whirl with an old video game. I wanted to attempt to remove the game elements as much as I could, and basically turn it into a feature length movie.\n\nHowever, I wanted to do more than simply welding the scenes from the game together and call it a movie. Sure, it's a nice subquest and all when a player has to collect all sorts of random items together to pass an obstacle, but it kinda hurts the pacing of a movie when it's just sorta dropped halfway through, isn't it? That's the sorta thing I wanted to watch out. Furthermore, I'd love to have a game which had quite a bit of additional material, so I would have a bit of a challenge by trying to pinpoint which things I should leave in the movie, and what should be left out.\n\nGoing through some of the older adventure games, I chose Full Throttle as a first project. Although the game is rather short(I finished in one night), the storyline is solid, it has entertaining characters, bloody good music supplied by The Gone Jackals, and some awesome action scenes. Furthermore, I did have quite a bit of fun with deciding what went in and what went out. Favorite scene to edit would have to the Highway Chase where I pretty much wanted to remove the part where you had to collect various items to jump over a collapsed bridge. Perhaps it's a fun scene to do when you're playing a game(frankly, I hated this part), it would hurt the pacing. Despite, perhaps, a few minor continuity problems, I am very proud of the result.\n\nIn fact, I'm very satisfied with the end result. Although it's definately more fun to play the full game, I do hope that this little movie will give you some entertainment as Ben is desperatley trying to clear his name. Hell, I'd recommend trying to get the original game, as quite a bit of the fun dialogue and scenes had to be cut. Tim Schafer and the Full Throttle crew did an examplary job.\n\nVGMD\n(E-mail adress in comments.txt)","torrent":{"xt":"urn:btih:d9f0d75ebd454e8038124e5cc2f157f41e5ddf7d","amp;dn":"Lucasarts%5C%27+Full+Throttle+-+The+Movie+%28Edited+by+VGMD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9f0d75ebd454e8038124e5cc2f157f41e5ddf7d","infoHashBuffer":{"type":"Buffer","data":[217,240,215,94,189,69,78,128,56,18,78,92,194,241,87,244,30,93,223,125]},"announce":[],"urlList":[]}}