{"title":"Denison Kimball Trio wKen Vandemark - Neutrons","uid":3310761,"size":56725071,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da215ecc49bbfa8bfe031eada295b61e0ddefff6&amp;dn=Denison+Kimball+Trio+wKen+Vandemark+-+Neutrons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bygdegaard","files":9,"time":1112482623,"description":"The Jesus Lizard's Duane Denison and Mule's Jim Kimball make another attempt at blending rock and jazz sensibilities or, to be more precise, at making them coexist successfully. Once again, they enlisted reed player Ken Vandermark in their venture. The musicians' various backgrounds show at one point or another. &amp;quot;Landshark Pt. 2&amp;quot; and &amp;quot;The Traveling Salesman&amp;quot; are built around a bassline in the Jesus Lizard canon, the former breaking at mid-point into a furious swing. The more aggressive numbers are also reminiscent of the Vandermark Quartet, in which the Chicago reed player had already cultivated his rock penchants. The playing is tight, the musicians making a point of avoiding any meandering and refusing to indulge into pointless soloing. Furthermore, &amp;quot;Monte's Casino&amp;quot; provides some real and efficient interplay between Denison and Vandermark, who is left out of the more quiet and atmospheric tracks. &amp;quot;Heavy Water&amp;quot; is an ambient piece with contained tension, multi-layered pulses, a throbbing bass, and guitar experiments. The pace and intensity subside again on the last two tracks, with the subdued explorations of &amp;quot;Issa&amp;quot; as well as the gentle and aptly-titled &amp;quot;Lullaby,&amp;quot; which features Denison's acoustic guitar work. With this album, the three musicians have created a unique hybrid that stands as one of the most successful attempts at bringing rock and jazz together.\n \n","torrent":{"xt":"urn:btih:da215ecc49bbfa8bfe031eada295b61e0ddefff6","amp;dn":"Denison+Kimball+Trio+wKen+Vandemark+-+Neutrons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da215ecc49bbfa8bfe031eada295b61e0ddefff6","infoHashBuffer":{"type":"Buffer","data":[218,33,94,204,73,187,250,139,254,3,30,173,162,149,182,30,13,222,255,246]},"announce":[],"urlList":[]}}