{"title":"DJ MENTZIK - MIXAMIX_20040327A","uid":3499271,"size":103072772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db2aefbf6df6d26f58c7a38c4a977a92e6e7dc27&amp;dn=DJ+MENTZIK+-+MIXAMIX_20040327A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mentzik","files":22,"time":1151530962,"description":"DEAR MUSIC LOVERS,\n\nThis mixed music cd is one of my MIXAMIX series.\nThis cds are made mainly as road music but some of them can be easily used for parties.\nI make this cds to accompany me and my friends at car or excursions.\n\nThe motive for making these cds was the fact that I could not find a radio station \nplaying the music I like without interuptions. So I started making my 1hour and a half music experience.\nI like various kinds of music and like to hear them intermixed. That is a risk no radio station takes and also not \nmany djs in the world. Till now only Paul Oakenfold has managed to marry many kinds and ages of music together.\n\nAnyways, hope you enjoy this mixed disks as much as I do.\nRemember that I am not professional, I do this as a hobby.\nThe date after MIXAMIX is the date I have started creating each of this cds. \nThe creation may take from just one day to many months.\n\nA few words about this DJ MENTZIK - MIXAMIX_20040327A:\nOk this time I am coming back to my purpose. This is a real driving mix. \nPrefered driving time and place: Night on a freeway (no cops around... ;) )\nStrong beats and chill moments to help you rest before pressing the gas pedal once more flat to the floor!\nLook at the tracks! Includes a rare old techno track : Konkrete - Law into Myself.Olders will recognise it\nas one of the first trancy tracks ever. Also Prodigy, Greece 2000, Van Buuren, Solid Sessions, \nStefano Secchi - Because the Night, Hybrid, Milc Inc, Safri Duo - Played Alive, DJ Infinity - Looking for Something,\nLost Witness - 7 Colours and powerfull closing with Prodigy -Skylined plus more tracks.\nEnd of this cd leaves me flying a bit above the ground while the car stereo has already gone beyond its limits...\n\n","torrent":{"xt":"urn:btih:db2aefbf6df6d26f58c7a38c4a977a92e6e7dc27","amp;dn":"DJ+MENTZIK+-+MIXAMIX_20040327A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2aefbf6df6d26f58c7a38c4a977a92e6e7dc27","infoHashBuffer":{"type":"Buffer","data":[219,42,239,191,109,246,210,111,88,199,163,140,74,151,122,146,230,231,220,39]},"announce":[],"urlList":[]}}