{"title":"Hatfield And The North - Hatfield And The North (UK Prog-Canterb","uid":3306495,"size":133671218,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db33ff272fd3e51623f1772609a31f9419a80794&amp;dn=Hatfield+And+The+North+-+Hatfield+And+The+North+%28UK+Prog-Canterb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kome","files":23,"time":1111761271,"description":"Artist: Hatfield And The North\nAlbum: Hatfield And The North\nGenre: Progressive rock - Canterbury\nYear: 1973\n\nEcoder: iTunes v4.7.1\nBitRate: 320 kbps\nVBR: OFF\nFrequency: 44100 kHz\nChannels: Stereo\nStereo Mode: Joint Stereo\nSmart Encoding Adjustments: ON\nFilter Frequencies Below 10 Hz: ON\nEncoded by kome.\n\nThe world of Canterbury prog was a pretty incestous one with groups like Caravan, Soft Machine, Gong, Delivery, Egg, Matching Mole, National Health, Khan and Gilgamesh all sharing members, and as such Hatfield And The North might seem to be &amp;quot;just another Canterbury&amp;quot; supergroup. It's a little hard to describe the two lovely mid 70s albums crafted by Richard Sinclair (lead vocals/bass), Phil Miller (guitar), Dave Stewart (keyboards) and Pip Pyle (drums) as ground-breaking because these musicians came to the band with a well-established blueprint for music-making (albeit one they had all contributed to). There is however, little doubt that they are among the most memorable recordings to emerge from the scene...\nThis fascinating debut is an hotch-potch of brief &amp;quot;sound effect&amp;quot; tracks like The Stubbs Effect, a handful of charming jazzy ditties like Going Up To People And Tinkling, Lobster In Cleavage Probe and the punchy Rifferama, and two monumental jazz-rock anthems written by drummer Pyle called Son of &amp;quot;There's No Place Like Homerton&amp;quot; and Shaving Is Boring. The album is largely instrumental although there are a fair amount of wordless vocals flying around (contributed by Sinclair, Canterbury icon Robert Wyatt as well as a trio of female singers that includes Amanda Parsons). Henry Cow's Geoff Leigh also drops in to add a few brassy touches.\nAs you might surmise from the titles of some of the tracks, Hatfield And The North aren't the sort of group to take themselves too seriously, but the standard of musicianship is extremely high with Stewart (mainly in electric piano mode) leading the way most of the time. What's more, the album is superbly paced, so that the music ebbs and flows perfectly to sustain one's interest. Psychedelic swirls, goofy humour, elegant jazz-rock, Sinclair's mournful singing (the Big Jobs songs have great melodies!) and the odd moment of controlled passionate playing are all present in acceptable doses.\n\nIf you like this album, remember to buy it.\n\nP.S: You can also download Hatfield And The North's second album here: http://trackerwww.prq.to/torrents-details.php?id=3306963","torrent":{"xt":"urn:btih:db33ff272fd3e51623f1772609a31f9419a80794","amp;dn":"Hatfield+And+The+North+-+Hatfield+And+The+North+%28UK+Prog-Canterb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db33ff272fd3e51623f1772609a31f9419a80794","infoHashBuffer":{"type":"Buffer","data":[219,51,255,39,47,211,229,22,35,241,119,38,9,163,31,148,25,168,7,148]},"announce":[],"urlList":[]}}