{"title":"PHP NUKE - Enhanced Download Module (Full)","uid":3403712,"size":948873,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc00ce2b7a00b215b9df91c60dc1a7688bd30b6f&amp;dn=PHP+NUKE+-+Enhanced+Download+Module+%28Full%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"themetalmulisha","files":1,"time":1130792292,"description":"Our Enhanced Downloads Module\n\nAll settings from the old config file, plus tons more, are now configurable through the administration area. Installation is a snap with our simple upgrade file, which means no editing of the database is required. \n\nOne major add-on is a description image, like that in the Gallery module. The description image &amp; pop up window are totally configurable, and you can now have images of themes or scripts pop up for quick viewing, without having to install a second module just for this purpose. Another great addition is the Featured Downloads. You can now set up to four Featured Downloads to be shown above the main categories on the index page. Great additions!\n\nWe cannot begin to tell you all the modifications and changes we have made. We also added a compatibility value to the download, so when added to the database it clearly states which version of nuke the download is compatible with. You have the option of designing Title images, and have them automatically show up with all the different functions throughout the module... Let no one add downloads, or just Registered users... Let no one suggest modifications, or just registered users... We've even changed the regular downloads admin, that if modifications are suggested, it will highlight in red the parts that are changed...\n\nThe list goes on and on... Take a look at the new Admin Settings that are available, or browse our Downloads Module and see for yourself.","torrent":{"xt":"urn:btih:dc00ce2b7a00b215b9df91c60dc1a7688bd30b6f","amp;dn":"PHP+NUKE+-+Enhanced+Download+Module+%28Full%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc00ce2b7a00b215b9df91c60dc1a7688bd30b6f","infoHashBuffer":{"type":"Buffer","data":[220,0,206,43,122,0,178,21,185,223,145,198,13,193,167,104,139,211,11,111]},"announce":[],"urlList":[]}}