{"title":"Johnny Cash - Half Mile a Day","uid":3434097,"size":926557884,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcb17e7b22dd3bfa22ad76aea0a60c8d681d7967&amp;dn=Johnny+Cash+-+Half+Mile+a+Day&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LailaF","files":1,"time":1137888848,"description":"Johnny Cash: Half Mile a Day (DVDRip)\n\nHalf Mile a Day takes a biographical approach to Cash's life and career, beginning with his earliest days as a sharecropper's son during the Great Depression. The film covers the high points in Cash's life (his early days at Sun Records, his ever-growing popularity through the '50, '60s, and '70s, his marriage to second wife June Carter, his television show) and the lows (the death of his older brother when Cash was only 12 and his struggles with addiction). There are also segments on his prison shows, his work with the Highwaymen, and his unusual and rewarding alliance with producer Rick Rubin. \n\nHalf Mile a Day contains plenty of other material, footage of the area where Cash grew up, a lot of archival photos, and even footage of June Carter performing as a member of the Carter Family. As with Anthology, Half Mile a Day peppers the film with commentary from Cash's associates and friends. Some of the material is repetitive, but in addition to new testimonials from the gang who populated Anthology, Half Mile a Day features many more witnesses, including Cash's Highwaymen mates Kris Kristofferson and Willie Nelson, singer Judy Collins, Sun Record's Sam Phillips, his Sun stablemates Jerry Lee Lewis and the late Carl Perkins, the Band's Levon Helm, and actor Billy Bob Thornton. Cash, too, speaks in the documentary and it's he who lends the film its title when he talks about how he's slowly working his way to heaven ? &quot;a half mile a day.&quot;","torrent":{"xt":"urn:btih:dcb17e7b22dd3bfa22ad76aea0a60c8d681d7967","amp;dn":"Johnny+Cash+-+Half+Mile+a+Day","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcb17e7b22dd3bfa22ad76aea0a60c8d681d7967","infoHashBuffer":{"type":"Buffer","data":[220,177,126,123,34,221,59,250,34,173,118,174,160,166,12,141,104,29,121,103]},"announce":[],"urlList":[]}}