{"title":"Swkotor2.The.Sith.Lords-CD1.Uk-Bwclone-Pynt","uid":3406954,"size":805745594,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de3bc94ba0bcd91d918a39aacb7ecb642609503e&amp;dn=Swkotor2.The.Sith.Lords-CD1.Uk-Bwclone-Pynt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Raan","files":6,"time":1131469324,"description":"Knights of the Old Republic II - Sith Lords - CD 01 - UK - BWClone - Pynt\n\nFor anyone wanting to play the patched version of this game without using the old crack file,\nwhich makes the patch pretty much useless since the majority of modifications is made to the .exe file.\nI found this clone on the edonkey network, so it's obviously not of my own making, and it took a hell of a long time to download.\nI wouldn't want everyone else to have to go through that, and I haven't seen this as a torrent anywhere, so I'll just put it up for you.\n\nMy upload bandwidth isn't the greatest, so it might take a little while anyway, at first,\nbut please keep your complaints to yourself, it'll speed up eventually.\n\nI know this game has been out for a long time, but I still see forum threads with people having trouble with this.\nIt seems that, for some, the game is not playable without the patch.\n\nAs stated on line 1, this is only the first CD, so if you don't already have the game you'll need to acquire the other three discs.\nAs I'm typing this, they are available on The Pirate Bay, both in a single torrent with all four discs, and separately.\n\nWhen you finally have the image, burn it with BlindWrite, or just mount it with Daemon Tools or Alcohol 120% or whatever,\nand then hide the emulation using virtual-cd-hide.exe, provided with this torrent.\nThen you should just be able to play, patch or no patch.\n\nI am in no way affiliated with the group or individual that goes by the moniker &quot;Pynt&quot;.\n/Raan\n\nTip: get the media patches, to make the game an even better experience.\nhttp://www.nzone.com/object/nzone_kotor2_downloads.html","torrent":{"xt":"urn:btih:de3bc94ba0bcd91d918a39aacb7ecb642609503e","amp;dn":"Swkotor2.The.Sith.Lords-CD1.Uk-Bwclone-Pynt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de3bc94ba0bcd91d918a39aacb7ecb642609503e","infoHashBuffer":{"type":"Buffer","data":[222,59,201,75,160,188,217,29,145,138,57,170,203,126,203,100,38,9,80,62]},"announce":[],"urlList":[]}}