{"title":"Failan.2001.DVDrip.DivX-RORiSO","uid":3459999,"size":724736667,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df4e538833e2ad17b232514e77fad4c90121e8e1&amp;dn=Failan.2001.DVDrip.DivX-RORiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"koreanmovies","files":2,"time":1142815431,"description":"After losing both her parents, Failan (Cecilia Cheung) emmigrates to Korea to seek her only remaining relatives. Once she reaches Korea, she finds out that her relatives have moved to Canada well over a year ago. Desperate to stay and make a living in Korea, Failan is forced to have an arranged marriage through a match-making agency. Kang Jae (Choi Min Shik) is an old and outdated gangster who has no respect from his peers. Short on money, Kang Jae decides to take on the arranged marriage. Having nothing more than a picture of Kang Jae, Failan spends her days dreaming and wishing that Kang Jae would come to visit her. Failan often writes to Kang Jae in sorrow about how much she misses and thinks about him, but never has the nerve to give the letters to Kang Jae. Things take a turn when Kang Jae is asked by his boss to take the fall for a murder in exchange for some money. The only hope in his worthless life is the wife he never met.\n\n\nIMDB Rating: ******** 8.0/10 (737 votes)\n\n\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.\t","torrent":{"xt":"urn:btih:df4e538833e2ad17b232514e77fad4c90121e8e1","amp;dn":"Failan.2001.DVDrip.DivX-RORiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df4e538833e2ad17b232514e77fad4c90121e8e1","infoHashBuffer":{"type":"Buffer","data":[223,78,83,136,51,226,173,23,178,50,81,78,119,250,212,201,1,33,232,225]},"announce":[],"urlList":[]}}