{"title":"Xbox - RLT - Ghost Recon Triple Pack","uid":3383779,"size":3594770567,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:df77f8c068b40b16d67b68bb09863e072e89d25d&amp;dn=Xbox+-+RLT+-+Ghost+Recon+Triple+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shady78","files":1,"time":1126841622,"description":"ntsc\nenglish\n\n\nthis pack contains 3 seperate isos\n\n1. Ghost Recon\n2. Ghost Recon 2\n3. Ghost Recon Island Thunder\n\nGHOST RECON\n\nLINK\nhttp://xbox.gamespy.com/xbox/tom-clancys-ghost-recon/\n\nTom Clancy's Ghost Recon (Xbox) \nThe Red Army is back. Now that Russia's government has collapsed, a hardline leader is bent on taking over the republics. Enter Ghost Recon, an advanced, futuristic squad of U.S. Army soldiers. Unlike previous Rainbow Six games, the setting is much more focused on the military instead of anti-terrorist maneuvers. Next-generation inventory and weapons will give players a glimpse into the real U.S. Army &quot;Land Warrior&quot; program on which Ghost Recon is based. \n\n\nGame Info\n\nDeveloper Red Storm Entertainment  \nPublisher Ubisoft  \nGenre Shooter \nRelease Date November 12, 2002  \nESRB Mature  \nGameSpy Score N/A  \nMultiplayer Up to 16 players with Xbox Live  \n\nGHOST RECON 2 \n\n\nLINK\nhttp://xbox.gamespy.com/xbox/tom-clancys-ghost-recon-2/\n\n\n\nTom Clancy's Ghost Recon 2 (Xbox) \n\n\nIn the wake of one of North Korea's worst famines, an insidious North Korean general influences the government to secretly divert humanitarian aid to beef up its army, slowly gaining power in the process. In the midst of another North Korean famine, food riots begin rocking the countryside, and the rogue North Korean general assumes complete control of the army. Blaming China for the famine, he begins charging north to seize Chinese territory with tacit support from its new Russian ally. \nChina officially agrees to a multinational force to safeguard the China-North Korean border. Unofficially, the Ghosts and other special forces go in. Their mission: cripple the North Korean threat and depose the rogue general. \n\n\n\nGame Info\n\nDeveloper Red Storm Entertainment  \nPublisher Ubisoft  \nGenre Shooter \nRelease Date November 16, 2004  \nESRB Teen for Violence  \nGameSpy Score   (Read Review)  \nExpansion Packs Tom Clancy's Ghost Recon 2 Summit Strike\n \n\nGHOST RECON ISLAND THUNDER\n\nLINK\nhttp://xbox.gamespy.com/xbox/tom-clancys-ghost-recon-island-thunder/\n\n\nTom Clancy's Ghost Recon: Island Thunder (Xbox) \nCautiously, you creep through the jungle, the hostile compound spreading out before you. Silently, you signal actions to your teams. Alpha slowly crawls downhill while Bravo sets up support. Your sniper moves to a secure location, searching for hostiles. Suddenly, tracers light up the ground in front of you. You've been spotted. Analyzing the situation, you instruct one team to flank the enemy group while the other lays down suppressive fire. After clearing the compound, you grab the package, check for wounded, and then make your way to the next objective -- ghost-like. Standalone campaign disk release (doesn't require the original Ghost Recon) featuring new single- and multiplayer maps. \n\n\nGame Info\n\nDeveloper Red Storm Entertainment  \nPublisher Ubisoft  \nGenre Shooter \nRelease Date August 5, 2003  \nESRB Mature  \n\n\n\n","torrent":{"xt":"urn:btih:df77f8c068b40b16d67b68bb09863e072e89d25d","amp;dn":"Xbox+-+RLT+-+Ghost+Recon+Triple+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df77f8c068b40b16d67b68bb09863e072e89d25d","infoHashBuffer":{"type":"Buffer","data":[223,119,248,192,104,180,11,22,214,123,104,187,9,134,62,7,46,137,210,93]},"announce":[],"urlList":[]}}