{"title":"Gehirn.unter.Drogen.-.Teil.1-5.DVBRiP.x264-ShAQ","uid":3419622,"size":1309849368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dfd017a5ddd0b171f4394502d14191efa1b9502e&amp;dn=Gehirn.unter.Drogen.-.Teil.1-5.DVBRiP.x264-ShAQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ShAQ2000","files":8,"time":1134175936,"description":"Gehirn.unter.Drogen.-.Teil.1-5.DVBRiP.x264-ShAQ\n\n1. Gl&amp;uuml;ck und Lust - Kokain und Aufputschmittel\n2. Opiate und Beruhigungsmittel - Entspannt in die Sucht\n3. Alkohol und Tabak - Der Griff zum legalen Gift\n4. Cannabis - Die Wissenschaft vor 100 Fragen\n5. Halluzinogene und Ecstasy - Angriff aufs Bewusstsein\n\nDie 5-teilige Reihe begibt sich auf eine neurologische Entdeckungsreise und analysiert die unterschiedlichen Wirkungsweisen diverser Drogen auf das menschliche Gehirn.\n\nDokumentationsreihe, Frankreich 2005, ARTE F\nSynchronfassung, Erstausstrahlung\n5-teilige Serie\n\nOb gespritzt, geraucht oder inhaliert, Drogen beeinflussen immer den hoch komplizierten Biomechanismus Gehirn. Dabei spielt es keine Rolle, ob es sich um legale, illegale oder medizinisch verordnete Drogen handelt. Neue Technologien und verfeinerte Messmethoden verhalfen der Wissenschaft in den letzten 15 Jahren zu spektakul&amp;auml;ren Erkenntnissen &amp;uuml;ber die Wirkung von Drogen auf das Gehirn. Drogen sind auch unsch&amp;auml;tzbare Hilfsmittel bei der Beobachtung der Maschine Mensch. Abgesehen von diesem Nebeneffekt liegt der Schwerpunkt der Drogenforschung in der Aufdeckung des Suchtmechanismus. Um diesem Mechanismus und seinen Ursachen auf die Spur zu kommen, arbeiten Neurobiologen, Genetiker, Psychiater, Pharmakologen und zunehmend auch Psychoanalytiker immer enger zusammen. Einig sind sich die Experten heute in der Bewertung der Sucht als Erkrankung des Gehirns.\n\n\n1. Gl&amp;uuml;ck und Lust - Kokain und Aufputschmittel\n\nDrogen verursachen Gl&amp;uuml;cksgef&amp;uuml;hle. Diese banale Tatsache wird selten erw&amp;auml;hnt und gilt nahezu als Tabu. Stimulierende Drogen wie Kokain und Amphetamine wirken auf das Gl&amp;uuml;ckszentrum im Gehirn. Das T&amp;uuml;ckische daran ist, dass unsere Instinkte und &amp;Uuml;berlebensreflexe auf diesem Gef&amp;uuml;hl beruhen und das Gehirn dazu dr&amp;auml;ngen, dem Verlangen nach der Droge nachzugeben. Dieser Mechanismus ist bei allen Drogen gleich.\n\nUntersuchungen &amp;uuml;ber die Einflussnahme von Drogen auf die Gehirnfunktion haben zum besseren Verst&amp;auml;ndnis bestimmter Krankheiten beigetragen, zum Beispiel der Aufmerksamkeitsdefizit-Hyperaktivit&amp;auml;ts-St&amp;ouml;rung (ADHS). Die auch als &quot;Zappelphilipp-Syndrom bekannte St&amp;ouml;rung wird im &amp;Uuml;brigen mit amphetamin&amp;auml;hnlichen Medikamenten behandelt. Viele psychische Erkrankungen sind auf chemische Fehlfunktionen im Gehirn zur&amp;uuml;ckzuf&amp;uuml;hren. Als Therapie sollen dann beispielsweise Antidepressiva das bei depressiven Menschen eindeutig nachzuweisende gest&amp;ouml;rte chemische Gleichgewicht im Gehirn wieder herstellen. Aber werden wir Menschen im t&amp;auml;glichen Umgang mit unseren Trieben ausschlie&amp;szlig;lich von den chemischen Prozessen im Gehirn gesteuert?\n\n\n2. Opiate und Beruhigungsmittel - Entspannt in die Sucht\n\nDer menschliche Organismus produziert k&amp;ouml;rpereigene Drogen. Einige davon unterbinden wirksam das Schmerzempfinden und sind f&amp;uuml;r den Organismus &amp;uuml;berlebenswichtig. Die starke Wirkung von Opium und seinen Derivaten - Morphium und Heroin - erkl&amp;auml;rt sich aus der Tatsache, dass diese Substanzen sich nat&amp;uuml;rliche Reaktionen des K&amp;ouml;rpers zunutze machen. Sehr komplexe Mechanismen werden in Gang gesetzt und bewirken eine Abstumpfung und Gew&amp;ouml;hnung an die Droge. Schlie&amp;szlig;lich braucht das Gehirn die Droge, um zu funktionieren: die Sucht hat sich in den Neuronen festgesetzt.\n\nAuch verschreibungspflichtige Medikamente wie Tranquilizer haben ein hohes Suchtpotenzial. Wissenschaftler arbeiten an der Erforschung dieser unerw&amp;uuml;nschten Nebenwirkung. Aber nicht nur der K&amp;ouml;rper wird s&amp;uuml;chtig. Es kommt auch zu einer unter Umst&amp;auml;nden lebenslangen psychischen Abh&amp;auml;ngigkeit. Nicht alle Menschen reagieren auf Drogen gleich. Wissenschaftler untersuchen heute, wie Schicksalsschl&amp;auml;ge sich auf den Gehirnstoffwechsel und die Erbsubstanz auswirken, und sind auf der Suche nach neuen Medikamenten, mit denen Schmerz und Leid besser zu behandeln sind.\n\n\n3. Alkohol und Tabak - Der Griff zum legalen Gift\n\nTabak und Alkohol sind die in der Welt am meisten verbreiteten Suchtmittel und die gesundheitssch&amp;auml;dlichsten dazu. Dass Tabak und Alkohol echte Drogen sind, wurde &amp;uuml;ber viele Jahre geleugnet, heute ist diese Tatsache jedoch allgemein anerkannt. Neue Techniken der Hirn-, Gen- und Suchtforschung helfen den Wissenschaftlern bei der Bewertung der au&amp;szlig;erordentlich komplexen Auswirkungen dieser Suchtstoffe auf das Gehirn. Man wei&amp;szlig; heute, dass nicht nur Nikotin s&amp;uuml;chtig macht, sondern auch etliche der &amp;uuml;ber 4.000 im Tabakrauch enthaltenen chemischen Stoffe.\n\nDie Arbeit der Forscher erweitert nicht nur unser Wissen &amp;uuml;ber die Wirkung des Tabaks, sondern bringt neben neuen Erkenntnissen &amp;uuml;ber die chemischen Prozesse im Gehirn auch neue Ans&amp;auml;tze f&amp;uuml;r die Behandlung der Alzheimer-Erkrankung. Alkohol gilt unter Wissenschaftlern als &quot;schmutzige Droge&quot;. Er entfaltet seine zerst&amp;ouml;rerische Wirkung in unterschiedlichen Hirnzentren und richtet gro&amp;szlig;en Schaden an. Wissenschaftlern ist es gelungen, mehrere Gene zu identifizieren, die einen Menschen besonders anf&amp;auml;llig f&amp;uuml;r Alkoholismus machen. Diese Erkenntnisse sollen als Grundlage f&amp;uuml;r eine gezielte Suchtpr&amp;auml;vention dienen.\n\n\n4. Cannabis - Die Wissenschaft vor 100 Fragen\n\nObwohl Cannabis die weltweit am h&amp;auml;ufigsten konsumierte illegale Droge ist, birgt sie immer noch viele Geheimnisse. Erst seit einigen Jahren wei&amp;szlig; man, welche Wirkung Cannabis auf das Gehirn hat. Das Erforschen der Wirkungsweise dieser Droge brachte der Wissenschaft wesentliche Erkenntnisse &amp;uuml;ber die Funktionsweise des Gehirns und Regulierungsmechanismen des Organismus, von denen man bis vor 15 Jahren nicht einmal wusste, dass es sie gibt.\n\nSo wie der K&amp;ouml;rper nat&amp;uuml;rliche Opiate bildet, produziert er auch eine eigene Form von Cannabis. Derzeit berichten Forscher von spektakul&amp;auml;ren Erkenntnissen &amp;uuml;ber die innere und &amp;auml;u&amp;szlig;ere Wirkung des Cannabis. Einer gr&amp;ouml;&amp;szlig;eren &amp;Ouml;ffentlichkeit sind diese Forschungsergebnisse noch wenig bekannt, doch sie werden das Bild der Droge Cannabis nachhaltig ver&amp;auml;ndern: Er&amp;ouml;ffnen sie doch v&amp;ouml;llig neue Perspektiven f&amp;uuml;r die Behandlung von Schmerzen, Fettleibigkeit, Angstzust&amp;auml;nden und Multipler Sklerose. In Wissenschaftskreisen spricht man bereits von einer biologischen Revolution.\n\n\n5. Halluzinogene und Ecstasy - Angriff aufs Bewusstsein\n\nHalluzinogene Pflanzen, die auch in religi&amp;ouml;sen und rituellen Handlungen verwendet werden, sind zweifellos die &amp;auml;ltesten Drogen der Welt. Mit der Erfindung von LSD tauchte im 20. Jahrhundert eine revolution&amp;auml;re neue Substanz auf. Sie beeinflusste ganze Generationen und schuf eine neue Kultur. Lange interessierten sich nur wenige Wissenschaftler f&amp;uuml;r bewusstseinsver&amp;auml;ndernde Substanzen, doch mit den neuen technischen M&amp;ouml;glichkeiten stieg auch das Interesse der Forscher. Millionen Jugendliche in aller Welt konsumieren heute Ecstasy und MDMA, die Nachfolger von LSD.\n\nForscher warnen vor der zerst&amp;ouml;rerischen Wirkung solcher Substanzen auf die Neuronen. Doch illegale Labors werfen immer gr&amp;ouml;&amp;szlig;ere Mengen so genannter Designerdrogen auf den Markt. In einer mit Psychopharmaka &amp;uuml;bersch&amp;uuml;tteten Gesellschaft wird der Griff zu synthetischen Drogen banal. M&amp;uuml;ssen wir bef&amp;uuml;rchten, dass der moderne Mensch von morgen nicht mehr ohne Pillen, neue Drogen, Antidepressiva, Anxiolytika und Tranquillantien leben kann, oder wird es ihm gelingen, bewusstseinsver&amp;auml;ndernde Substanzen intelligent zu nutzen?\n\n\nRipinfos\nQuelle: DVB-C\nFormat: MP4\nAudio: Advanced Audio Coding (HE-AAC)\nVideo: Advanced Video Coding (x264/h264)\nGr&amp;ouml;&amp;szlig;e: 250 MB\nZeit: jeweils ca. 45 mins","torrent":{"xt":"urn:btih:dfd017a5ddd0b171f4394502d14191efa1b9502e","amp;dn":"Gehirn.unter.Drogen.-.Teil.1-5.DVBRiP.x264-ShAQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd017a5ddd0b171f4394502d14191efa1b9502e","infoHashBuffer":{"type":"Buffer","data":[223,208,23,165,221,208,177,113,244,57,69,2,209,65,145,239,161,185,80,46]},"announce":[],"urlList":[]}}