{"title":"Panic! At The Disco- A Fever You Can't Sweat Out (2005)","uid":3411449,"size":38667983,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e01465676be9f1a3d3b98c8d74711cdcc8ff1243&amp;dn=Panic%21+At+The+Disco-+A+Fever+You+Can%5C%27t+Sweat+Out+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kornkob1995","files":17,"time":1132455555,"description":"I first saw these guys when they played with Acceptance at a show here in St. Louis and just loved them. Now they are touring with Fall Out Boy and sound alot like Fall Out Boy too. Here is a little article about them from Spin.com\n\nBy: Emily Zemler\n\nOctober 3, 2005\n\nIt's almost like Panic! at the Disco knew critics would be ready to hop on their dance punk bandwagon within a few synthy beats of their debut album. &quot;Well we're just a wet dream for the webzines,&quot; wails Brendon Urie on &quot;London Reckoned Songs About Money Written by Machines,&quot; the second track on A Fever You Can't Sweat Out. And they might be just that: Panic's uber-catchy melodies are quite literally some of the most likeable songs you will hear all year, which is hardly shocking considering that they sound like the bastard offspring of the Killers and Fall Out Boy.\n\nThe comparison to Fall Out Boy is not surprising as it was actually FOB's Pete Wentz who made Panic the first signing to his label Decaydance, an offshoot of Fueled by Ramen. But Urie's emo-tastic vocals and the severity of the group's hooks are where the comparisons stop: Panic's songs are more '80s dance party than Warped Tour fodder. Formed in the Las Vegas suburbs (so the Killers comparison is not off base either), Panic's four members -- Urie on vocals and guitar, Ryan Ross on guitar, Spencer Smith on drums, and Brent Wilson on bass -- are all still remarkably young. While they admit to starting as a blink-182 cover band, Panic has since crafted a debut of smart, prancing songs with titles that would make Minus the Bear proud: &quot;The Only Difference Between Martyrdom and Suicide Is Press Coverage&quot; and &quot;There's a Good Reason These Tables Are Numbered Honey, You Just Haven't Thought of It Yet.&quot;\n\nRather than writing all eleven songs exactly the same way, Panic split the album in two, with one half recorded using drum machines and synthesizers and other using Vaudevillian piano, strings, and accordion. That split, however, is not really noticeable unless you know to listen for it: The songs blend together into one seamless aural experience that worms its way into your head and mercilessly nests there. Between Panic's ruthless hooks and their clever, self-aware lyrics, it's pretty much impossible to argue with Urie when he sings, &quot;Swear we'll shake it up if you swear to listen.&quot; Consider this our solemn promise, boys.\n\n\n\nwww.panicatthedisco.com","torrent":{"xt":"urn:btih:e01465676be9f1a3d3b98c8d74711cdcc8ff1243","amp;dn":"Panic%21+At+The+Disco-+A+Fever+You+Can%5C%27t+Sweat+Out+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e01465676be9f1a3d3b98c8d74711cdcc8ff1243","infoHashBuffer":{"type":"Buffer","data":[224,20,101,103,107,233,241,163,211,185,140,141,116,113,28,220,200,255,18,67]},"announce":[],"urlList":[]}}