{"title":"Navigon Mobilnavigator 5 British Isles only with key.rar","uid":3443305,"size":153236101,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:e06e550ba3078198771d1ac986ea6fb0218c6ebe&amp;dn=Navigon+Mobilnavigator+5+British+Isles+only+with+key.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mooter23","files":1,"time":1139682486,"description":"146mb\nFor PocketPC via ActiveSync\nKey is included\n\nEasy &amp; Professional modes\n\nIntuitive and simplified operation for those inexperienced with technology and for experienced users:\n\n* The Easy Mode enables the technologically inexperienced to operate the navigation software simply, intuitively and with a high degree of user-friendliness. Its applications are limited to the most commonly used functions.\n\n* In Professional Mode, technically experienced users can access the MN|5 software&amp;#039;s full performance spectrum, such as the definition of a route with several reference points for example.\n\nChanging between the two operating modes is fast and uncomplicated. NAVIGON MN|5 is a navigation system that suits all needs.\n\nOption of compiling and extending country maps as needed. The CleverMap function provides the option to comfortably compile personal map data. The map data for 27 European countries, North America and the Gulf States is supplied on DVD along with the software. The map for the user&amp;#039;s home country is ready for immediate use. Should additional maps and/or user-friendly card bundles be required, they can be activated online as needed on payment of a fee\n\nFree TMC Traffic Congestion Avoidance (Traffic Message Channel). The integrated TMC function 3.0 receives up-to-the-minute traffic bulletins by radio 24 hours a day and, if there is traffic congestion, automatically provides an alternative route suggestion - free of charge. For the first time, TMC is also available for use with mobile telephones. The traffic congestion avoidance function requires a corresponding receiver, e.g. the NAVIGON TMC module.\n\nSimple, secure voice entry. The Voice Command function enables simple destination selection by voice entry from an unlimited number of saved addresses. The function can also be operated while driving and thus increases both driving security and navigation comfort.\n\nWith NAVTEQ&amp;#039;s comprehensive maps you have access to more than 2,500,000 points of interest (POIs), such as restaurants, hotels, theatres, sights, etc., and can view either those in the immediate vicinity - e.g. the next petrol station - or across a region. Whatever you are looking for, NAVIGON makes you feel at home in any city.\n\nDisplay of real signposts. For the first time, place names are provided as direction indicators which correspond to real signposts. This simplifies the navigation in complex situations, for example when changing motorways frequently.*\n\nViolations of speed limits are displayed. For the first time, SpeedInfo registers the exceeding of permitted speed limits with a visual and acoustic warning. *\n\nGo Home Function\n\nNavigate home at the touch of a button. The Go Home function allows direct navigation to a saved home address at the touch of a button.\n\nExact house number navigation on seamless continental maps\n\nAn optimization of the software&amp;#039;s performance enables the gap-free use of the entire European map or the entire North American map (USA and Canada) and thus permits international PDA navigation from door to door.","torrent":{"xt":"urn:btih:e06e550ba3078198771d1ac986ea6fb0218c6ebe","amp;dn":"Navigon+Mobilnavigator+5+British+Isles+only+with+key.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e06e550ba3078198771d1ac986ea6fb0218c6ebe","infoHashBuffer":{"type":"Buffer","data":[224,110,85,11,163,7,129,152,119,29,26,201,134,234,111,176,33,140,110,190]},"announce":[],"urlList":[]}}