{"title":"Agnitum Outpost Firewall Pro 3.0.543.5722 (431) - Final","uid":3388352,"size":4719698,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0785093b3283f948f5621dfaaccfdab3286f875&amp;dn=Agnitum+Outpost+Firewall+Pro+3.0.543.5722+%28431%29+-+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"useros","files":1,"time":1127751639,"description":"Outpost Firewall Pro, provides a superior arsenal of defense against PC infiltration by denying unauthorized access by remote hackers and protecting against data theft, denial-of-service attacks, privacy violation, Trojan horses, spyware and more. Four major criteria define Outpost Firewall Pro: security, control, privacy and ease of use.\n\n\nOutpost Firewall PRO Benefits:\n\nNEW! Protection from spyware and identity theft\nNew anti-spyware capabilities built into the program protect your computer against the rapidly increasing threats from spyware and ID theft. Spyware cannot enter, activate on, or transmit information out of computers protected by Outpost 3.0. The ID Block feature lets you determine which specific items of personal information, for example bank account numbers, are blocked from ever leaving the computer.\n\nKnow what's happening on your PC at all times\nOutpost?s Network Activity Monitor watches every connection between your computer and the Internet, alerting you immediately to any communications that may be unauthorized so you can take appropriate action.\n\nAutomatic, intelligent protection against hacker attacks\nOutpost?s Attack Detection automatically blocks network probes, zombie attacks, and other remote attempts to access your PC, using its continually-updated intrusion definitions database.\n\nControl how applications communicate\nOutpost?s Component Control, Hidden Process Control, and Open Memory Control let you decide what applications and processes on your PC are allowed to do and what - if any- outbound connections they may make. Spyware can?t phone home from an Outpost-protected PC.\n\nUnderstand the threats\nEvery time Outpost 3.0 asks you for information regarding action to be taken, the new Smart Advisor helps you to choose the best course of action by displaying context-sensitive hints and live advice. So you?ll never need to wonder whether you?ve made the right security decision, and you?ll learn something new about firewall security every time.\n\n\nOutpost Personal Firewall PRO Features:\n\nSecurity\nAttack Detection\nThe Powerful Intrusion Detection System built into the program protects from existing and future hacker attacks. The IDS module screens inbound data and determines its legitimacy either by comparing it against a set of known attack fingerprints or by performing behavior evaluation analysis.\n\nAnti-spyware defenses and privacy protection\nOutpost 3.0?s built-in AntiSpyware plug-in safeguards your computer against spyware infection and the loss of confidential information. Spyware is blocked at every possible stage ? installation, activation, transmission of information, and re-installation. No more nagging pop-ups, no browser modifications, no search and homepage hijacking, and no unauthorized leaking of data from the computer. Plus, any data you define as confidential is forever blocked from being sent anywhere.\n\nUnique network security\nOutpost 3.0?s new Ethernet protection module combats attacks on your connectivity, including: interception of outbound chat sessions, spoofing attacks designed to disable or disrupt your connections, and illegal communication initiation requests that encroach on your WiFi zone.\n\nPacket/Application Filtering\nBy implementing per-process data filtering, Outpost serves as a virtual checkpoint for incoming and outgoing application data. Based on its discretion or following the user?s instructions, it can configure how each particular application communicates over the LAN or the Internet. With application access rules, any unwanted program can easily be denied Internet access if the circumstances warrant it. Packet filtering is a lower-level filtration technique that allows the user to select which protocols, ports and remote addresses can be accessed from a user machine.\n\nSafeguarding Active Content\nOutpost?s Active Content plug-in can selectively prevent the execution, installation and propagation of a third-party scripting code running itself surreptitiously inside the Internet browser. The browser often represents a medium for spyware, viruses and worm infestations.\n\nAttachment Quarantine\nThe Attachment Quarantine protects Outpost users from potentially dangerous e-mail attachments that may contain viruses, worms and other malware and allows users to customize which types of attachments Outpost should block.\nControl\nNetwork Activity Monitoring\nMonitoring shows every connection between your machine and other computers on the Internet or LAN. It?s a handy tool to know what?s happening on a connected PC at any given time and to allow users to quickly stop unwanted Internet communications.\n\nEvents Logging\nOutpost?s Log Viewer provides the history of your computer activity in a most detailed and complete form. With this vital tool, you can browse through what?s happened on a computer in the past or pinpoint a problem early on and easily correct it.\n\nContent Management\nThe Content plug-in allows users to compile a list of entries that would be blocked from being displayed throughout visited web sites. Parents that do not want their kids exposed to inappropriate content would find great use for this feature.\nPrivacy\nSurfing Privacy Protection\nBy enabling a customizable block of cookie files and external referring, users can maintain a high level of surfing confidentiality on unknown sites and at the same time be less secretive with predefined trusted sites.\n\nEmbedded Code Protection\nBy providing advanced mechanisms of Open Process Control, Hidden Process Control and Component Control, Outpost effectively protects the host system from malicious attempts of a foreign code implanted within the system to divulge personal data or hijack an application.\n\nPorts Stealthing\nBeing visible on the network is only good when a person who sees you is authorized to do so. Outpost makes sure that the host computer is hidden from outsiders, making it unsusceptible to network probes and intruder attempts to establish rogue communication channels.\nEase of Use\nEffortless Installation\nTwo options for installation are offered to the user. Automatic installation takes care of the entire installation as well as the initial configuration phase and is most suitable for an inexperienced user. A more refined option is the Installation Wizard, which allows users to customize the process of installation and choose specific parameters.\n\nInstant, context-sensitive help\nEvery user prompt or request for the creation of a new rule in Outpost 3.0 is accompanied by an instant automatic recommendation for the best course of action. Configuring your firewall can now be error-free, making your protection so much stronger, as well as increasing your understanding of the program.\n\nAutomatic Program and LAN Access Rules\nThe program automatically configures the computer?s LAN settings and protects it from incoming Internet connections. Predefined rules for known applications are created to spare the user the need to manually create program access rules for well-known or frequently used programs.\n\nEasy Program Updates\nWhen an update to the program has been released, it is easily deployed through the program?s automatic update feature, which retrieves the latest version automatically from the vendor?s server and applies it upon user authorization.\n\n------------------KEY BEGIN------------------\n0CmjrABRhKUGClFQp0uSTN+3p9BWxQvlK0nMErEu\nbwCeI/2iynDlcX4pzGEAADO/KXAXZGMxB1Zo8RH/\nU7j2hAXwU/tW4tEMY4qkIXFwzlHnjeZ2ELr8TD3e\nakQWjjorZ0t6RT80J7d1t3VYNV9wGIxJ043US4yJ\naDkVZF9zVFY5odTHWqENNx5f48oBPdgBzZg==\n------------------KEY END--------------------\n------------------KEY BEGIN------------------\n0g7HlVhAdz8u0Wh5eFbGWC5pW0ekcH8Ot34vyCx\nKzCqHOzVPr6rED1nGWa0W4Sy/wuyey112mD0VZ\nUMFp0Ti4L2KFvAgsjodwlERO5PXZv60W7aLsFvSF\nnuPfej2MNAVYBS0pQRtFoRrwpWUSN9i sgnbcUtg\negyyFX9b4tOLGL5SPXihrGQ==\n------------------KEY END--------------------\n\n\n","torrent":{"xt":"urn:btih:e0785093b3283f948f5621dfaaccfdab3286f875","amp;dn":"Agnitum+Outpost+Firewall+Pro+3.0.543.5722+%28431%29+-+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0785093b3283f948f5621dfaaccfdab3286f875","infoHashBuffer":{"type":"Buffer","data":[224,120,80,147,179,40,63,148,143,86,33,223,170,204,253,171,50,134,248,117]},"announce":[],"urlList":[]}}