{"title":"The Resistance - Revenge On The Riverside","uid":3374816,"size":50646558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e1262b980a0fd1efa8b635d0de880012f778a9e9&amp;dn=The+Resistance+-+Revenge+On+The+Riverside&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sKuLLiNs","files":14,"time":1125012433,"description":"The Resistance is a melodic and aggressive female fronted punk band from the heart of the Canadian praries, Selkirk Manitoba. Newly signed to The Union Label Group, The Resistance will be joining bands such as Down By Law, Snuff and Belvedere on the Union 2112 roster. The new record, ?Revenge on the Riverside? will be released sometime in Spring 2005 and will be supported by a Canadian tour with labelmates Belvedere. With well crafted, sturdy, lung wrenching vocals, entrenched through clever guitar work and pounding drums, The Resistance bring their genre to an all new level; they do punk rock and deliver it well. \n\nThe new record brought The Resistance across Canada for 8 weeks in summer/fall of 2003 to promote Plague The Nation to an amazing response from fans and critics alike. The Resistance's expressive brand of music has lead them to being dubbed &quot;one of the best live bands in Canada&quot;. And with such a willing and dedicated attitude The Resistance is ready to risk it all to see where they can go and what they can accomplish.\n\nWith high hopes, young hearts and a set of strong lungs, The Resistance's brutally fast, dark and catchy female fronted old school punk rock never hits soft and their passion to play music has become their paramount commitment to get people listening. They'll do whatever it takes.","torrent":{"xt":"urn:btih:e1262b980a0fd1efa8b635d0de880012f778a9e9","amp;dn":"The+Resistance+-+Revenge+On+The+Riverside","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1262b980a0fd1efa8b635d0de880012f778a9e9","infoHashBuffer":{"type":"Buffer","data":[225,38,43,152,10,15,209,239,168,182,53,208,222,136,0,18,247,120,169,233]},"announce":[],"urlList":[]}}