{"title":"Suburbia (xvid110-sickboy88) avi","uid":3313660,"size":731848704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e13b86279da80479ef0e21af08d9d8093ecd0bc2&amp;dn=Suburbia+%28xvid110-sickboy88%29+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sickboy88","files":1,"time":1112943254,"description":"Suburbia (1984)\n\nIMDB Link:\nhttp://www.imdb.com/title/tt0086589/\n\nNo shit.  Suburbia.  The rarest of the rare. \n\nYes, this is the movie that features a VERY young &quot;Flea&quot; from &quot;The Red Hot Chili Peppers&quot; as a main character.\n\nThis is one of those movies that just about anyone who was a kid in the 80's has seen, and yet for some reason, it's almost impossible to get a copy of it these days, EVEN ON VHS.\n\nIf you are/were into the skinhead scene (anti-racist, trad, even white power) or punk scene, then you've either:\n\n1.  Seen this movie several times...\n2.  Heard ABOUT this movie, but could never find it.\n\nWhat? You've never seen a rip of this movie before? No shit you say?  \n\nThis is why:\n\nThis was the most difficult movie I've ever done.\n\nStarting off right from the dvd, even the rip was a bitch.  This is the only dvd I've ever seen that was STRUCTURE PROTECTED to this extent.  I had to insert NOP garbage data into multiple banks to make the .vobs EVEN PLAYABLE.\n\nEncoding was another story...I had to change to a harsh resizer, then to a soft RIGHT IN THE MIDDLE OF THE JOB...and even then, the resolution had to be set at the fucking alien and seldom seen aspect of 640x496 = 1.19:1\n\nEven the .ifo stream could not be followed...advertisments and FBI warnings had to be cut out...the streams were crossed and mutilated (ex: Fifth Element DVD).  I am STILL not certain if this even WAS a copy protection scheme or some MORON put together the dvd.  It was a real dvd, not a bootleg, and yet I am not certain if the mutilation of the disk was intentional or not...WHY so much trouble for such an old movie?\n\nThis was either copy protection at its worst, or the 7th fucked up version of this movie on dvd I have had.  I've tried to rip and encode this for over a year now...what finally made it possible was, believe it or not, HARDWARE.  The Plextor PX-716UF and ONLY with firmware 105..104 did not work!  How fucking insane!\n\nEven if you hate the movie...download it anyway...if for no other reason, to prove that:\n\nGiven an infinite amount of time, a chimpanzee can compose the complete works of Shakespeare.\n\n;)\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0\nBitrate: 881 kb/s AVG\nAspect: 640x496 = 1.19:1 (Weird yes, but required)\nAudio: English, 128 VBR Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:35:06\n\n-----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nhttp://www.koepi.org/XviD-1.1.0-Beta1-16012005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn on\n(Y) and (UV) deblocking, and the new feature of XviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, turn it off. I don't want another stupid motherfucker telling me that my movies are out of sync because they are totally computer illiterate.","torrent":{"xt":"urn:btih:e13b86279da80479ef0e21af08d9d8093ecd0bc2","amp;dn":"Suburbia+%28xvid110-sickboy88%29+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e13b86279da80479ef0e21af08d9d8093ecd0bc2","infoHashBuffer":{"type":"Buffer","data":[225,59,134,39,157,168,4,121,239,14,33,175,8,217,216,9,62,205,11,194]},"announce":[],"urlList":[]}}