{"title":"Claire of the Moon ( Lesbian drama) NTSC [by requst]","uid":3387673,"size":4325719806,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e156ce30802760cf51a8e22de0fece02bfff41de&amp;dn=Claire+of+the+Moon+%28+Lesbian+drama%29+NTSC+%5Bby+requst%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fredrika2","files":45,"time":1127636672,"description":"By request; here is lesbian drama Claire of the Moon. Before any one of the rest of you download it, please check with imdb if this is for you. Some of the negative commentaries are indeed correct, I think. Actors play rather stiffly, in a wooden style. The quasi-academic discussions these women have just may seem a bit ridiculous to you or at least unconvincing.\n\nObviously, though, the (private) reviewer on imdb saying that this movie [proves] that lesbians are boring is dead wrong, of course. Lesbians are neither more boring, nor more entertaining than heterosexuals. In fact, taking this movie as a proof against something like that makes it easy for you to take quite an opposite stance, since the women actors are heterosexuals in real life (the production team is lesbian, though). Consequently, heterosexual women would be the boring ones. Of course, such a notion would be wrong to no lesser extent.\n\nIn any case, the story is about a woman leading a heterosexual, life. She is good-looking but arrogant, cold or at least chilly, and annoyed and frustrated with her life in general. It is only when she discovers new and truer sides to herself that she warms up to herself and to the world at large.\n\nAccording to the promotion of this film, acclaimed director Gus van Sant (with films like the staggeringly superb film on the Columbine school massacre; 'Elephant') has said that 'Claire of the Moon went for broke, but pulled it off'. The degree as to which the film pulls its mission off to be a haunting and beautiful story about lesbian love is indeed debateable; but you may be of a totally different opinion after having watched Claire of the Moon. \n\nFull, unrated, uncompressed feature NTSC dvd\nCover included","torrent":{"xt":"urn:btih:e156ce30802760cf51a8e22de0fece02bfff41de","amp;dn":"Claire+of+the+Moon+%28+Lesbian+drama%29+NTSC+%5Bby+requst%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e156ce30802760cf51a8e22de0fece02bfff41de","infoHashBuffer":{"type":"Buffer","data":[225,86,206,48,128,39,96,207,81,168,226,45,224,254,206,2,191,255,65,222]},"announce":[],"urlList":[]}}