{"title":"Dance Department - The best beats to go [1 - 20] MP3 CORRECT!!!","uid":3437797,"size":1481413585,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e1590f9891036e479133db1cee84c776f5b6a332&amp;dn=Dance+Department+-+The+best+beats+to+go+%5B1+-+20%5D+MP3+CORRECT%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makemeangry","files":21,"time":1138631169,"description":"sorry guys, the other torrent wasted.. my fault!\n\n\nripped podcasts encoded too mp3 nice for those handy mp3 players\n\nlist:\n\nNr. 01_ with special guest Deep Dish - Dance Department - The best beats to go.mp3\nNr. 02_ with special guest Erick Morillo - Dance Department - The best beats to go.mp3\nNr. 03_ with special guest Benny Benassi - Dance Department - The best beats to go.mp3\nNr. 04_ with special guest Armin van Buuren - Dance Department - The best beats to go.mp3\nNr. 05_ with special guest David Guetta - Dance Department - The best beats to go.mp3\nNr. 06_ with special guest Sharam Jey - Dance Department - The best beats to go.mp3\nNr. 07_ with special guest Nic Fianculli - Dance Department - The best beats to go.mp3\nNr. 08_ with special guest M.A.N.D.Y. - Dance Department - The best beats to go.mp3\nNr. 09_ with special guest Axwell - Dance Department - The best beats to go.mp3\nNr. 10_ with special guest Tom Novy - Dance Department - The best beats to go.mp3\nNr. 11_ with special guest DJ T - Dance Department - The best beats to go.mp3\nNr. 12_ with special guest King Unique - Dance Department - The best beats to go.mp3\nNr. 13_ with special guest Gabriel &amp; Dresden - Dance Department - The best beats to go.mp3\nNr. 14_ with special guest Armand van Helden - Dance Department - The best beats to go.mp3\nNr. 15_ with special guest Trentemoller - Dance Department - The best beats to go.mp3\nNr. 16_ with special guest Ferry Corsten - Dance Department - The best beats to go.mp3\nNr. 17_ with special guest Kraak &amp; Smaak - Dance Department - The best beats to go.mp3\nNr. 18_ with special guest Markus Schulz - Dance Department - The best beats to go.mp3\nNr. 19_ with special guest Bob Sinclar - Dance Department - The best beats to go.mp3\nNr. 20_ A tribute to Mark Spoon - Dance Department - The best beats to go.mp3\t\t","torrent":{"xt":"urn:btih:e1590f9891036e479133db1cee84c776f5b6a332","amp;dn":"Dance+Department+-+The+best+beats+to+go+%5B1+-+20%5D+MP3+CORRECT%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1590f9891036e479133db1cee84c776f5b6a332","infoHashBuffer":{"type":"Buffer","data":[225,89,15,152,145,3,110,71,145,51,219,28,238,132,199,118,245,182,163,50]},"announce":[],"urlList":[]}}