{"title":"Trainz Railroad Simulator 2006 [5CDs][English]","uid":3382136,"size":3626978293,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1d41b263ef27458b380f2584a740a066280dc53&amp;dn=Trainz+Railroad+Simulator+2006+%5B5CDs%5D%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pctorrent","files":14,"time":1126489106,"description":"La &amp;uacute;ltima entrega de la franquicia Trainz lleva el mundo de los trenes a los ordenadores de sobremesa y pone a los jugadores en el asiento del ingeniero. Los conductores virtuales pueden dise&amp;ntilde;ar sistemas de ra&amp;iacute;les usando alrededor de 7.500 objetos de escenario y conducir m&amp;aacute;s de 150 tipos de locomotoras sobre cientos de miles de impresionantes terrenos en 3D.\n\nUna de las caracter&amp;iacute;sticas m&amp;aacute;s anticipadas de TRS2006 es Content Manager Plus. Esta nueva utilidad servir&amp;aacute; para organizar nuestro contenido personal, en forma de tramos y estaciones descargables, y aportar&amp;aacute; una flexibilidad nunca antes vista a la hora de crear nuestros propios recorridos.\n\n\n------------------------------------------------------------------------------------\n\nTrainz Railroad Simulator 2006 (TRS2006) sets new standards of realism and\n  immersion in operating a virtual railroad\n\n  TRS2006 ships with fully realized routes that include a wide range of\n  activities users can immediately enjoy. Run long haul freight services,\n  high-speed passenger runs or challenging yard operations as you service a\n  huge variety of interactive stations and industries.\n\n  TRS2006 significantly enhances the driving experience with improvements to\n  the physics engine, adding to the challenge of keeping your train performing\n  efficiently.\n\n  With thousands of items available for free on Auran's Download Station\n  including hundreds of locomotives and extra routes. TRS2006 includes a new\n  asset management utility, making it easier for users to access and organize\n  their content.\n\n  The Trainz tools and rules system have also been greatly improved to give\n  you more flexibility than ever before in creating your own railroad\n  experience. TRS2006 is the most complete railroad simulator ever developed!\n","torrent":{"xt":"urn:btih:e1d41b263ef27458b380f2584a740a066280dc53","amp;dn":"Trainz+Railroad+Simulator+2006+%5B5CDs%5D%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d41b263ef27458b380f2584a740a066280dc53","infoHashBuffer":{"type":"Buffer","data":[225,212,27,38,62,242,116,88,179,128,242,88,74,116,10,6,98,128,220,83]},"announce":[],"urlList":[]}}