{"title":"Platnum_Rock_Me_2005_by_SonarKollektiv_SK047CD_2xxkbps_VBR_mp3","uid":3387141,"size":89416200,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e217a556b18bbf6b74a605b2c28b129f973be7a2&amp;dn=Platnum_Rock_Me_2005_by_SonarKollektiv_SK047CD_2xxkbps_VBR_mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Eotaxin","files":15,"time":1127521836,"description":"Platnum_Rock_Me_2005_by_SonarKollektiv_SK047CD_2xxkbps_VBR_mp3\n\nRuth Maria Renner is a real artist. She writes and composes her own songs, does her own beat-programming, instrumentation and arrangements. By doing so she can optimize the most important ingredient of her music: her voice. But all this wouldn't be possible without some helping hands: DJ Illvibe and Monk, the producers of the popular German Hip Hop act &quot;Moabeat&quot;. The two of them help Ruth in the actual realization of the tracks as well as being the core of the band she performs with.\n\nRuth Maria Renner's album &quot;Rock Me&quot; is the first highlight in her career. A career which she soon started after she arrived in the &quot;Sweet City&quot; of Berlin, Germany in 1989. On her path as a singer/songwriter she collected a lot of experience singing in different German Reggae, R'n'B and Hip Hop bands such as &quot;Cultured Pearls&quot;. But first when she met &quot;Moabeat&quot; and started to work with them she was able to formulate her own song ideas. Furthermore she started to bring her own tunes life on stage.\n\nThe collaboration with the Berlin-based label Sonar Kollektiv started with her initial EP &quot;Platnum&quot; in April 2004 (SK024). The tracks on the EP are also featured on her LP &quot;Rock Me&quot;, besides &quot;Olympic&quot; &amp; &quot;Cocaine&quot;. Ruth isn't a friend of pigeonholing - she has a broad sound-spectrum style-wise, including Boogie &quot;She Won't Do It&quot; or &quot;Rock Me&quot;, Gospel-influences &quot;What's Your Name ?&quot;, &quot;Cocaine Pt.2&quot; or &quot;Come To My House&quot; and R'n'B &quot;Leave Me Baby&quot; or &quot;Crush On You&quot;, as well as ballads &quot;The Day&quot;, &quot;Drink My Wine&quot; or Jazz-influences like &quot;Two Stars&quot; or &quot;Greatest&quot;. As a whole the songs have a soulful feeling and like her big role models (e.g. Jill Scott) she sings honestly without pomp about life, love and pain. Her very personal lyrics paired with her own hip hop influenced production style (she sees &quot;Madlib&quot; as a major influence on her work) lead to headstrong songs, that never sounds like readymade. We are really proud of Ruth. At the age of 24 years - she managed to realize this LP with a whole lot of patience and fate.\n\nBy the way, she explains her willpower, independence and energy with her childhood, which she spent on a weather-station in the Transylvanian alps, Romania. The above mentioned gifts are also the reason for her strong performance abilities.\n\nTRACKLIST:\n\n   1. ROCK ME\n   2. SWEET CITY\n   3. LEAVE ME, BABY\n   4. CRUSH ON YOU\n   5. OBSESSION\n   6. COCAIN PART II\n   7. GET AWAY\n   8. COME TO MY HOUSE\n   9. DRINK MY WINE\n  10. GREATEST\n  11. TWO STARS\n  12. WHAT'S YOUR NAME ?\n  13. SHE WON'T DO IT\n  14. THE DAY II\n  15. THE DAY I\n\nhxxp://www.sonarkollektiv.de/releases/SK047CD/\n","torrent":{"xt":"urn:btih:e217a556b18bbf6b74a605b2c28b129f973be7a2","amp;dn":"Platnum_Rock_Me_2005_by_SonarKollektiv_SK047CD_2xxkbps_VBR_mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e217a556b18bbf6b74a605b2c28b129f973be7a2","infoHashBuffer":{"type":"Buffer","data":[226,23,165,86,177,139,191,107,116,166,5,178,194,139,18,159,151,59,231,162]},"announce":[],"urlList":[]}}