{"title":"Bobobo-bo Bo-bobo 01-33 ENGLISH DUB","uid":3497702,"size":6058090944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e227cc86824eed8d3dd27728fe7b3df33774b507&amp;dn=Bobobo-bo+Bo-bobo+01-33+ENGLISH+DUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KMeist","files":33,"time":1151086432,"description":"This is the Bobobo-bo Bo-bobo english dub. Please don&amp;#039;t complain about the fact that it&amp;#039;s a dub or your personal gripes with it. I like the english dub. Just because you don&amp;#039;t have to read a subtitle doesn&amp;#039;t make it suck. If you don&amp;#039;t like the english dub (wapanese freaks) look for another torrent.\n\nThese episodes were acquired from various sources (IRC, torrents) and all the encoder tags are still on. Numbering has been changed on some episodes because some encoders decided to list them as 101 instead of 001 (anime does _not_ have seasons!) and some spelling mistakes have been corrected. Other than that everything is the way I downloaded them.\n\n(http://www.tv.com/bobobo-bo-bo-bobo/show/34817/summary.html?full_summary=1&amp;tag=showspace_links;full_summary)\nBased on the manga by Yoshio Sawai, Bobobo-bo Bo-bobo is one of the weirdest, yet funny animes using puns, cross-dressing, and lots of visual gags.\n\nTaking place in the year 300X, an evil organization knows as the Bald Empire is planning to take over the world by stealing everyones hair. The Bald Empire, led by Emperor Baldy Bald, will have to go through Bobobo-bo Bo-bobo, who is determined to put a stop to them once and for all, if they plan to succeed. But it won&amp;#039;t be easy, because Bobobo-bo Bo-bobo was trained to &quot;hear the voices of the hair,&quot; enabling him to command his own body hair to perform various martial arts stunts to defend himself. Along the way, he will eventually need the help of all the different, yet weird friends he encounters in order to defeat the evil Bald Empire.\n\nI highly recommend this Japanese cartoon, it&amp;#039;s pretty much the funniest one ever. I even got my friend, whom hates anime, to watch it and like it. Ironically that same friend can speak Japanese. Go figure.","torrent":{"xt":"urn:btih:e227cc86824eed8d3dd27728fe7b3df33774b507","amp;dn":"Bobobo-bo+Bo-bobo+01-33+ENGLISH+DUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e227cc86824eed8d3dd27728fe7b3df33774b507","infoHashBuffer":{"type":"Buffer","data":[226,39,204,134,130,78,237,141,61,210,119,40,254,123,61,243,55,116,181,7]},"announce":[],"urlList":[]}}