{"title":"Tide - Seven Days","uid":3398729,"size":81995790,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e3469a5ad558cb1c2e27d7029111912975feb758&amp;dn=Tide+-+Seven+Days&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"[Meki]","files":1,"time":1129727654,"description":"Tide is a new band on the block although most of the guys have been around for a while. To be more precise, since the early 90's. \n\nKevin Koradin was the lead guitarist and songwriter for a band called ''Revolver'' where together with bass player Matej Bateli?- Giovanni they've been forging heavy sounds for more than half decade. Peter Kokotec was playing in a punk band called ''Valter brani Sarajevo''. \n\nIn 1998 Kevin left Slovenia for Amsterdam / Holland to work as a studio musician and gain new experiences. In Holland he met Mikkel Brink, a hot shot danish drummer with whom he's recorded several demos alongside Japanese bass player Kenji Hino.\nLater that year Kevin made a trip to Copenhagen to meet up with Mikkel who just got back from a tour in Japan. For a week they talked about forming a band while spending long nights drinking beer. In need of a bass player they brought in Giovanni from Slovenia and joined forces in what sounded like an explosive rock trio.\nThis was the beginning of tide. \n\nThe guys recorded several demos and then left for the USA to play some gigs. Throughout the summer they endured the heat in South Florida during hurricane season. After a short trip to New York city they headed back to Amsterdam to start recording what was going to become their first record.\n\nOnce the record was finished Mikkel got homesick and returned to Denmark for good. In the fall of 2004 Kevin came home to Slovenia to visit his parents and in the process bumped into and old acquaintance of his, Peter Kokotec. This wasn't going to be the usual vacation. \n\nPeter was also looking for a band. After hearing the songs Kevin and Giovanni recorded in Amsterdam, he was ''in'', ready for the gig.\nHowever, there was only one thing missing, a drummer. \n\nGiovanni knew a talented young kid who was only 19 but exactly what the guys have been looking for. He passed the audition in 10 minutes. Gregor Jakac was to become the new drummer. \n\nMost of the summer was spent rehearsing and getting ready for whatever was coming to them. \n\nSoon afterwards they were offered a deal to release their first CD &amp;raquo;Seven Days&amp;laquo; for CPZ Records in Slovenia. Their first video for the song ''Release My Gun'' was shot with AVK Zavod (Tomi Horvat and Milo? Radosavljevi?) in September 2005. \n\nWithout going on forever on how, when, where and who did what, Tide is inviting all the music loving youngsters and elders to embark with them on this journey. Let's rock!!!","torrent":{"xt":"urn:btih:e3469a5ad558cb1c2e27d7029111912975feb758","amp;dn":"Tide+-+Seven+Days","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3469a5ad558cb1c2e27d7029111912975feb758","infoHashBuffer":{"type":"Buffer","data":[227,70,154,90,213,88,203,28,46,39,215,2,145,17,145,41,117,254,183,88]},"announce":[],"urlList":[]}}