{"title":"Traci Lords - 1000 Fires (1995) (Electronic) (192kbps)","uid":3404271,"size":113684418,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e370ce9b33b3f34a58f23ddadbc7cfa841cace4e&amp;dn=Traci+Lords+-+1000+Fires+%281995%29+%28Electronic%29+%28192kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"D_H_A","files":1,"time":1130925853,"description":"Traci Lords - Biography\t\t\t\t                by Steve Huey\n\nAlthough she'll probably never escape her notorious past as an underage porn queen, Traci Lords has since established herself as a credible actress and dance-club diva, choosing to concentrate mostly on the former. Lords was born Nora Louise Kuzma on May 7, 1968, in Steubenville, OH; she endured an abusive childhood in which she was molested by her alcoholic father (an experience she would later sing about in the song &quot;Father's Field&quot;). When she was 14, her mother was granted a divorce and moved the family to Redondo Beach, near Los Angeles. However, she soon dropped out of high school, ran away from home, and developed addictions to alcohol and cocaine. With the help of a fake ID and birth certificate listing her birth date as 1965, she sought income as a nude model, appearing in Penthouse in October 1984; she graduated to adult films the same year and quickly became a wildly popular star, appearing in between 80-100 features over the next two years. In 1986, Lords traveled to France and, on her real 18th birthday, made her only legal adult film, Traci I Love You (for which she controlled the distribution rights). While she was gone the FBI, acting on an anonymous tip, raided her apartment and discovered the truth about her age. Manufacturers and video stores rushed to pull her suddenly illegal tapes from the market, and Lords was blacklisted by the adult entertainment industry as punishment for the potential legal difficulties she'd caused anyone associated with her films.\n\nAfter her cold-turkey exit from porn, Lords studied acting and was quickly cast in her first non-adult film, Roger Corman's Not of This Earth, in 1988, which featured the only nude scene of her mainstream acting career. Two years later, she landed a major role in John Waters' Cry Baby, and was well on her way to steady work. She began traveling to the U.K. during the early '90s and fell in love with the techno and electronica popular on the London club scene; in 1992, she also sang backing vocals on the Manic Street Preachers' &quot;Little Baby Nothing,&quot; an anti-objectification song on the &amp;uuml;ber-political rockers' debut album Generation Terrorists. Lords scored several more prominent roles in film and television, appearing in the Stephen King miniseries The Tommyknockers in 1993, John Waters' Serial Mom in 1994, and was a recurring character on Melrose Place during 1995. That same year, Lords released her debut album, 1000 Fires. Surprising those who were expecting sexpot dance-pop in the vein of Madonna or Samantha Fox, the beat-heavy album reflected the fact that Lords had discovered electronic music in the clubs of England, where it existed in a much purer, undiluted form. As such, Lords had recruited the Goa trance/techno outfit Juno Reactor to handle much of the production, with additional help from Jesus Jones leader Mike Edwards. Though 1000 Fires was generally well-received, Lords has since elected to concentrate on acting, where she has carved out a steady career as a prominent B-movie actress. \n\n\n\nTraci Lords - 1000 Fires (1995) - Review\tby Stephen Thomas Erlewine\n\nTraci Lords' first album is a competent exercise in techno, not dance-pop. Throughout 1000 Fires the beat takes the center stage, with most of the tracks featured just a handful of hooks and thread-bare melodies. Not that Lords could handle strong melodies -- her voice is thin and doesn't have much range. However, she does have a forceful and distinctive personality, which gives the record a cohesive sound. \n\n\n\nTraci Lords - 1000 Fires (1995) (Electronic) (192kbps) + Cover\n\n01. Control\t\t\t\t 7:10\t(music by Juno Reactor)\n02. Fallen Angel\t\t\t 4:59\t(music by Juno Reactor)\n03. Good-N-Evil\t\t\t\t 6:28\t(music by Juno Reactor)\n04. Fly\t\t\t\t\t 4:09\n05. Distant Land\t\t\t 7:01\n06. Outlaw Lover\t\t\t 3:52\t(music by Juno Reactor)\n07. I Want You\t\t\t\t 6:01\n08. Say Something\t\t\t 4:07\n09. Father's Field\t\t\t 5:39\n10. Okey Dokey\t\t\t\t 6:18\n\nTOTAL TIME\t\t\t\t55:44\n\n\t\t\t+\n\n3 Mixes:\n\nControl (Juno Reactor Instrumental)\t 6:26\nFallen Angel (P. Oakenfold Mix)\t\t 7:59\nFallen Angel (Perfecto Mix)\t\t 8:49","torrent":{"xt":"urn:btih:e370ce9b33b3f34a58f23ddadbc7cfa841cace4e","amp;dn":"Traci+Lords+-+1000+Fires+%281995%29+%28Electronic%29+%28192kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e370ce9b33b3f34a58f23ddadbc7cfa841cace4e","infoHashBuffer":{"type":"Buffer","data":[227,112,206,155,51,179,243,74,88,242,61,218,219,199,207,168,65,202,206,78]},"announce":[],"urlList":[]}}