{"title":"Oil Storm FIXED (Recorded Jun 5 2005 FX) XVid.avi","uid":3386772,"size":727701504,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e375b3edd553e017dfa91e6d4838ca52f49d3555&amp;dn=Oil+Storm+FIXED+%28Recorded+Jun+5+2005+FX%29+XVid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Valerian","files":1,"time":1127444001,"description":"Made for TV Movie\n\nAired June 5, 2005\n\nSynopsis\n\n&quot;Oil Storm examines what happens when a category 6 hurricane in the gulf of mexico slams into Louisiana, crushing the city of New Orleans and crippling the vital pipeline for refined oil that is Port Fourchon. It examines the ripple effect of that event and the ensuing cascade of disasters associated with it, through the eyes of public officials, a family in Texas who owns a gas station, an EMS worker in Boston who has to deal with a brutal winter, and a ranching family in South Dakota who have their subsidy's completely taken away and question whether we need oil or food to survive.\n\nAs the country reels from the loss of life and energy reserves associated with hurricane's fury, the price of crude oil skyrockets and the United States government sets forth to take immediate action. It puts in motion efforts to rebuild the infrastructure of Port Fourchon (8 months minimum) and the sagging and disabled deep sea rigs in the gulf of Mexico (of equal length). It re-routes activity normally associated with the Port Fourchon shipping lanes to the port of Houston and compels Houston to work 24/7 in order to get the crude to our refineries and out to the public.","torrent":{"xt":"urn:btih:e375b3edd553e017dfa91e6d4838ca52f49d3555","amp;dn":"Oil+Storm+FIXED+%28Recorded+Jun+5+2005+FX%29+XVid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e375b3edd553e017dfa91e6d4838ca52f49d3555","infoHashBuffer":{"type":"Buffer","data":[227,117,179,237,213,83,224,23,223,169,30,109,72,56,202,82,244,157,53,85]},"announce":[],"urlList":[]}}