{"title":"Kaspersky Anti-Hacker 1.8.180 + Crack","uid":3374541,"size":4651860,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e39aac6e0eb13d7eeabdbc1e0173a7457a1abc1d&amp;dn=Kaspersky+Anti-Hacker+1.8.180+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anders1990","files":4,"time":1124979951,"description":"Kaspersky Anti-Hacker 1.8\n\n\nINTRODUCTION\n\nKaspersky Anti-Hacker is a personal firewall that is designed to provide protection for computers, running Windows operating system, against unauthorized access to data and against network hacker attacks attempted from the local area network or from the internet.\n\nKaspersky Anti-Hacker performs the following functions:\n\n1. Monitors all network activities via the TCP/IP protocol for all applications installed on your computer. Once the program detects any suspicious action performed by any application, the application notifies the user and, if necessary, blocks network access to this application. This ensures the confidentiality of data, stored on your computer. \n\n2. Blocks most wide-spread network hacker attacks by continuous monitoring of the incoming and outgoing traffic and notifies user about such attacks.\n\n3. Detects attempts to scan ports (normally such attempts precede network attacks) and prohibits further interaction with the attacking computer.\n\n4. Allows viewing lists of all established connections, opened ports or active network connections, and allows breaking unwanted connections, if required.\n\n5. Allows using the program without configuring specialized settings. The application support simplified administration in five security modes: Allow all, Low, Medium, High, Prohibit all. By default the self-learning (Medium) mode is activated, that configures the security system depending on user's reaction to various events.\n\n6. If required, the application allows fine-tuning the protection system. In particular, the application allows configuring the filtering system of wanted and unwanted network operations and the attacks detector.\n\n7. Allows registering certain network security events in special logs. If required, the level of detail of log records can be adjusted.\n\n\nIMPORTANT INFORMATION\n\nKaspersky Anti-Hacker does not provide protection of the user's computer against viruses and malicious programs that can destroy or corrupt your data. We recommend that you use Kaspersky Anti-Virus Personal to ensure anti-virus protection of your computer.\n\n\nCopyright &amp;copy; Kaspersky Lab, 2004-2005\n(This is the English version)\n\nIf someone want this or Anti-Virus in other languages just PM me.\nAvalible languages: German French Russian \n","torrent":{"xt":"urn:btih:e39aac6e0eb13d7eeabdbc1e0173a7457a1abc1d","amp;dn":"Kaspersky+Anti-Hacker+1.8.180+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39aac6e0eb13d7eeabdbc1e0173a7457a1abc1d","infoHashBuffer":{"type":"Buffer","data":[227,154,172,110,14,177,61,126,234,189,188,30,1,115,167,69,122,26,188,29]},"announce":[],"urlList":[]}}