{"title":"WWE.Smackdown.11.03.05-W4F","uid":3405226,"size":917999575,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3a5673459f070208ec02bc6c16a377e04a846d0&amp;dn=WWE.Smackdown.11.03.05-W4F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Strifeman","files":3,"time":1131136955,"description":"Release.Name...: WWE.Smackdown.11.03.05-W4F\nRelease.Date...: 11.04.05\nAir.Date.......: 11.03.05\nGenre..........: Wrestling\nSource.........: Digicable\nType...........: VCD\nSize...........: CD1 46 x 15mb | CD2 16 x 15mb\n\n\nCowboy&amp;ouml; Bob Orton was a longtime ally of Rowdy Roddy Piper. Orton even\naccompanied Piper for his matches at the first two WrestleManias. But \nOrton has other priorities now. Cowboy Bob is back in WWE to aid his son\nRandy in any and every way possible. And if that means helping Randy &amp;ocirc;kill&amp;ouml;\nthe legend of Piper, then so be it.\n\nLast week in SmackDown&amp;AElig;s main event, Cowboy Bob accidentally backed into a \nsignature Piper sleeper hold. It was lights out for Bob, and the submission\nsoon followed. Enraged by that result, the elder Orton will get Piper in the\nring one-on-one with a chance to prove that he has fully emerged from the \nshadow of &amp;ocirc;The Rowdy One.&amp;ouml; Piper will look to rile Orton up and make it two\nbig wins in a row. Which WWE Hall of Famer will come out on top? Tune in to\nSmackDown to find out.\n\nAlso, don't miss Christian's final match this week on SmackDown. As reported\nearlier on WWE.com, the former Intercontinental Champion is leaving WWE. But\nfirst he'll team up with JBL to take Matt Hardy and Rey Mysterio Friday night\non SmackDown.\n\nPowerhouse newcomer Lashley has plowed through the competition so far, but \nthis week on SmackDown, he&amp;AElig;ll have to take on two dangerous Superstars at once.\n\nNunzio and his enforcer Vito took issue with being left out of last week&amp;AElig;s\nFatal Fourway for the WWE Tag Team Championship. They contend that had they\nbeen involved, they&amp;AElig;d be sporting the gold now rather than MNM &amp;ugrave; and they let\nSmackDown General Manager Theodore Long know it.\n\nIn response, Mr. Long will give Nunzio and Vito a chance to prove that they \nbelong in the kind of championship matches that are changing Friday Nights. \nBut they&amp;AElig;ll have to go through the buzzsaw that is Lashley to do it. Will it\nbe another dominating performance by the three-time national wrestling champion,\nor will he be silenced by &amp;ocirc;The Skull&amp;ouml; and Nunzio?\n\nAlso, after a blind tag and a Snapshot last week, MNM became two-time WWE Tag\nTeam Champions. Mercury, Nitro and Melina are sure to grab some face time before\ntheir paparazzi following on Friday, but will they be forced to defend the gold?\n\nAll this and much more on Friday Night SmackDown!\n\nCappers Notes:\n--------------\nThis early release is from the Score sports channel (Canada) which means there \nare scoreboards which appear from time to time.  However, considering this is\nthe same feed that another group uses for RAW weekly, we felt it was worth \nreleasing (and there are no AR problems for those wizardly nukers out there).  \nEnjoy!\n\n","torrent":{"xt":"urn:btih:e3a5673459f070208ec02bc6c16a377e04a846d0","amp;dn":"WWE.Smackdown.11.03.05-W4F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a5673459f070208ec02bc6c16a377e04a846d0","infoHashBuffer":{"type":"Buffer","data":[227,165,103,52,89,240,112,32,142,192,43,198,193,106,55,126,4,168,70,208]},"announce":[],"urlList":[]}}