{"title":"The Three Stooges #200-209 (miss #201, 203, 204, 207, 208) sorry","uid":3459455,"size":553297354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e688cd3a94e887f2287547c7148ec034e3bd9247&amp;dn=The+Three+Stooges+%23200-209+%28miss+%23201%2C+203%2C+204%2C+207%2C+208%29+sorry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeterL99","files":12,"time":1142764182,"description":"Muscle up a Little Closer (1957)\n\n    Director: Jules White\n    Cast: Maxine Gates, Matt Murphy, Ruth Godfrey White, Hariette Tayler\n\nJoe is engaged but can&amp;#039;t get married until he recovers the engagement ring which has disappeared. The Three Stooges suspect the ring was stolen by Elmo, a beefy bully, who works at the same factory they do. They confront Elmo in the company gym, but he&amp;#039;s too tough for them. Fortunately Joe&amp;#039;s girl is even tougher, and she gets Elmo to confess and return the ring.\n--------------------------------------------------------------------------------\nSpace Ship Sappy (1957)\n\n    Director: Jules White\n    Cast : Benny Rubin, Emil Sitka, Lorraine Crawford, Hariette Tayler, Marilyn Hanold, Doreen Woodbury\n\nAn eccentric scientist tricks the Three Stooges into joining himself and his daughter on an expedition to Venus. On Venus, the boys go exploring and encounter some cannibalistic amazons who plan to devour them. The Three Stooges escape and take off in the spaceship which goes wildly out of control. As the ship is about to crash, the scene changes to the annual meeting of the Liars Club, where the Three Stooges win the prize as the biggest liars in the world.\n--------------------------------------------------------------------------------\nQuiz Whiz (1958)\n\n    Director: Jules White\n    Cast : Greta Thyssen, Gene Roth, Milton Frome, Bill Brawer, Emil Sitka\n\nJoe wins a contest and is promptly fleeced out of his winnings by some con men. When the Three Stooges go to recover his money, the bad guys convince them that they can get rich by posing as children and becoming the wards of a millionaire. The boys go along with the plan, not realizing that the &quot;millionaire&quot; and his pretty niece are in on the scam and are planning to knock them off. The Three Stooges foil the plan and recover Joe&amp;#039;s money.\n--------------------------------------------------------------------------------\nFifi Blows Her Top (1958)\n\n    Director: Jules White\n    Cast : Vanda Dupre, Phil Van Zandt, Harriette Tarler, Joe Palma, Hariette Tayler, Christyne McIntyre (stock footage)\n\nThe Three Stooges reminisce about their wartime romances in Europe. After they finish their tales, they discover that Joe&amp;#039;s girl Fifi, whom he left behind in Paris, has moved in next door. The only problem is that she&amp;#039;s now married, with a very jealous husband. The husband turns out to be a real cad, and when Fifi overhears him tell about his plans to find a new wife, she clobbers him and goes back to Joe.\n\n(Some reused footage from &quot;Love at First Bite&quot;.)\n--------------------------------------------------------------------------------\nFlying Saucer Daffy (1958)\n\n    Director: Jules White\n    Cast : Harriette Tayler, Emil Sitka, Gail Bonney, Bek Nelson, Diana Darrin\n\nJoe accidentally takes a picture of a paper plate which Moe and Larry submit to a magazine as an authentic picture of a flying saucer. Moe and Larry collect a big prize, but when the picture is proven to be phony, they&amp;#039;re hauled off to Jail. Joe then gets a picture of a real spaceship and this time he gets the fame and fortune, while Moe and Larry wind up in a sanitarium.\n--------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:e688cd3a94e887f2287547c7148ec034e3bd9247","amp;dn":"The+Three+Stooges+%23200-209+%28miss+%23201%2C+203%2C+204%2C+207%2C+208%29+sorry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e688cd3a94e887f2287547c7148ec034e3bd9247","infoHashBuffer":{"type":"Buffer","data":[230,136,205,58,148,232,135,242,40,117,71,199,20,142,192,52,227,189,146,71]},"announce":[],"urlList":[]}}