{"title":"The Threat of the Homosexual Agenda to Your Freedoms","uid":3421670,"size":71971214,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:e6b6f97c2704cd03568a16c063cb841c8b757411&amp;dn=The+Threat+of+the+Homosexual+Agenda+to+Your+Freedoms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReVIsed","files":1,"time":1134793817,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event (and about threats to our freedom in general) and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot; and &quot;transxout&quot;. Now, they are obviously either disinformers or simply just the everyday-idiots, because my files are videofiles, hence impossible to infect with a virus. You will probably find another false virus warning below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nThe Threat of the Homosexual Agenda to Your Freedoms\n\nMost people have not been closely following the implications of the promotion of the homosexual agenda in other Western countries, especially Canada and Sweden, or even in selected areas of the United States. Here are some results that would follow from granting homosexual marriage or its legal equivalent and making &quot;sexual orientation&quot; a specially protected civil rights category for &quot;hate speech&quot; and &quot;non-discrimination&quot; laws.  \n\n(1) Go to jail for &quot;hate speech.&quot; If a &quot;Human Rights Commission&quot; finds that you have made public statements that &quot;incites hatred&quot; against homosexual persons, you may go to prison. Ultimately, even ministers of the gospel will not be exempt.  \n\nThis past June in Sweden a Pentecostal minister, Ake Green, was sentenced to a month in prison for referring to homosexual practice in a sermon as a &quot;horrible cancerous tumor in the body of society.&quot; The public prosecutor commented: &quot;Collecting Bible [verses] on this topic as he does makes this hate speech.&quot; The Swedish parliament has already given initial approval to a constitutional amendment that would prohibit any speech that &quot;implies unfavorable treatment&quot; to homosexual persons, with a prison sentence of up to two years...\n\nRead more: http://www.robgagnon.net/HomosexualAgenda.htm\n\nIf anyone have this, please upload it and let me know about it: http://www.hebookservice.com/products/bookpage.asp?prod_cd=c6343\n\nFilesize.....: 68.6 MB\nRuntime......: 00:42:30\nVideo Codec..: Windows Media Video V7\nVideo Bitrate: 200 kbit/s\nAudio Codec..: Windows Media Audio 8\nAudio Bitrate: 32 kbit/s  CBR\nFrame Size...: 320x240","torrent":{"xt":"urn:btih:e6b6f97c2704cd03568a16c063cb841c8b757411","amp;dn":"The+Threat+of+the+Homosexual+Agenda+to+Your+Freedoms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6b6f97c2704cd03568a16c063cb841c8b757411","infoHashBuffer":{"type":"Buffer","data":[230,182,249,124,39,4,205,3,86,138,22,192,99,203,132,28,139,117,116,17]},"announce":[],"urlList":[]}}