{"title":"[PC/MAC] Blue's Tresure Hunting","uid":3457631,"size":1261096960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e88cdb3b3833f4d8ac331ff693cd147ceb565adf&amp;dn=%5BPC%2FMAC%5D+Blue%5C%27s+Tresure+Hunting&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trucotal","files":2,"time":1142405951,"description":"Amazon URL:\n &lt;a href=&quot;\thttp://www.amazon.com/exec/obidos/tg/detail/-/B00008Z0EW/104-9033768-5482331?v=glance&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.amazon.com/exec/obidos/tg/detail/-/B00008Z0EW/104-9033768-5482331?v=glance&lt;/a&gt;\nScreenShot:\n &lt;a href=&quot;\thttp://www.sonic.net/mnitepub/pccafe/reviews/bluetreasurehunt/playground.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.sonic.net/mnitepub/pccafe/reviews/bluetreasurehunt/playground.jpg&lt;/a&gt;\nPlatform:\n\tWindows 98 / 95 / Me \nMedia:\n\tCD-ROM \nESRB Rating: \n\tEveryone (Content suitable for persons age 6 or older.)\nFormat: \n\tCD-ROM\nDescription/Info:\n\t\nBlue, the cutest puppy on the block, is back in this latest Learning Adventure from Humongous Entertainment designed for preschoolers aged 3 to 6. Blue&amp;#039;s Treasure Hunt is very similar to her last Birthday Adventure with a continuation of the familiar hunt-the-paw print theme, but this one has some extras to vary the play a little without going off on a completely different tangent.\n\nHunt the keys\nThe object of this adventure is to find the keys that open the door to the Land of Great Discovery, but the task is not quite as simple as it might seem. Treasure Bug has hidden them all away in a treasure chest. There are three keys to find, or three mini quests to complete in sequence, before the door can be opened. Each mini quest has a two-pronged pathway for not only does the chest have to be hunted down by following a trail of scrolls, but also Treasure Bug won&amp;#039;t open it until the player has found the answer to a question. He poses this question when he flies away with the chest and it&amp;#039;s sure to be asking Blue to name the favourite &amp;#039;treasure&amp;#039; or activity of one of her friends.\n\nThis is where the Blue&amp;#039;s Clues game comes in. The player must look around carefully to find Blue&amp;#039;s paw prints and once again this sometimes entails doing favours for other characters so that the prints become visible. Of course Steve is there with his Handy Dandy Notebook to jot down the clues as the player finds them and so are all of Blue&amp;#039;s good friends including Slippery Soap, Paprika, Mailbox and Magenta.\n\nJoin in the hunt\nBlue&amp;#039;s Treasure Hunt is an engaging and colourful game with great sound effects and chirpy music as well as lots of background animations and many &amp;#039;clickable&amp;#039; hotspots to encourage children to look around and experiment. This adventure introduces some new friends as well as some new locations including the School and the Park. As with the last episode there are a number of fun learning activities just waiting to be discovered. These include finding the missing numbers for the Hickory Dickory Dock clock, sorting Magenta&amp;#039;s pictures into the correct sequence or helping Orange Kitten to account for the school supplies.\n\nWhen players complete the quests for the keys they are able to enter the Land of Great Discovery where they can create their very own world by placing &amp;#039;stickers&amp;#039; of different animals or different objects on a pre-drawn landscape, or by decorating the Treasure House. The easy-to-use Discovery Kit contains all the necessary goodies for this undertaking. There is a painting set and a whole collection of stickers, many of which can be coloured-in or modified in some way. Here players can also try out the fun Treasure Hunt ball game (a Breakout game with 100 levels) to learn mouse control (or hone their reflexes) or even try their hand at making their own game.\n\nThis one is sure to amuse young Blue&amp;#039;s Clues fans. It comes on two CDs, is all simple point and click and has three difficulty settings to suit the child&amp;#039;s age/skill level. It also has the usual &amp;#039;Handy Dandy&amp;#039; help option for parents that can be accessed from within the game and a really helpful and detailed manual.\n\n\nOther kid games releases:\n\t- Finding Nemo: nemo&amp;#039;s Underwater World of Fun (http://thepiratebay.se/details.php?id=3456371)","torrent":{"xt":"urn:btih:e88cdb3b3833f4d8ac331ff693cd147ceb565adf","amp;dn":"%5BPC%2FMAC%5D+Blue%5C%27s+Tresure+Hunting","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88cdb3b3833f4d8ac331ff693cd147ceb565adf","infoHashBuffer":{"type":"Buffer","data":[232,140,219,59,56,51,244,216,172,51,31,246,147,205,20,124,235,86,90,223]},"announce":[],"urlList":[]}}