{"title":"Three Stooges 110-119(miss_115,116) 2nd try","uid":3395173,"size":1195240574,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8f5f7acbad04aa117ef57d78ed8d052c49bc641&amp;dn=Three+Stooges+110-119%28miss_115%2C116%29+2nd+try&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeterL99","files":19,"time":1129053058,"description":"The Three Troubledoers (1946)\n\n    Director: Edward Bernds\n    Cast : Christine McIntyre, Dick Curtis, Vernon Dent\n\n    Set in the old west, the Three Stooges become marshals in a town with a high death rate for lawmen.  The boys set out prevent a marriage between the villain Blackie and the heroine Nell, who's father Blackie has kidnapped.  The Three Stooges manage to defeat Blackie and his henchmen, but when Nell's father learns she promised to marry Curly if he could save her, he decides death would be a preferable fate.\n--------------------------------------------------------------------------------\nMonkey Businessmen (1946)\n\n    Director: Edward Bernds\n    Cast : Kenneth MacDonald, Fred Kelsey, Snub Pollard, Jean Donahue, Cy Schindell, Frank Lackteen\n\n    The Three Stooges are bumbling electricians who decide to go away for a rest after they are fired for their incompetence.  The rest home they choose is run by Dr. Mallard, a quack who gyps the patients for everything they've got.  When the boys discover the crooked goings on they escape, but not before Curly accidentally cures another patient who rewards him with a thousand dollars.\n--------------------------------------------------------------------------------\nThree Loan Wolves (1946)\n\n    Director: Jules White\n    Cast : Beverley Warren, Harold Brauer\n\n    Told in flash back, the Three Stooges tell their son how he came to have three fathers.  The Three Stooges, owners of a pawn shop, owed money to the &quot;Gashouse Protection Society&quot;, a bunch of loan sharks.  To complicate matters, a lady leaves a baby in the shop as part of a plan to sell a phony diamond and the Three Stooges wind up caring for the kid.  The Three Stooges manage to defeat the crooks and when they finish telling the story, the kid goes off to find his real mother.\n--------------------------------------------------------------------------------\nG.I. Wanna Go Home (1946)\n\n    Director: Jules White\n    Cast : Judy Malcom, Ethelread Leopold, Doris Houck, Symona Boniface\n\n    The Three Stooges are discharged from the army and go to see their fiancees, but find they have been dispossessed and the wedding is off until they find a home.   The boys have trouble finding a vacant apartment so they set up housekeeping in a vacant lot.  Their housing problems seem to be solved until a farmer destroys their new home with a tractor.  The Three Stooges then build a house of their own, but the girls aren't impressed with the one room mansion and walk out on them.\n--------------------------------------------------------------------------------\nRhythm and Weep (1946)\n\n    Director: Jules White\n    Cast : Jack Norton, Doria Patrice, Ruth Godfrey, Nita Bieber\n\n    The Three Stooges are actors who can't seem to find a job, so they decide to jump off a high building and end it all.  On the roof top they meet three girl dancers with the same idea.  Before they can jump, they meet a millionaire Broadway producer who hires them all for his next show.  The rehearsal goes so well that he doubles their salary. But, as always with the Three Stooges luck, they discover that the &quot;producer&quot; is an escaped mental patient from Dr. Dippy's retreat.\n--------------------------------------------------------------------------------\nStop! Look! and Laugh! (1960)  7/1/1960\n\nFeaturing Moe, Larry and Curly\nColumbia Feature Film\nLength: 78 min.\n\nProduction Crew:\nName                Position \nDon Appell          Director \nWilliam O. Steiner  Photography \nJerome Thoms        Film Editor \nRobert Bryer        Art Director \n\nCast Members:\nActor/Actress   Role \nMoe Howard      Moe \nLarry Fine      Larry \nCurly Howard    Curly \nPaul Winchell   himself \nJoe Bolton      Officer Joe \n\nA compilation of various Stooges shorts with Moe, Larry and Curly, intermixed with new footage featuring Paul Winchell and his dummies, Jerry Mahoney and Knucklehead Smiff. \n\nMost of the shorts clips were the best moments from such classic shorts as &quot;Micro-Phonies&quot;, &quot;A Plumbing We Will Go&quot;, &quot;Calling All Curs&quot;,&quot;How High Is Up&quot; among others. (Production credits below are for new sequences.)\n--------------------------------------------------------------------------------\nFright Night (1947)\n\n    Director: Jules White\n    Cast: Cy Shindell, Dick Wesell, Harold Brauer, Claire Carleton\n\n    The Three Stooges are managers of &quot;Chopper&quot;, a beefy boxer, and they bet their bank roll on his next fight.  When a gangster tells them to have Chopper lose or they'll lose their lives, the boys decide to play along.  They try to soften Chopper up by feeding him rich food and having him spend time with their friend Kitty.  The fight gets canceled when Kitty dumps Chopper for his opponent and the two boxers engage in some pre-match fisticuffs that result in a broken hand for the opponent.  The Three Stooges think they've put one over on the gangsters, only to have the bad guys corner them in a deserted warehouse.  Instead of being rubbed out, the boys capture the crooks and get a reward.\n--------------------------------------------------------------------------------\nOut West (1947)\n\n    Director: Edward Bernds\n    Cast: Jack Norman, Jock Mahoney, Vernon Dent, Christine McIntyre, Stanley Blystone, George Chesbro, Frank Ellis\n\n    The Three Stooges go out west for Shemp's health and get mixed up with some bad guys.  The villains have locked up the Arizona Kid and their leader plans to marry his girl, Nell.  The boys help the  Arizona Kid escape and he rides to fetch the Cavalry.  Somehow, the  Three Stooges manage to defeat the bad guys before the Cavalry arrives.\n--------------------------------------------------------------------------------\nMISSING:\n115.\nThree Little Pirates (1946)\n\n    Director: Edward Bernds\n    Cast: Robert Stevens, Dorothy DeHaven, Vernon Dent, Christine McIntyre\n\n    The Three Stooges are castaways from a garbage scow who land on Dead Man's Island where everyone is living in olden times.  To escape from the governor, they disguise Curly as a Maharaja and win permission to journey to their own country to fetch presents.  The governor is fooled, but the boys run into more trouble in the den of Black Louie the pirate where Curly is forced into a knife throwing contest with Larry as the target.  Things look bad until a mis-thrown knife cuts the rope that holds the chandelier and it crashes down on Black Louie's men.  With the pirates defeated,  Moe decides to take over as ruler of the island.\n--------------------------------------------------------------------------------\nMISSING:\n116.\nHalf-Wits Holiday (1947)\n\n    Director: Jules White\n    Cast: Vernon Dent, Barbara Slater, Ted Lorch, Emil Sitka, Symona Boniface\n\n    A professor bets one of his colleagues that he can turn the Three Stooges into gentlemen within 60 days.  With the aid of his pretty daughter, the professor tries to teach the boys proper etiquette.  After many frustrating attempts, he introduces the Three Stooges into society at a fancy party.  At first things go all right, but the party soon degenerates into a wild pie fight.\n\n    (A remake of &quot;Hoi Polloi&quot; with lots of footage from the original. Except for a cameo in &quot;Hold That Lion&quot;, this was Curly's last appearance in a stooge short.)\n","torrent":{"xt":"urn:btih:e8f5f7acbad04aa117ef57d78ed8d052c49bc641","amp;dn":"Three+Stooges+110-119%28miss_115%2C116%29+2nd+try","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f5f7acbad04aa117ef57d78ed8d052c49bc641","infoHashBuffer":{"type":"Buffer","data":[232,245,247,172,186,208,74,161,23,239,87,215,142,216,208,82,196,155,198,65]},"announce":[],"urlList":[]}}