{"title":"Duplex (nor,swe,dan,suomi sub)","uid":3375370,"size":4683278064,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e987a054795fcd32787dbd249ec499e5012ddba3&amp;dn=Duplex+%28nor%2Cswe%2Cdan%2Csuomi+sub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"simen_90","files":20,"time":1125141241,"description":"Norwegian, swedish, danish and suomi subtitles... perfect quality. With menu and extras. DVD rip\n\n\nAlex Rose (Ben Stiller) and Nancy Kendricks (Drew Barrymore) are a young, professional, New York couple in search of their dream home. When they finally find the perfect Brooklyn brownstone they are giddy with anticipation. The duplex is a dream come true, complete with multiple fireplaces, except for one thing: Mrs. Connelly (Eileen Essel), the cranky old lady who lives on the rent-controlled top floor. Assuming she is elderly and ill, they take the apartment but their hopes are quickly dashed when they realize that Mrs. Connelly is an energetic senior who enjoys watching her television at top volume day in and day out and rehearsing in a brass band. A writer, Alex is attempting to finish his novel against a looming deadline. However, each day as he begins to write, he is interrupted by Mrs. Connelly's numerous demands and requests and what begins as a nuisance quickly escalates into an all-out war. When Nancy loses her job and the pair are trapped at home together with Mrs. Connelly, their rage turns to homicidal fantasy as they plot ways to get rid of their no-good neighbour...","torrent":{"xt":"urn:btih:e987a054795fcd32787dbd249ec499e5012ddba3","amp;dn":"Duplex+%28nor%2Cswe%2Cdan%2Csuomi+sub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e987a054795fcd32787dbd249ec499e5012ddba3","infoHashBuffer":{"type":"Buffer","data":[233,135,160,84,121,95,205,50,120,125,189,36,158,196,153,229,1,45,219,163]},"announce":[],"urlList":[]}}