{"title":"RemoveWGA 1.02","uid":3497373,"size":8783,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eab313e0582317b472265b40d804beca33d87d8a&amp;dn=RemoveWGA+1.02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NickUS","files":1,"time":1150996302,"description":"RemoveWGA enables you to remove the Microsoft &quot;Windows Genuine Advantage Notifications&quot; tool, which is calling home and connect to Microsoft servers every time you boot. Futures updates of this notification tool will (officialy) setup the connection rate to once every two weeks.\n\nOnce the WGA Notification tool has checked your OS and has confirmed you had a legit copy, there is no decent point or reason to check it again and again every boot. Moreover, connecting to Microsoft brings security issue for corporate networks, and privacy issues for everyone. It is also unclear which information are transmitted (Microsoft published an official answer, but an individual study brought some questions). All of that, along the fact that Microsoft used deceptive ways to make you install this tool (it was told you it was an urgent security update, whereas it is a new installation giving you no extra security) makes me calling this tool a\nspyware. \n\nAlso, Windows Genuine Advantage Notifications is different than Windows Genuine Advantage Validation. RemoveWGA only remove the notification part, phoning home, and does not touch the Validation part. As the time I&amp;#039;m writting this, the Validation part is mandatory for some not critical downloads from Microsoft, but the Notification part is not mandatory at all, and you are able to install all of the security updates without installing this one. This may change in the future thought, I don&amp;#039;t know what are the Microsoft plans.\n\nFeatures\n* Tell you if the WGA notification tool is active on your system\n* Allows you to remove the WGA notification tool from your system\n* Accept the &quot;-silent&quot; command line parameter to silently check if the WGA notification tool is active on your system, and popup only if it is found (usefull for checking automatically at startup for instance)","torrent":{"xt":"urn:btih:eab313e0582317b472265b40d804beca33d87d8a","amp;dn":"RemoveWGA+1.02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab313e0582317b472265b40d804beca33d87d8a","infoHashBuffer":{"type":"Buffer","data":[234,179,19,224,88,35,23,180,114,38,91,64,216,4,190,202,51,216,125,138]},"announce":[],"urlList":[]}}