{"title":"Blood Tsunami","uid":3390776,"size":38798047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebc163b94b6d4a9c4d2a6b36f7588bd1d5520128&amp;dn=Blood+Tsunami&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fidolite","files":6,"time":1128196606,"description":"Sykt bra norsk thrash metal, Min gamle skolekammerat som er Pete Evil :)\n\n\nhttp://www11.nrk.no/urort/user/biography.aspx?id=5551\n\n\nBlood Tsunami formed in 2004. Guitarist and vocalist Pete Evil hooked up with Jay on drums and began to arrange and rehearse some metalriffs he had written, but never used during his years in the rock ?n roll/punk band called Hellride.\n\nThe music of Blood Tsunami was, and still is, nothing but vicious and aggressive old school thrash metal, heavily influenced by early Slayer, Testament, Exodus, Metallica, Destruction and Kreator.\n\nSoon Riff Randall joined on bass and Dor stepped in on the second guitar.\nShortly after they recorded their first demo. The song &quot;Let Blood Rain&quot; was the first Blood Tsunami song ever written and the version you can hear on this site comes from the first Blood Tsunami demo.\n\nBlood Tsunami performed their debut show on August the 24th 2004. This concert took place at Last Train, a small rock ?n roll bar downtown in Oslo, and Blood Tsunami played support for the mighty Swedish death metal legends Entombed.\n\nAfter a while Riff Randall decided to leave the band and was quickly replaced by Bosse who used to play bass with Pete in Hellride. The band continued to play live and got the honour to play support for another legendary band, namely Deicide (US). This happened at John Dee in Oslo on November the 22nd 2004.\n\nNot many months later Jay also decided to drop out of the band. Pete called up Faust (Scum, Aborym, Emperor) and asked him to join Blood Tsunami. Faust agreed to give it a try and today he is a fulltime member of the band.\n\nOnce again the band hit the studio to record a demo and this time they had found the right sound of Blood Tsunami. The whole &quot;Demo 2005&quot; is now available on this site. Check it out. Download the songs and spread the word.\n\nBlood Tsunami will play support for Napalm Death (UK) at Garage in Oslo on November the 18th. Don't miss it!\n\nThrash 'til Death!\n","torrent":{"xt":"urn:btih:ebc163b94b6d4a9c4d2a6b36f7588bd1d5520128","amp;dn":"Blood+Tsunami","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebc163b94b6d4a9c4d2a6b36f7588bd1d5520128","infoHashBuffer":{"type":"Buffer","data":[235,193,99,185,75,109,74,156,77,42,107,54,247,88,139,209,213,82,1,40]},"announce":[],"urlList":[]}}