{"title":"I-Frame Suite 2","uid":3405400,"size":1129128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec8d3e22c68fe8ebbd468e8ff70398a08e5621b4&amp;dn=I-Frame+Suite+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PrimoPup","files":1,"time":1131166638,"description":"The iFrame Suite contains 5 extensions that are tools for the building and manipulation of iFrames. It is the most powerful set of iFrame extensions available for Dreamweaver today.\n\nThe iFrame suite has taken the hassle out of building, managing, and linking to your iFrames. The following 5 extensions allow for just about every common linking scenario you will likely need... and then some.\nThe package\nThis extension suite package contains 5 iFrame extensions.\n\nCommand - The iFrame Manager allows for the building of iFrames into your page from the Extension interface. All iFrames are completely editable after insertion from the default source page to the dimensions and position.\n\nBehavior - The iFrame Scroller extension allows you to scroll iFrames (or document Frames ) from active text or image buttons just as with DHTML layer based scrollers. Completely editable and adjustable speeds.\n\nBehavior - The iFrame Linker extension allows you to target iFrames from active links very easily. The links can be inside a Frameset across Frames, from popup windows, or from a page within the iFrame itself. \n\nBehavior - The iFrame JumpMenu extension allows you to target iFrames from a List Menu or a Jump Menu. Cross Frame targeting is also supported.\n\n( New in version 2 )\nBehavior - The iFrame Page extension allows you to page up or down the iFrame from an active link. Cross Frame paging is also supported. \nThe Scroller, Linker, JumpMenu and Page scripts will function across frames, from popup windows or from within the same document as well.\n\n 14 sets of scroller images. All of the scroller images used in the demo are included. Plus More ..\n Completely editable Fireworks png files for each set of the scroller images.\n 42 page fully illustrated printable Adobe PDF document containing instructions for each extension.\n  Completey illustrated online Help Files.\n  Working sample page serving as a quick start guide to the interface operation.\n  Unlimited free product support. \n","torrent":{"xt":"urn:btih:ec8d3e22c68fe8ebbd468e8ff70398a08e5621b4","amp;dn":"I-Frame+Suite+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec8d3e22c68fe8ebbd468e8ff70398a08e5621b4","infoHashBuffer":{"type":"Buffer","data":[236,141,62,34,198,143,232,235,189,70,142,143,247,3,152,160,142,86,33,180]},"announce":[],"urlList":[]}}