{"title":"Nefilim - Zoon","uid":3413144,"size":90280130,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed7f1017940f7a003657e99024b5f0efbd3eeeef&amp;dn=Nefilim+-+Zoon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kayaman","files":13,"time":1132798150,"description":"Ogg Vorbis AOTuV 4.51 - Q7\nFront/CD/Back covers included.\n\n\nTHE NEFILIM\nZoon\n(Beggars Banquet/Cortex)\n\n\nWHEN Goths roamed the Earth, all darkly shaggy, lace, knee highs, mascara, black lipstick, spiked hair and intense, the most carnivorous and brooding of animals was Fields Of The Nephilim or &quot;the Neph&quot; as their sun-starved vampires dubbed their lordly icons. Magic flared, fingertips sparkled, wizards flashed through the air, their gigs weird transcendent rituals where the Neph transformed into the four horsemen of the apocalypse and smeared thunderous invocation through a wall of sound. Nothing was more demented, decayed, deeper, sprung and broken; the growling, throat torn, rasp of the Nephilim, Carl McCoy, a blackly challenged master if ever there was one.\n\nBy 1991, the Neph had reached their point of no return and McCoy began work on a vision that would become Zoon; his inspiration the blast furnace of metal pyrotechnics and ferocity exemplified by the likes of Slayer, slashed at the vein by the atmospherics, remorseless ambience and magic of Goth. Zoon is terrifying, unrelenting; an amped up nightmare where Goth collides with speed metal, usurps Ministry, puts it all through a compressor and spits out The Nephilim for the mid-'90s. So vast is Zoon, so Wagnerian, so incanted that it treads a perilous edge where a void of unremitting darkness claws at the feet, curled fingers pour out of unbidden space to rape the mind, faces in four dimensions whirl in a cinema of gargoyle, a freak show for the demented and diabolical, a place where realisation meets dissipation and denial, God and the devil morph in a power struggle, the focus blurs and the crazed and insane seem strangely happy and right. Zoon is epic genius that pushes the boundaries to the seam of the soul. Penetration, Venus Decomposing, Melt, Coma ... there is no respite, no easy out. This is for keeps.","torrent":{"xt":"urn:btih:ed7f1017940f7a003657e99024b5f0efbd3eeeef","amp;dn":"Nefilim+-+Zoon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed7f1017940f7a003657e99024b5f0efbd3eeeef","infoHashBuffer":{"type":"Buffer","data":[237,127,16,23,148,15,122,0,54,87,233,144,36,181,240,239,189,62,238,239]},"announce":[],"urlList":[]}}