{"title":"Garmin Metroguide Europe V7 - No Unlocking Needed","uid":3497751,"size":1410762437,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ef174b30f04206d05a1b623f7e7df39d4ada4508&amp;dn=Garmin+Metroguide+Europe+V7+-+No+Unlocking+Needed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SunyJim","files":1,"time":1151097872,"description":"3 CD images .RARd \njust unrar and burn with Nero (or whatever)\nUnfortunatly the metroguides are not routeable on the GPSr units, Only on the PC.\nAddress lookup does work on compatable GPS Units.\n\n\nThis is NOT the latest Metroguide Europe. I&amp;#039;m still looking for Garmin Metroguide Europe V8, and Metroguide North America v7 both don&amp;#039;t need to be unlocked.\nFound this one on the ever crappy and slow EMule network. If you have a later version of metroguide Europe or North America please share!!\n\nUNLOCK CODES\nGarmin City Navigator and City Select both need unlock codes. The Unlock codes are specific to the GPSr unit id and the software version. So the unlock code you see with the CS and CN torrents will only unlock the maps on your computer not on the GPSr, and isn&amp;#039;t that the whole point of City Navigator and City Select?\n\n_________________________________________________________________________________ \n\nGarmin MetroGuide Europe CD v7 Description:\nNavigating Europe has never been easier! MapSource MetroGuide Europe v7 now includes data for Greece and expanded coverage for the Czech Republic, Finland, France and Spain.\n\nIt also includes updated detailed maps of major metropolitan areas in Western Europe.\n\nGarmin MetroGuide Europe CD v7 Features:\n? Now includes data for Greece\n? Expanded coverage of the Czech Republic, Finland, France and Spain\n? Contains updated detailed maps of major metropolitan areas throughout Western Europe.\n? Includes detailed maps containing motorways, national and regional thoroughfares and local roads\n? Displays points of interest such as:\n  ? food and drink\n  ? lodging\n  ? border crossings\n  ? petrol stations\n  ? hospitals and more\n? Will automatically create point-to-point routes on PC ONLY\n? Address and feature lookup capability on PC and once downloaded to a compatible Garmin GPSr\n? Trip and Waypoint management function lets you transfer waypoints, routes and tracks between your Garmin GPSr and your PC","torrent":{"xt":"urn:btih:ef174b30f04206d05a1b623f7e7df39d4ada4508","amp;dn":"Garmin+Metroguide+Europe+V7+-+No+Unlocking+Needed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef174b30f04206d05a1b623f7e7df39d4ada4508","infoHashBuffer":{"type":"Buffer","data":[239,23,75,48,240,66,6,208,90,27,98,63,126,125,243,157,74,218,69,8]},"announce":[],"urlList":[]}}