{"title":"Battlefield 2 patch v1.03 - bf2_patch_v103.exe","uid":3392212,"size":179789735,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ef2f6e0aef04ee8cd42aa15f8b4f7068c16025ba&amp;dn=Battlefield+2+patch+v1.03+-+bf2_patch_v103.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slickshoes","files":1,"time":1128460922,"description":"================================================== ======================\nPatch v1.03\n================================================== ======================\n\n\nNEW FEATURES\n\n- Wake Island Map\n\nIncluded a remade version of this popular BF1942 map.\nBattlefield 2 version includes a 64 player layout and is\nconfigured for multiplayer only.\n\n- Server Favorites / History\n\nThere is a new tab in the MULTIPLAYER menu that holds a list of\nthe last 20 internet servers you have connected to, plus a list\nof servers you have selected as favorites.\n\n* Added a button to the other multiplayer tabs that adds the\ncurrently highlighted server to your favorites list.\n* Added buttons in the in-game server info menu (press TAB to\naccess) that will add or remove the server you are currently\nplaying on to / from your favorites list.\n\n- Account Login Welcome Screen\n\nAfter you login to an online account, a message appears that\ncontains BF2 news and information which updates periodically.\n\n- Stat Compare\n\nBy clicking the COMPARE button in BFHQ, you can search for another\nplayers name and load their current stats into BFHQ. Using the\narrow buttons next to the name in the top-left corner of the menu,\nyou can toggle between your stats and their stats.\n\nYou can also load a player's stats by double-clicking on their\nname in any leaderboard.\n\n- Nickname Prefix\n\nYou can add a 6-character prefix (such as a clan tag) to your\naccount nickname which will be displayed in-game next to your\nnametag in the score menu, in game messages, and above your player\nin the game world.\n\n* This prefix does not change your account name or statistic\ninformation (e.g. the prefix does not appear next to your name\non the leaderboards).\n* You can change this prefix at any time at the account login\nmenu.\n\n- Server Reserved Slots\n\nYou can define a list of player nicknames that will act as a\n&quot;reservation list&quot; for your server.\n\n* The list is located in modsbf2settingsReservedSlots.con\n* You can add player names to the list by editing the file and\nadding the following text for each player :\n\nreservedSlots.addNick\n\nwhere is the player's registered account name,\nnot including a nickname prefix (see above).\n* You can define the number of slots to set aside for reserved\nplayers in the dedicated server launcher, or with the setting\nsv.numReservedSlots in your serverSettings.con file.\n* The number of players on the list and the number of reserved\nslots does not necessarily have to be the same.\n\n- Mod Support\n\nThere are several new changes that improve support for mods.\n\n* When connecting to a server that is running a mod that you have\ninstalled but not activated, it will be automatically activated\nand you will load into the server.\n* Added a filter on the server browser for servers running the\ncurrently activated mod.\n* Fixed dedicated server launcher to properly handle launching mods.\n* Improved support for mods sharing archives with bf2\n\n- Improvements to in-game HUD / Map\n\n* The viewable area of the spawn menu / commander map is now scaled\nbased on the out-of-bounds area so that only the playable area\ntakes up the majority of viewable map space.\n* The names of CPs are now displayed on the spawn menu / commander\nmap and minimap\n* The minimap zoom level now changes dynamically depending on the\ntype of vehicle you are in. If you zoom in or out manually, that\nzoom level is remembered for that vehicle type next time you use\nit.\n* The names of players in your vehicle are displayed in the HUD\nwhen someone enters the vehicle or switches positions.\n* There is a new element in vehicle HUDs that displays the reload\ntime for countermeasures (smoke and flares).\n* Flags for each team are now displayed below their ticket count\non the minimap to make it easier to tell what team you are assigned to.\n\n\nGAMEPLAY CHANGES\n\n- Many criteria for ranks and awards have changed. If you are immediately\neligible for a new promotion, unlock, badge, award, or ribbon, it will\nbe awarded the next time you receive points on a ranked server.\n- Only 1 player in a vehicle will get credit for or speed up capturing\na flag at a CP. The other passengers must exit the vehicle to increase\nthe speed of capture or receive capture score.\n- Commanders no longer accrue a TK when artillery hits\nteammates.\n- The commander's supply drop now has an icon on the minimap and a 3D-\nmap icon in the world.\n- Auto team balance no longer moves players to the other team if they\nare a team commander or a squad leader.\n- The wrench repair rate on helicopters has been decreased.\n- You now receive 1 support point for destroying an enemy commander's\nartillery, UAV or Radar station.\n- If you have received a point for healing, repairing, or resupplying\na teammate, you will not receive another point from them for the same\naction for a set period of time.\n- Singleplayer enemies use the knife more effectively.\n- New engine sounds for the T98 tank.\n- New engine sounds for the China/MEC light jeep.\n- New cannon sounds on APCs.\n\n\nBUG FIXES\n\n- Fixed physics of vehicles against soldiers so that soldiers are not\nkilled so easily by moving vehicles.\n- Fixed a physics issue that can cause you to be stuck when falling into\nshallow water\n- Fixed an issue with soldier armor when spawning on a squad leader in a\nvehicle\n- Fixed some objects that caused vehicles to take massive collision damage\n- Fixed erroneous message stating that you punished a TK when auto-\npunish is OFF on the server.\n- When a vehicle explodes due to external forces, the driver is no longer\nmis-credited for the kills.\n- Added turret movement sounds to several vehicles.\n- Fixed an issue that caused crosshairs to stay on the screen when\nswitching camera views.\n- Fixed an issue that caused the time limit status of the server not to be\nsent to clients when it is changed by the server.\n- Fixed server setting sv.allowExternalViews. Setting this to 0 will\ndisallow external views.\n- Added setting for interfaceIP to the server launcher\n- Changed automatic TK banning to ban by cd-key instead of IP address\n- Improved the stability of secondary position turrets to reduce jerkiness\nduring movement.\n- Fixed spawning on squad leaders to prevent players from spawning where\nthey should not.\n- Fixed issue with auto team balance not sending new players to the team\nwith less players.\n- Set T90 top hatch armor to &quot;Front Armor&quot;.\n- Set some wheels on jets and helpcopters to stronger armor to prevent\nthem from being destroyed instantly by AT missiles.\n- Adjusted wheeled vehicle engines on hills to improve climbing.\n- Changed the Commo-rose behavior so that player does not leave crouch\nwhen using it.\n- Passwords entered to join password protected servers are now cleared\nafter use.\n- Improved PLAY NOW functionality.\n- Fixed some memory usage issues in the front end.\n- Fixed an issue allowing color changes in player name text.\n- When you click on a server in the server browser, the information\nfrom that server is updated to be more accurate.\n- Fixed a crash in the Ranked Linux server when communication with stats\nback-end ceased.\n- Improved the behavior of AA missiles when locked on an enemy.\n- Fixed an issue where parachuting soldiers could not be healed.\n- Added the server port to the SERVER INFO tab.\n- Removed the SERVER INFO tab when playing singleplayer\n- Fixed an issue causing some soldier &amp; vehicle control keys to be used\nfor in-game menus.\n- Added new soldier artwork in BFHQ\n- Added name of video director to credits\n","torrent":{"xt":"urn:btih:ef2f6e0aef04ee8cd42aa15f8b4f7068c16025ba","amp;dn":"Battlefield+2+patch+v1.03+-+bf2_patch_v103.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef2f6e0aef04ee8cd42aa15f8b4f7068c16025ba","infoHashBuffer":{"type":"Buffer","data":[239,47,110,10,239,4,238,140,212,42,161,95,139,79,112,104,193,96,37,186]},"announce":[],"urlList":[]}}