{"title":"Call of Duty 2 Patch 1.2","uid":3469528,"size":34160055,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ef9e703b16e41f97d6174cbedb6671df31df7631&amp;dn=Call+of+Duty+2+Patch+1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gofoo","files":1,"time":1144777481,"description":"CALL OF DUTY(R) 2\n1.2 PATCH README\nLast Updated: 3/23/2006\n\nINTRODUCTION &amp; IMPORTANT NOTES\n\nThis document details numerous additions, fixes, and changes to Call of Duty 2 in the 1.2 patch.\n\nThe Call of Duty 2 1.2 patch is an all-inclusive installation, containing all of the previous updates from the 1.01 patch. Information about updates included from the earlier 1.01 patch can be seen at the bottom of this document. \n\nIMPORTANT NOTE:  Use of the in-game console is not supported by Activision(r).  Please do not contact Activision Customer Support with issues that arise from using console commands in-game.\n\n\nNOTES FOR MOD USERS:\n- It is recommended that any user modifications that have been installed to the Call of Duty 2 directory be removed before installing this patch. These modifications are not supported by Activision and may not be compatible with some of the new features that are included.\n- Call of Duty 2 does not support mods that have spaces in the mod&amp;#039;s folder name.  Be sure that the folder that contains your mod does not have spaces; otherwise users will not be able to download the files.  For example, a mod in a folder called &quot;My Mod&quot; would be invalid, whereas &quot;MyMod&quot; or &quot;My_Mod&quot; would work.\n\nPUNKBUSTER(tm)\n\nCall of Duty 2 now includes PunkBuster Anti-Cheat software technology.  PunkBuster Anti-Cheat software technology and services combat online cheating in Call of Duty 2 Internet play.\n\nThe use of PunkBuster Anti-Cheat software is optional and is provided without direct cost to our users.  For more information about PunkBuster or for PunkBuster support, please visit http://www.evenbalance.com/.\n\nNote for server administrators: When enabling PunkBuster for the first time, you must add &quot;set sv_punkbuster 1&quot; to the &quot;config_mp.cfg&quot; file to initialize PunkBuster. This file can be found by going to the &quot;Call of Duty 2mainplayers&quot; folder and looking inside the folder named after your profile. If the &quot;sv_punkbuster&quot; command already exists in your config file, you can simply change the value to &quot;1&quot;.\n\nNEW FEATURES\n\n- Added two new multiplayer maps.  These maps support all current game types:\n\nmp_harbor  (Rostov, Russia)\n\nAn important shipping port in southern Russia, Rostov fell to the Germans in November 1941. The Soviet 37th army quickly counterattacked and punched through the overextended and winter-weary German lines to the north, forcing the 1st Panzer Army out. The Battle of Rostov resulted in the first major German withdrawal of the war.\n\nCall of Duty veterans will recognize this location as an updated version of the original Harbor map. In addition to the graphical and performance updates, several new structures and flanking paths have also been added.\n\nmp_rhine  (Wallendar, Germany)\n\nThe 2nd Rangers crossed the Rhine on March 24, 1945 at Wallendar, Germany in pursuit of retreating German forces. German forces harassed the advancing Allied units while withdrawing.\n\nDecimated by 5 years of war, the streets of Wallendar are covered with rubble and impact craters creating intense battle over difficult terrain with blown-out buildings providing cover. The Americans are attempting to take the German city on this map of urban combat.\n\n- New PunkBuster functionality included (as described above). \n- Added a &quot;PunkBuster&quot; filter under the &quot;Filters&quot; section of the &quot;Join Server&quot; screen.\n- Added a &quot;PunkBuster&quot; display column on the &quot;Join Server&quot; screen. \n\n- Added HTTP redirection for Servers running Mods or custom maps.  \nTo enable redirection on the server, set sv_wwwDownload to 1.  Set sv_wwwBaseURL to the base directory where the files are stored. For example, if the server had a file named &amp;#039;myfile&amp;#039; meant to be stored locally at Call of DutyMain, sv_wwwBaseURL should be set to &quot;http://samplewebpage1.com/&quot;. The file should be stored at http://samplewebpage1.com/Main/myfile. To prevent clients from taking up a slot on the server while downloading, set sv_wwwDlDisconnected to 1. This will free up a slot for the duration of the download and the client will attempt to autoconnect when the download is complete. Set cl_wwwDownload to 1 to enable redirection downloading on the client.\n\n- Added a new Multiplayer welcome screen when joining a server that details the Map objectives and victory conditions. \n- Added a &quot;Message of the Day&quot; for Multiplayer servers that will appear on the player&amp;#039;s welcome screen upon joining. Server admins can control this text by setting the &quot;scr_motd&quot; dvar to whatever text is desired. \n\n- Added Multiplayer spawning logic that will reduce instances of players spawning in front of enemy players. \n\nGENERAL FIXES\n- Corrected an issue that occurred on certain systems using AMD(R) Dual-Core processors where player health would not replenish at the intended speed. \n\n\nMULTIPLAYER FIXES\n\n- Fixed a potential exploit where players could get outside the map boundaries. \n- Corrected an exploit that caused some servers to shut down unexpectedly. \n- Please note that all &quot;Message of the Day&quot; text needs to be less than 1000 characters total. \n- Hovering over an enemy player no longer causes the crosshairs to highlight in red. This change does not affect teammates and crosshairs pointed at a friendly player will still highlight green.\n\nHeadquarters Changes\n- Adjusted the objective timers to ensure that the objective respawns more quickly once destroyed.\n- Removed compass icons for potential objective locations before the objective has spawned.  \n\nCapture the Flag Changes\n- Added HUD icons to show the flag post location when the flag is missing. \n- Players in possession of the flag are now identified as flag carriers on the scoreboard.\n- When an Allied player picks up the flag, fellow teammates will now see the flag carrier&amp;#039;s position displayed on the compass.\n\nNOTES FROM 1.01 PATCH\n\nCall of Duty(R) 2 Intel(R) Dual-Core Optimization Update README\n\nThis update for Call of Duty 2 adds optimization, \nspecifically to take advantage of Hyper-Threading technology in \nIntel processors. These optimizations will increase performance \nin both Single and Multiplayer modes. While significant\nperformance gains will be seen on Single-Core processors which \nsupport Hyper-Threading, the greatest increase will be realized \non Dual-Core processors.\n\nHOW TO TELL IF YOU HAVE A SUPPORTED PROCESSOR:\n1. Hit Ctrl + Alt + Delete.\n2. Select &amp;#039;Task Manager&amp;#039;.\n3. Select the &amp;#039;Performance&amp;#039; tab.\n4. Select View CPU History One Graph Per CPU\n5. More than one graph side by side below the &amp;#039;CPU Usage History&amp;#039;\nlabel indicates you have a Dual Core processor or a processor \nwith Hyper-Threading technology.\n\nAUTODETECT: Call of Duty 2 will automatically enable these \noptimizations if it detects that you have a supported processor.\n\n\n\n\n","torrent":{"xt":"urn:btih:ef9e703b16e41f97d6174cbedb6671df31df7631","amp;dn":"Call+of+Duty+2+Patch+1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef9e703b16e41f97d6174cbedb6671df31df7631","infoHashBuffer":{"type":"Buffer","data":[239,158,112,59,22,228,31,151,214,23,76,190,219,102,113,223,49,223,118,49]},"announce":[],"urlList":[]}}