{"title":"The descent [Spanish] [TeleSync]_CVCD","uid":3383547,"size":785967621,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f02c7ae6d78a38c1b618180fb712dd86d04c3ea0&amp;dn=The+descent+%5BSpanish%5D+%5BTeleSync%5D_CVCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"riojatorrent","files":3,"time":1126798507,"description":"En una monta&amp;ntilde;a remota, seis amigas se encuentran para su aventura anual, una expedici&amp;oacute;n espeleol&amp;oacute;gica a las arterias de la tierra. La l&amp;iacute;der de la ex pedici&amp;oacute;n es Juno, dura, persuasiva y peligrosa. La acompa&amp;ntilde;an las hermanastras Rebecca y Sam, Holly y Beth, profesora de ingl&amp;egrave;s que va a rega&amp;ntilde;adientes para cuidar de Sarah. &amp;Eacute;sta se est&amp;aacute; recuperando de un colapso mental causado por la muerte de su marido y su hijo un a&amp;ntilde;o antes, y necesita este viaje para recuperar la parte de su vida anterior. Pronto queda claro que Sarah no se ha recuperado totalmente y que las alucinaciones y los recuerdos que la han atormentado el pasado a&amp;ntilde;o aun se ciernen sobre ella. Pero Juno se sobrepone a los problemas de Sarah- ella es su mejor y mas antigua amiga, y va a hacer que esto funcione. Juntas se internan en el sistema de cuevas, disfrutando del peligroso aunque tambi&amp;eacute;n hermoso emplazamiento. Entonces el desastre ocurre cuando la ruta de salida queda bloqueada por un desprendimiento. Cuando se dan cuenta de que Juno les ha conducido a una cueva inexplorada y de que nadie va a venir a rescatarlas, surgen las tensiones. Pero sin otra opci&amp;oacute;n deciden adentrarse en la cueva rezando por que haya otra salida. La mujeres se enfrentan a las dificultades y desafios que encuentran en la cueva con determinaci&amp;oacute;n. Pero algo mas se oculta bajo la tierra, una raza de monstruosas criaturas que se ocultan de la luz, adaptados a vivir en la oscuridad. Cuando se dan cuenta de que se han convertido en presas se ven obligadas a desplegar sus instintos mas primarios para enfrentarse a los monstruos. Pero cuando viejas heridas se reabren y las lealtades se desintegran, las mujeres se enfrentan a la verdad mas horrible: es a ellas mismas a quien mas deben temer. Cuando Juno hiere accidentalmente a Beth y la abandona al darla por muerta, la moribunda Beth le revela a Sarah un secreto que cambiar&amp;aacute; la visi&amp;oacute;n que &amp;eacute;sta tiene de Juno para siempre. Sarah ya estaba al borde del colapso y esta revelaci&amp;oacute;n fractura aun mas su mente. Ella y Juno son las &amp;uacute;nicas supervivientes al final y mientras se preparan para &amp;uacute;ltima batalla la pregunta es: quien tiene las fuerzas para volver a la superficie y que tendr&amp;aacute;n que hacer para conseguirlo.","torrent":{"xt":"urn:btih:f02c7ae6d78a38c1b618180fb712dd86d04c3ea0","amp;dn":"The+descent+%5BSpanish%5D+%5BTeleSync%5D_CVCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02c7ae6d78a38c1b618180fb712dd86d04c3ea0","infoHashBuffer":{"type":"Buffer","data":[240,44,122,230,215,138,56,193,182,24,24,15,183,18,221,134,208,76,62,160]},"announce":[],"urlList":[]}}