{"title":"plot_to_seize_the_white_house.tar.bz2","uid":3429063,"size":15175680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0300d946dd8823b8922932ea86f5253391097c0&amp;dn=plot_to_seize_the_white_house.tar.bz2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"_deepfire","files":1,"time":1136686513,"description":"This is the true story of a remarkable American who, during the early New Deal years, was sought by wealthy plotters in the United States to lead a putsch to overthrow the government and establish an American Fascist dictatorship.\n\nAccording to retired Representative John W. McCormack, former Speaker of the House, if the late Major General Smedley Butler of the U.S. Marine Corps had not been a stubborn devotee of democracy, Americans today could conceivably be living under an American Mussolini, Hitler, or Franco.\n\nAn ironic aspect of the conspiracy General Butler unmasked is that few Americans have ever heard about it, or even know anything about the general. As children all of us were taught about the treason of Aaron Burr and Benedict Arnold, whose betrayals were safely cobwebbed by the distant past. But school texts that deal with the New Deal are uniquely silent about the powerful Americans who plotted to seize the White House with a private army, hold President Franklin D. Roosevelt prisoner, and get rid of him if he refused to serve as their puppet in a dictatorship they planned to impose and control.","torrent":{"xt":"urn:btih:f0300d946dd8823b8922932ea86f5253391097c0","amp;dn":"plot_to_seize_the_white_house.tar.bz2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0300d946dd8823b8922932ea86f5253391097c0","infoHashBuffer":{"type":"Buffer","data":[240,48,13,148,109,216,130,59,137,34,147,46,168,111,82,83,57,16,151,192]},"announce":[],"urlList":[]}}