{"title":"Jackie Chan@Twin &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;14506675737b7a67547e75777f3a756d7d6d3a777b79&quot;&gt;[email protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","uid":3446429,"size":177664700,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f0b331dec228ba172c166b279b42f132c7ba2182&amp;dn=Jackie+Chan%40Twin+Dragons%40jack.ayiy.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sexlan","files":5,"time":1140292286,"description":"Hong Kong, 1992\nU.S. Release Date: 4/9/99 (wide) \nRunning Length: 1:28\nMPAA Classification: PG-13 (Violence, mild sensuality) \nTheatrical Aspect Ratio: 2.35:1 \nCast: Jackie Chan, Maggie Cheung, Teddy Robin, Nina Li Chi\nDirectors: Ringo Lam and Tsui Hark\nProducer: Teddy Robin\nScreenplay: Barry Wong, Tsui Hark, Cheung Tung Jo, Wong Yik\nMusic: Michael Wandmacher, Phe Loung\nU.S. Distributor: Dimension Films \nDubbed into English \n\nThree characteristics make Jackie Chan unique among action film stars: (1) his fluidity with martial arts, (2) his insistence upon doing his own stunts, and (3) his finely tuned ability as a comic. While each of these aptitudes is in evidence in Twin Dragons, none stands out. Instead of highlighting the aspects that make Chan special, the script maroons him in a gulf of lame dialogue, failed farcical elements, and pathetic plotting. The only worthwhile portion of Twin Dragons is the climactic action sequence, but, to get to that, it&amp;#039;s necessary to endure more than an hour of unfunny physical comedy and excruciating verbal interaction. \n\nTwin Dragons is a seven-year old movie that Miramax/Dimension has touched up for American release. I&amp;#039;m not sure why. Chan fans are already familiar with the movie (it has been available on video for years), and they&amp;#039;re the only ones likely to be enticed into seeing it. If Miramax is determined to release the film under their label, a direct-to-video offering would have made better sense; perhaps the high gross of Rush Hour convinced the Disney-owned company that it might be able to make a few extra dollars by giving Twin Dragons a week or two in multiplexes. The film was not screened for critics - a sure sign that the distributor is going for the quick buck. \n\nIt&amp;#039;s surprising that so much talent could produce something so pointless. The directors, Ringo Lam and Tsui Hark, are two of Hong Kong&amp;#039;s most respected film makers. In front of the camera, Chan is joined by Maggie Cheung (Irma Vep), an actress capable of fine work. Perhaps the reason for Twin Dragons&amp;#039; lack of quality can be traced to its origins. According to a 1998 review written by Internet critic Christopher E. Meadows, the movie was a charity production undergone by the Hong Kong Director&amp;#039;s Guild. With that in mind, it wouldn&amp;#039;t be a shock to learn that less effort was invested in minor details like the screenplay. \n\nTwin Dragons&amp;#039; central conceit is the familiar &quot;twins separated at birth&quot; device. Chan plays two characters: Boomer, a tough-talking fellow who was brought up on the wrong side of the tracks, and John Ma, a concert pianist who knows as much about fighting as Boomer does about tickling the ivories. When a mix-up in identities has each of them assuming the other&amp;#039;s role (and developing a romance with a female associate of their counterpart), the plot is off and running on a series of wildly implausible comic scenarios that postulate what would happen if a mild-mannered man gets stuck in the midst of a gang war and if a thug is forced to conduct an orchestra. \n\nTwin Dragons offers fewer laughs than one might reasonably expect, although it does get high marks for campiness. The special effects are a source of unintentional chuckles. Every time Boomer appears on screen with John Ma, one of the images of Chan can be seen visibly wavering around the edges. And, as is often the case when a movie is dubbed, some of the poor synching between the English lines and the actors&amp;#039; lip movements looks laughably absurd. Unfortunately, when it comes to intentional humor, Twin Dragons fails about ten times as often as it works. \n\nAlthough the full range of Chan&amp;#039;s talents aren&amp;#039;t emasculated here (as they are in Rush Hour), neither are they exploited to their maximum advantage. Rather than relying on the actor&amp;#039;s natural, Buster Keaton-like capacity for physical comedy, Twin Dragons resorts to all sorts of so-silly-they&amp;#039;re-stupid gags revolving around characters mistaking Boomer for John Ma, and vice versa. It wouldn&amp;#039;t be so bad if it was vaguely funny, but it&amp;#039;s not. Maybe the problem is that, while it&amp;#039;s possible to dub the actors, the comedy still doesn&amp;#039;t translate. Those in search of memorable action sequences will also be disappointed. There&amp;#039;s only one (admittedly, it is an extended one), and it comes at the very end, with Boomer and John Ma facing off against the bad guys in a factory that tests cars for safety features. Overall, Twin Dragons has little to offer anyone except die-hard Jackie Chan fans.","torrent":{"xt":"urn:btih:f0b331dec228ba172c166b279b42f132c7ba2182","amp;dn":"Jackie+Chan%40Twin+Dragons%40jack.ayiy.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0b331dec228ba172c166b279b42f132c7ba2182","infoHashBuffer":{"type":"Buffer","data":[240,179,49,222,194,40,186,23,44,22,107,39,155,66,241,50,199,186,33,130]},"announce":[],"urlList":[]}}