{"title":"Floater - Angels in the Flesh and Devils in the Bone","uid":3403949,"size":46363686,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f23edb8f4438ade961b1cdbc0c91bead5b00555a&amp;dn=Floater+-+Angels+in+the+Flesh+and+Devils+in+the+Bone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"x3n0","files":17,"time":1130852429,"description":"1. Endless 1\n2. The Watching Song\n3. American Theatric\n4. The Feast\n5. The Beast\n6. Minister\n7. Medicine Woman\n8. Nothing\n9. Mexican Bus\n10. The Invitation\n11. Golden Head\n12. Settling\n13. The Last Time\n14. Our Hero's Resolve\n15. Mosquito\n16. The Possum's Funeral\n17. Endless II\n\nFloater began in 1993 when Robert Wynia (lead vocals, bass), Peter Cornett (drums), and Dave Amador (guitar), got together in Eugene, Oregon, making their start at garage parties and the U of O beer garden. With compelling lyrics and adept storytelling, their music shifts in mood from the insistent and heavy to the melodic and soulful, comprising the signature sound for which Floater is best known.\n\nFloater's regional success was noticed by Elemental Records, who put out their first full-length record, &quot;Sink&quot; in 1994. That same year Floater began a string of sold out shows at the Community Center for the Performing Arts (The WOW Hall) that is still unbroken to this day.\n\nIn 1995 Floater released &quot;Glyph&quot; and toured the country for the next two years supporting the record. The single, &quot;Danny Boy&quot; received heavy college and commercial radio play, in many cities outselling major label releases. Floater received nominations to the preliminary level of the Grammy's from NARAS (National Academy of Recording Arts and Sciences) in 1995 under Best Rock Performance for &quot;Sink&quot; and in 1996 under Best Alternative Performance for &quot;Glyph.&quot; (Prelims are determined by nominations from the NARAS members).\n\nIn 1998, following their move to Portland, Oregon (where the band currently resides), Floater released their third full-length record, &quot;Angels in the Flesh and Devils in the Bone.&quot; The second concept album by the band (&quot;Sink&quot; was the first), &quot;Angel's&quot; brought a new vibe to Floater. It wasn't long before widespread audiences came to embrace what has now become the band's trademark - their versatility. \n\nSeptember of 2000 brought the release of Floater's fourth full- length record, &quot;Burning Sosobra&quot;; a musical collection that explores the band's broad range of song writing. Following its release, the band began to perform live acoustically. Both the band and the fans enjoyed this new avenue of performance that allowed the &quot;quieter&quot; side of Floater to emerge and be explored. Of late, the band has begun playing shows where acoustic Floater opens for electric Floater - giving a sort of Jekyll and Hyde feel to their performances.\n\nThis year Floater released their most critically acclaimed record to date, &quot;Alter.&quot; Combining the bands strongest musical elements, &quot;Alter&quot; moves fluidly from heavy riffs to lullabies and tells flowing stories of fear, love and above all change.","torrent":{"xt":"urn:btih:f23edb8f4438ade961b1cdbc0c91bead5b00555a","amp;dn":"Floater+-+Angels+in+the+Flesh+and+Devils+in+the+Bone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23edb8f4438ade961b1cdbc0c91bead5b00555a","infoHashBuffer":{"type":"Buffer","data":[242,62,219,143,68,56,173,233,97,177,205,188,12,145,190,173,91,0,85,90]},"announce":[],"urlList":[]}}