{"title":"Eric Phelps - Vatican Assassins (recent interview 120 min.)","uid":3426484,"size":76311360,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f2bbc15cb60595277b7a5fcba85ddccf1e7206d5&amp;dn=Eric+Phelps+-+Vatican+Assassins+%28recent+interview+120+min.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shakewell","files":1,"time":1136082693,"description":"Eric Phelps is the author of a book called Vatican Assassins. He has a website http://www.vaticanassassins.org . He is a frequent guest on http://www.cloakanddagger.de radio cybercast (Lenny Bloom Show). His work is based upon the premise that the Jesuit Order has been controlling world history for several centuries (Kind of like a behind-the-scenes evil cabal). You could call it a &quot;conspiracy theory&quot; but is quite interesting. Dunno how much of it is true. But when you listen to Eric Phelps long enough, some weird beliefs bubble to the surface; his conspiracy allegations are based on alleged factual material, however his messianic christian conclusions seem to be based entirely on faith. Still, it's a real hoot to listen to Phelps explain alternate history, vis-a-vis the Jesuits. Here much of the same material from Cloak and Dagger takes a more cohesive form, including detailed discussions of WWII. This file is a recent interview from a Christian website called &quot;Peering Into the Darkness.&quot; It was a four-part series, and what you have here are all four parts joined into one file. I edited out huge chucks of banter made by the hosts, which were not relevant to Phelps' material. The time comes in just under 80 minutes, which allows people to burn this interview onto an ordinary 80-min. CD-ROM.","torrent":{"xt":"urn:btih:f2bbc15cb60595277b7a5fcba85ddccf1e7206d5","amp;dn":"Eric+Phelps+-+Vatican+Assassins+%28recent+interview+120+min.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bbc15cb60595277b7a5fcba85ddccf1e7206d5","infoHashBuffer":{"type":"Buffer","data":[242,187,193,92,182,5,149,39,123,122,95,203,168,93,220,207,30,114,6,213]},"announce":[],"urlList":[]}}