{"title":"Jeremiah DivX","uid":3494220,"size":814559218,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f3626e937ced69050cd46bf3111122468d049d7a&amp;dn=Jeremiah+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bucky katt","files":1,"time":1149933092,"description":"Runtime: 90 min.\n\nAudio: English\n\nThe young Jeremiah grows up in a priest&amp;#039;s family in the village of Anathoth, near Jerusalem. God appears to Jeremiah in different human guises on several occasions, and makes it clear to him that he has been selected to announce God&amp;#039;s message to the people of Jerusalem: a mighty ruler from the north will attack the Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One God. No-one in Anathoth believes Jeremiah&amp;#039;s prophecy, however. Instead, he is accused of blasphemy and is physically attacked - and not even his family comes to his aid. Nevertheless, with the help of Baruch, a temple scribe who hears Jeremiah&amp;#039;s first sermon and becomes his disciple, Jeremiah succeeds in announcing the word of God. The prophet&amp;#039;s message of impending doom incurs only the wrath and rejection of the ruling classes, the priesthood and the King. Jeremiah can find no audience, and lands up in captivity again - but even though he even has to leave his true love for Judith to fate, he still sticks firmly to his mission. It is only when war with the enemy forces from Babylon seems inevitable that the people of Jerusalem start to grow restless, and Jeremiah gradually starts to win support. However the King, who is taking the advice of the false prophet Hananiah, is certain that the country&amp;#039;s powerful neighbours, the Egyptians, will come to his assistance. Shortly afterwards, however, the Babylonians lay siege to the Holy City. Although the King now believes Jeremiah, he still finds it impossible to make the decision to surrender the city. Jerusalem goes up in flames, and the people are led off into exile in Babylon.\n\n\nCTCA","torrent":{"xt":"urn:btih:f3626e937ced69050cd46bf3111122468d049d7a","amp;dn":"Jeremiah+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3626e937ced69050cd46bf3111122468d049d7a","infoHashBuffer":{"type":"Buffer","data":[243,98,110,147,124,237,105,5,12,212,107,243,17,17,34,70,141,4,157,122]},"announce":[],"urlList":[]}}