{"title":"[PSP].Astonishia.Story.[JAP]..By.INGEN.up.by..rar","uid":3395166,"size":113475497,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:f39e7443f8e18089e32d1fe5d0f84216aadb3c8a&amp;dn=%5BPSP%5D.Astonishia.Story.%5BJAP%5D..By.INGEN.up.by..rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thedios","files":1,"time":1129052254,"description":"www.emulebit.com\n\nAstonishia Story Told On PSP\nKorean developer Sonnori's RPG sets off for adventure on a handheld yet again.\nby Nix \n July 15, 2005 - We haven't heard as much out of Korea as we expected when the system was launched surprisingly early for a new system release, and then given special Korean net apps to make the system that much bigger there. Korean developers were amongst the very first to sign up for PSP, but production difficulties and territory priorities have held some teams back from fully supporting the system. That said, production is continuing to ramp up in Korea, with games like Beatbox Studio, Vulcanus and Project Econia still in the works for the system by Korean game makers. \n\n\nAdded to that list is a new version of Korean developer Sonnori's RPG series, Astonishia Story . The game is based on a short series of PC RPGs dating back to 1994, and previously made portable on GamePark's little-known Korean handheld system, the GP32 \nThough not yet announced for the US market, this RPG is a single-player 2D adventure that the team plans to release on UMD for the Korean market by the end of the year. The Sonnori Mobile Team is making use of the PSP's display to display the sprite-based game in widescreen and with more rich colors. We weren't able to parse much more info out of the Korean press release for the game, but Korean website Ruliweb.com was able to score a slew of exclusive Astonishia Story for PSP screenshots, which speak for themselves to old-school RPG gamers. \n\n\n(*Image courtesy Ruliweb)  \n \n\n\nIt is unknown if this game will come out in America, but there was positive talk from the small crowd of importers back when the GP32 was released about this RPG. Keep an eye out for this at Korean game import shops if you're interested, and look for more news on this game here if the game gets picked up for US distribution.","torrent":{"xt":"urn:btih:f39e7443f8e18089e32d1fe5d0f84216aadb3c8a","amp;dn":"%5BPSP%5D.Astonishia.Story.%5BJAP%5D..By.INGEN.up.by..rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f39e7443f8e18089e32d1fe5d0f84216aadb3c8a","infoHashBuffer":{"type":"Buffer","data":[243,158,116,67,248,225,128,137,227,45,31,229,208,248,66,22,170,219,60,138]},"announce":[],"urlList":[]}}