{"title":"Scientific American Magazine Feb 06 PDF","uid":3430925,"size":8219817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f53d03c7f69c4896cf677de134a14a87e5e25464&amp;dn=Scientific+American+Magazine+Feb+06+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Invictus_","files":1,"time":1137087240,"description":"Content:\n\n# Plasma Accelerators A new type of particle accelerator, compact enough to fi t on a tabletop, should cut the size and expense of colliders and unleash a wealth of  lower-energy applications.\n\n# Intrigue at the Immune Synapse When cells of the immune system converse, they communicate through short-lived structures surprisingly like those between neurons  in the nervous system.\n\n# Thwarting Nuclear Terrorism Many civilian research reactors contain highly  enriched uranium that terrorists could use to build nuclear bombs. More must be done to  contain this threat.\n\n# Protecting New Orleans As reconstruction begins on the hurricane-ravaged Gulf Coast, engineers contemplate how to protect New Orleans and other cities against fierce future storms and rising sea levels.\n\n# Miniaturized Power With nanobatteries, power sources fi nally start to shrink with the rest of electronics.\n\n# Owning the Stuff of Life Patents on DNA have not caused the severe disruptions of biomedical research and societal norms anticipated by critics. But the deluge may be yet to come.\n\n# Putting a Face on the First President The middle-aged George Washington?s picture is as close as the nearest dollar bill, but no surviving portraits show him as a young man. A forensic anthropologist uses computers to depict him.","torrent":{"xt":"urn:btih:f53d03c7f69c4896cf677de134a14a87e5e25464","amp;dn":"Scientific+American+Magazine+Feb+06+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53d03c7f69c4896cf677de134a14a87e5e25464","infoHashBuffer":{"type":"Buffer","data":[245,61,3,199,246,156,72,150,207,103,125,225,52,161,74,135,229,226,84,100]},"announce":[],"urlList":[]}}