{"title":"Dinner At Eight (1933) Disk1.avi","uid":3419338,"size":1066045440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5e08003f3a0d2a110e7ce468b8cd271b816d214&amp;dn=Dinner+At+Eight+%281933%29+Disk1.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goblin1","files":1,"time":1134151418,"description":"DINNER AT EIGHT (Metro-Goldwyn-Mayer, 1933), directed by George Cukor, MGM's second attempt with an all-star production following the success to GRAND HOTEL (1932), is a remarkable as well as memorable movie that has benefited from repeated viewings over the past years. As with GRAND HOTEL, DINNER AT EIGHT was adapted from a stage play (by George S. Kaufman and Edna Ferber), and reunites some of its GRAND HOTEL performers, including John and Lionel Barrymore, Wallace Beery and Jean Hersholt. Unlike GRAND HOTEL, DINNER AT EIGHT is one of the best movies ever assembled to not receive a single Academy Award nomination. Even though it would be difficult to pinpoint which of the major stars might have been worthy of that honor, a Best Picture nominee would have spoken for the entire cast. In the usual manner of all star productions, of the major leads, all introduced with each face framed in a dinner plate, the one whose name comes first is the one with either the least amount of screen time or the one whose character enters late into the story. The star in question is Marie Dressler, a top-name at the time, leaving a big impression with her limited performance, and yet, it is Billie Burke as Millicent Jordan whose presence is felt throughout mainly because it's her dinner party.\n\nEnjoy and please seed.\n\nI'll be upping disk 2 as soon as this can walk on its own.\n\nthis is a great TV RIP with res. of 640*480, and a video bitrate of 2411.\n\nIf you love classics, this is a must have.","torrent":{"xt":"urn:btih:f5e08003f3a0d2a110e7ce468b8cd271b816d214","amp;dn":"Dinner+At+Eight+%281933%29+Disk1.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e08003f3a0d2a110e7ce468b8cd271b816d214","infoHashBuffer":{"type":"Buffer","data":[245,224,128,3,243,160,210,161,16,231,206,70,139,140,210,113,184,22,210,20]},"announce":[],"urlList":[]}}