{"title":"Combat Task Force 121 [English]","uid":3307719,"size":585686334,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f6ead173aae80634640b53572b1c1a5345450d58&amp;dn=Combat+Task+Force+121+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pctorrent","files":6,"time":1111969190,"description":"After years of simmering unrest, Marxist Rebels have obtained a foothold within the Armed Services and found sympathetic comrades to lend both a voice and weapons. While a full blown coup d'etat is not yet underway, a few early high profile rebel victories could quickly turn the tide. U.S. forces have been called in to put a halt to these terrorist acts.\n \n  You are a member of Task Force 121, an elite covert unit comprised of Navy Seals, Green Berets, Army Rangers and USMC Racon personnel -- deployed with lightning speed into terrorist hotspots around the globe, striking with devastating force and then vanishing. \n \n \nFEATURES:\n\n  * 10 exciting single player missions take you through a variety of locales\n    including dense jungle, shanty town, oil rig, refinery plant and an\n    exotic island. Day and night missions add to the challenge and realism.\n \n  * Use a variety of authentic military weapons such as USP Pistol, M4\n    Assault Rifle with M203 Grenade Launcher, MP5 SD, Mk43 7.62mm Machine\n    Gun, M1 Combat Shotgun, .50 Cal Tactical Sniper Rifle, C4 charge, Grenade\n    and Combat Knife.\n \n  * Exciting online play with up to 16 players via LAN. Deathmatch, King of\n    the Hill, Capture the Flag, VIP Escort and Last Man Standing game modes\n    are available (along with team variants).\n \n  * State of the art graphics by the UNREAL Championship engine.\n \n  * Fully scripted storyline immerses the player in the action.","torrent":{"xt":"urn:btih:f6ead173aae80634640b53572b1c1a5345450d58","amp;dn":"Combat+Task+Force+121+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ead173aae80634640b53572b1c1a5345450d58","infoHashBuffer":{"type":"Buffer","data":[246,234,209,115,170,232,6,52,100,11,83,87,43,28,26,83,69,69,13,88]},"announce":[],"urlList":[]}}