{"title":"Jansa - Premiki - The making of the Slovenian state (1988-92) -","uid":3494277,"size":3157370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f71820c4e75cd0511b471dbf22747311e5416222&amp;dn=Jansa+-+Premiki+-+The+making+of+the+Slovenian+state+%281988-92%29+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"red_gonzo","files":1,"time":1149938406,"description":"This is Janez Jansa&amp;#039;s historical account of the independence war in Slovenia included in his book The making of the Slovenian state (1988-92) - The collapse of Yugoslavia (1994) (original title &quot;Premiki&quot;). Jansa, who is currently in process of becoming Slovenia&amp;#039;s next prime minister, is a graduate in defence sciences and was political active in communist regime writing for alternative newspapers. His provocative writings and analyses soon made him a political prisoner which initiated the people&amp;#039;s movement towards changes. Since then Jansa&amp;#039;s political career skyrocketed upwards as he was one of the key people involved in independence war and events after that. Then being in position of Slovenia&amp;#039;s defence secretary he as an insider is able to give exact account of not only political activities during the war but also of military plans and tactics which brought the final victory of Slovenian forces towards much superior Yugoslavian army.  A dramatic account of how this most northern country of ex-Yugoslavia initiated its collapse and how the success of this endeavour motivated other republics to do the same which resulted in a bloody war. Book is covered with many details and an exact military plan which brought the final victory. 295 pages, many pictures and military documents.\n\nFrom the backcover:\nA book  about the period in which Slovenia&amp;#039;s independence came to fruition, and about the people who emerged elong with it. It is about their expectations, setbacks, struggles, sweat, blood, bitterness and victory. A book about the day when dreams were finally permitted, and about those people who dared not dream. It is about the fateful, difficult moments of decision and about that side of war which is not seen on TV screens and at press conferences. It is a book of alternative documents and photographs. The book of a dissident who became defence minister on this blood-stained but now brighter side of the Alps.\n","torrent":{"xt":"urn:btih:f71820c4e75cd0511b471dbf22747311e5416222","amp;dn":"Jansa+-+Premiki+-+The+making+of+the+Slovenian+state+%281988-92%29+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71820c4e75cd0511b471dbf22747311e5416222","infoHashBuffer":{"type":"Buffer","data":[247,24,32,196,231,92,208,81,27,71,29,191,34,116,115,17,229,65,98,34]},"announce":[],"urlList":[]}}