{"title":"Obscure [DVD][English]","uid":3314222,"size":4296971342,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f72facec71670ecd3f384d6175b35398a9160f5d&amp;dn=Obscure+%5BDVD%5D%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pctorrent","files":5,"time":1113007879,"description":"In this school they teach you things you never wanted to know about.\n\n \n\nInspired by the teen horror genre, made popular by a number of recent movies and primetime TV shows, Obscure follows a group of 5 American students as they try to unravel the mysterious happenings and disappearances that keep occurring at their school. Through the long eerie corridors and dark hallways of Leafmore, Shannon, Kenny, Ashley, Stan and Josh will come to learn that the night will be long and survival not easy.\n\n \n\nFeatures:\n\n \n\nÂ·          Unique multiplayer option - Hot plug and play feature, meaning a second player can join or leave the game at any time, a never before seen feature in this genre.\n\nÂ·          Interchangeable characters - switch between characters at any time with the 2nd character being controlled by either a second player or the game's innovative A.I. Customise the way you play with each student having unique skills.\n\nÂ·          Mutual aid system - interactivity between characters during fights, inventory management, riddle solving\n\nÂ·          AI controlled settings - set the behavior of the A.I. controlled follower to attack, defense, help...","torrent":{"xt":"urn:btih:f72facec71670ecd3f384d6175b35398a9160f5d","amp;dn":"Obscure+%5BDVD%5D%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72facec71670ecd3f384d6175b35398a9160f5d","infoHashBuffer":{"type":"Buffer","data":[247,47,172,236,113,103,14,205,63,56,77,97,117,179,83,152,169,22,15,93]},"announce":[],"urlList":[]}}