{"title":"Bookends 8.1.2 (OSX) (crack incl.)","uid":3487478,"size":13383997,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f7d24e46c52d02a0cd4819c76671cae27f29b54c&amp;dn=Bookends+8.1.2+%28OSX%29+%28crack+incl.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anderstralala","files":1,"time":1148252588,"description":"A Endnote replacement which isn&amp;#039;t bug ridden and bloated resource hog. Crack included. Please buy this software if you are satisfied with it, I have!\n\nFrom developer:\n\n&quot;Bookends is a full-featured and cost-effective bibliography, reference, and information management system for students and professionals.\n\nBookends runs in Mac OS X 10.2 or later. Text is entered and stored as Unicode, so you can mix Roman (English, French, German, etc.) and non-Roman (Japanese, Greek, Hebrew, etc.) characters.\n\nWith Bookends you can directly search for and import references from many online sources, including the Library of Congress, PubMed, Amazon, and hundreds of libraries from around the world.\n\nSearch PubMed automatically in the background and have Bookends discover and notify you of publications of interest as soon as they appear.\n\nImport references from EndNote, Papyrus, Reference Manager, and ProCite databases. Here are step-by-step instructions.\n\nScan your manuscripts to generate finished versions ready for submission or publication, with full in-text citations and bibliographies that meet the most exacting requirements. Plug-ins let you access the power of Bookends from within Microsoft Word X/2004. Mellel is &quot;Bookends-aware&quot;, with special features to manage citations and bibliographies. Bookends can also scan manuscripts written with Nisus Writer Express via a macro or any document saved in RTF format by Apple&amp;#039;s Pages or any other word processor.\n\nServe yourself! Bookends contains an HTTP server. This means that you can enable Bookends to respond to search queries over the Internet and have it return formatted references (such as bibliographies) to a browser on any platform (with optional password/IP address restrictions).\n\nAttach one or more files to a reference and with a single click open it in Bookends or the application that created it. For example, search for an article and, if present on your hard disk or server, instantly open its pdf file. Have Bookends rename and organize your pdf files with a simple drag and drop.\n\nGot iPod? Want to take your references (including abstracts) with you? You can with Bookends. Here are the details.&quot;\t\t","torrent":{"xt":"urn:btih:f7d24e46c52d02a0cd4819c76671cae27f29b54c","amp;dn":"Bookends+8.1.2+%28OSX%29+%28crack+incl.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d24e46c52d02a0cd4819c76671cae27f29b54c","infoHashBuffer":{"type":"Buffer","data":[247,210,78,70,197,45,2,160,205,72,25,199,102,113,202,226,127,41,181,76]},"announce":[],"urlList":[]}}