{"title":"Age of Pirates: Caribbean Tales [PC][ENG][RUS]","uid":3493962,"size":1872450118,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f891b3cba7cfa5f82f8d6a91d336da366643a45c&amp;dn=Age+of+Pirates%3A+Caribbean+Tales+%5BPC%5D%5BENG%5D%5BRUS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"starkpl","files":1,"time":1149875790,"description":"This is the BETA version of the game that has not go out yet - Age of Pirates. You may have some problems with english subtitles, but generaly it works. And sorry for my poor english ;)\n\n\nAn RPG from the creators of Sea Dogs and Pirates of the Caribbean, the most acclaimed pirate simulations throughout the world. Based on the next generation sea engine STORM, The Age of Pirates represents utmost graphical experience. \n\nThe world of The Age of Pirates is 16 islands and the endless sea waters of the living Caribbean. You can dare assume the role of any of the two main characters, each with his own spectacular story. Over 16 types of ships will be at your disposal! Hire officers to improve your sailing abilities, and fighters - to help you in boarding and melee encounters. Fight foreign ships, capture prizes to sail them and prisoners to trade them at slave markets. Attack forts to conquer colonies, and then develop the colonies to produce more goods attracting more colonists. \n\nAdvanced AI of the foreign captains allows them to sail, trade, capture and develop colonies all on their own - so think first before underestimating your rivals in the race for domination! No quarter is spared! The Age of Pirates is the freedom of sailing, trading, fighting and development - and the unlimited exploration of the real Caribbean.","torrent":{"xt":"urn:btih:f891b3cba7cfa5f82f8d6a91d336da366643a45c","amp;dn":"Age+of+Pirates%3A+Caribbean+Tales+%5BPC%5D%5BENG%5D%5BRUS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f891b3cba7cfa5f82f8d6a91d336da366643a45c","infoHashBuffer":{"type":"Buffer","data":[248,145,179,203,167,207,165,248,47,141,106,145,211,54,218,54,102,67,164,92]},"announce":[],"urlList":[]}}