{"title":"AutomatixCD-1.0rc1.iso","uid":3458025,"size":507854848,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:fb109801cb28bb15ddb47ce7862b31d50edfb709&amp;dn=AutomatixCD-1.0rc1.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"minghai","files":1,"time":1142477154,"description":"AutomatixCD-1.0rc1\nMore info here: http://ubuntuforums.org/showthread.php?t=87382&amp;page=7\n\n&lt;&lt; this file is in-sync with Automatix CD 1.0rc1 &gt;&gt;\n\n=========================================\n AUTOMATIX CD - almost stable version :)\n   (although still a bit experimental)\n=========================================\n\n    Please read this text carefully before using Automatix CD - that way you&amp;#039;ll\navoid most of the common problems.\n\n    You can also take a look at &quot;IMPROVEMENTS.txt&quot; file.\n\n==============\n INTRODUCTION\n==============\n    There is something that is called &quot;Automatix&quot;. It is a small program written\nmostly by arnieboy, which downloads and install plenty of cool apps, which are\nnot inside Ubuntu by default, but they are REALLY needed (like MP3 playback\nsupport, OpenOffice upgrade to 2.0.0, etc.). Automatix CD does almost exactly\nthe same, but ...\n\n    ... INTERNET CONNECTION IS NOT REQUIRED!!! The CD is here for all those\nfolks with modem or without the internet at all.\n\n    It contains all of the applications installed by Automatix, including those\npurely internet-related (P2P clients, etc.). It is not limited in any way (when\ncompared to the original Automatix), so it can be also useful whenever you want\nto run Automatix on a lot of computers inside a network of your own. That way,\nyou don&amp;#039;t need to download the same files over and over again.\n\n    There is one exception, however (it is described at the end of\nthe LIMITATIONS chapter).\n\n====================================\n SUPPORTED SYSTEMS (x86 based only)\n====================================\n    These scripts SHOULD work under the following distributions:\n     - Ubuntu 5.10, with or without kubuntu-desktop,\n     - Kubuntu 5.10, with or without ubuntu-desktop,\n     - Ubuntu Server 5.10 with installed ubuntu-desktop, kubuntu-desktop or both.\n\n==============\n INSTRUCTIONS\n==============\n    First of all - YOU CANNOT EXECUTE THE SCRIPTS INCLUDED HERE\nSTRAIGHT FROM THE CD (but look below into option 3).\n\n    To use this CD properly, you have 4 options (at least ;) ):\n\n    1. for novice users:\n    Copy the &quot;installer&quot; directory from the CD to the location of your choice\n(you can use drag&amp;drop in either Nautilus or Konqueror), then execute\n&quot;Automatix-CD-install&quot; from there.\n\n    2. for novice users with a lot of diskspace :)\n    You can also copy the whole contents of the CD, and that way everything\nwill work from the harddisk (it means: faster and safer). This is the\nRECOMMENDED WAY, it is also needed if you intend to use the\n&quot;download-restricted&quot; script described above.\n\n    3. for slightly more advanced users:\n    Edit the &quot;etc/fstab&quot; file (as root) and add there the &quot;exec&quot; bit to your\nCD-ROM mount path. For example, you should exchange the following line:\n        /dev/hdc   /media/cdrom0   udf,iso9660 user,noauto   0   0\n    with the following one:\n        /dev/hdc   /media/cdrom0   udf,iso9660 user,noauto,exec   0   0\n\n    The contents of your /etc/fstab may be slightly different from the example\nabove, so CREATE A BACKUP of that file beforehand.\n\n    After remounting the CD, you will be able to execute this script straight\nfrom the CD, without copying.\n\n    4. for &quot;tweakers&quot; (NOT FOR NEWBIES !!!):\n    You can execute the script &quot;AutomatixCD-synaptic&quot;, or &quot;AutomatixCD-shell&quot;.\nThese will execute either Synaptic (even in Kubuntu) or bash shell within\nterminal with the &quot;/etc/apt/sources.list&quot; listing single repository - the\ncontents of this CD. After exiting the &quot;sources.list&quot; is switched back. I found\nthat very convenient while debugging this CD, but there are other useful\napplications of these scripts.\n\n    One of the applications of option 4 is, that you can add YOUR OWN PACKAGES\nto the &quot;pool&quot; subdirectory (and also update some of the original Automatix CD\nones from the &quot;debs&quot;, &quot;debs-restricted&quot; subdirectories), execute &quot;refresh-pool&quot;\ncontained therein, burn the CD prepared that way, and then select your additional\npackages to install through &quot;AutomatixCD-synaptic&quot; by using the nicely designed\nSynaptic GUI :). The best part is that the changes introduced that way will be\ncompletely transparent to the &quot;AutomatixCD-install&quot; script.\n\n    Please also read the &quot;LIMITATIONS&quot; chapter below...\n\n    The file &quot;LICENSES.txt&quot; also contains (brief) information about all the\nlicenses you have to agree to when you want to use this CD.\n\n============\n IMPORTANT!\n============\n    Automatix CD has been tested ONLY on fresh installations without updates\nat all. So, you should install from Automatix CD even BEFORE APPLYING SECURITY\nUPDATES! It is POSSIBLE that it will work after updates, but I cannot guarantee\nthat, and I cannot predict the future... so, if you decide to use this after\naltering your system previously - you risk blowing off your whole desk :)\n\n    In order to fully experience the &quot;offline&quot; nirvana you can just unplug\nyour network cable during the installation phase of (K)Ubuntu :)\n\n    Small hint for newbies:\n    When you&amp;#039;re disconnected and your system seems to hang during startup after\ndisplaying a message &quot;Synchronizing clock to ntp.ubuntulinux.org&quot; - simply\npress Ctrl+C. You can avoid this inconvenience by either reconnecting\n(physically) to the internet after using this Automatix CD\nor (if you don&amp;#039;t intend to connect to the internet at all) by issuing a command\n&quot;sudo update-rc.d -f ntpdate remove&quot; from a terminal (Gnome Terminal in Ubuntu\nor Konsole in Kubuntu).\n\n    There is also a script - pool/refresh-pool. Use it whenever you have either\nadded contents inside pool/debs-* directory or upgraded some packages on your own.\n\n    That is, whenever you have improved this CD - in that case, it could be also\nreally nice if you&amp;#039;d like to share this with others :). This script ensures, that\nthe *.gz files will be up to date, and will not confuse apt-get.\n\n==============\n LIMITATIONS:\n==============\n    It is not an exact copy of Automatix, it is based on a mixture of various\nversions of main Automatix scripts, ranging from 4.0 and up to 5.5.5. Whether\nit is a limitation or not - depends on your expectations ;). The main effort\nhere was to achieve almost exactly the same effect of executing the original\nAutomatix, while doing it FASTER and not requiring internet connection at all.\nSmall exceptions to that are pointed out below:\n\n - just before Automatix CD installer exits, all Ubuntu/Kubuntu/Server\ninstallation CDs are commented out (disabled) from the sources.list; for\nevery installation CD you intend to use after installing anything from the\nAutomatix CD you need to issue the command &quot;sudo apt-cdrom add&quot; to re-add these\nafter finishing work with Automatix CD).\n    Reason: actually it is rather the limitation of the dpkg itself;\nI still don&amp;#039;t know how to force apt-get to &quot;prefer&quot; the unsigned repository\nover the signed one, so I have to clear the sources.list temporarily, but\nthis has the side-effect of breaking the &quot;cdrom:[...]&quot; repositories), and\nsigning the internal repository with GPG is just not worth the effort IMHO.\n    Even if we assume, that the problem above is solved, the whole script\nshould be checked against &quot;CD swapping&quot;; it is not very convenient to\nswap CDs during the installation process ;), but for now, we just have to deal\nwith that small glitch.\n\n - both Firestarter and Azureus have been disabled (but not removed from the CD,\ncommented out instead), If you want to try these anyway, and you really know what\nyou are doing, you can try to install and configure these using option 4\ndescribed above.\n    Reason: mainly because of the Ubuntu Server support; Firestarter seems not\nvery stable, and therefore not very secure. Azureus seems broken, or at least\nnot dpkg-aware; it tries to autoupdate itself, fails miserably in the middle\nof that, also it has some dependency problems: it uses some weird java libraries,\nand in turn conflicts with eclipse-3.1.1 packages.\n\n - Windows&amp;#039; codecs and DVD playback capability packages are not included by\ndefault. If you want to install these offline - you can play with the script\n&quot;download-restricted&quot; (READ EVERYTHING INSIDE IT FIRST), then re-author the CD.\nScripts should work unmodified after injecting these restricted packages.\n    Reason: all that &quot;licensing&quot; crap - No one wants to go to jail :)))\n\n=================\n DESIGN FLAWS :)\n=================\n    This chapter is basically an excuse to bad programming habits :). Feel\nfree to improve anything described here:\n\n - The detection of the &quot;pool&quot; directory location is poor. If anything goes \nwrong, delete the file &quot;.automatix-cd/pool-location&quot; from your home directory\nand try again. You can improve the situation yourself - inside the\n&quot;installer/scripts-internal/locate-pool&quot; the whole procedure is described in\nmore detail.\n\n - the password is asked only once thorough the whole installation process.\nHowever, it is achieved by temporarily reconfiguring &quot;/etc/sudoers&quot; - and\nI consider that an ugly hack :(. Maybe you&amp;#039;ll have a better solution - take\na look inside the &quot;sudo-nopasswd&quot; and &quot;sudo-revert&quot; scripts. Bear in mind,\nthat any mistake here can result in a big disaster.\n\n - expect some bugs here and there. It has been thoroughly tested on a fresh\ninstallation of all supported systems. Bear in mind, however, that testing\neverything is not possible, A LOT of small changes, and some big ones were\nintroduced into Automatix, which itself has its own problems... I am short on\ntime, so I cannot guarantee anything.\n\nGood luck!\nMichal Skrzypek &lt;&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;036e6a606b626f70436e62776b2d766d6a2d6f6c67792d736f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;&gt;\n\n(other contributors - most notably arnieboy, the author of the original\n Automatix, are listed at the beginning of the file &quot;automatix-main&quot;\n located inside the directory &quot;scripts-internal&quot;. You can also see the\n full list of contributors every time you run the main installer)\n","torrent":{"xt":"urn:btih:fb109801cb28bb15ddb47ce7862b31d50edfb709","amp;dn":"AutomatixCD-1.0rc1.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb109801cb28bb15ddb47ce7862b31d50edfb709","infoHashBuffer":{"type":"Buffer","data":[251,16,152,1,203,40,187,21,221,180,124,231,134,43,49,213,14,223,183,9]},"announce":[],"urlList":[]}}