{"title":"La monja [Xvid][TS]","uid":3421490,"size":733755858,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb5342435b607b0f5f8b6a08cf3437d4a6ddbae0&amp;dn=La+monja+%5BXvid%5D%5BTS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"IcDeR","files":1,"time":1134745948,"description":"La noche de su graduaci&amp;oacute;n, Eva (Anita Briem) presencia como su madre muere en extra&amp;ntilde;as circunstancias. Aunque la polic&amp;iacute;a apunta a un posible suicidio, a Eva le ha parecido ver, en la oscuridad de la cocina, a una monja degollan-do a su madre. Hija &amp;uacute;nica y sin padre conocido, Eva debe afrontar el futuro sola. Adem&amp;aacute;s ahora, Julia (Bel&amp;eacute;n Blanco), su mejor amiga, regresa a Espa&amp;ntilde;a para pasar las vacaciones con su novio. Julia, en el cementerio, insiste a Eva para que les acompa&amp;ntilde;e. Ser&amp;aacute; la llega-da inesperada de Cristy (Tet&amp;eacute; Delgado), una compa&amp;ntilde;era del interna-do al que iba su madre de peque&amp;ntilde;a, y la noticia del asesinato de otra amiga de forma parecida, lo que reafirma la sospecha de Eva sobre el asesinato de su madre. Cristy le cuenta que ella y su ma-dre ten&amp;iacute;an planeado ir a Barcelona a reunirse con sus otras compa-&amp;ntilde;eras. Pero antes de poder darle m&amp;aacute;s informaci&amp;oacute;n, Cristy muere accidentalmente al quedar atrapada en las puertas del ascensor del hotel en el que se hospedaba... O puede que no haya sido un acci-dente... Eva decide ir a Barcelona con Julia. Quiere reunirse con el resto de compa&amp;ntilde;eras del internado y averiguar qu&amp;eacute; es lo que est&amp;aacute; sucediendo. Cuando llega a la Ciudad Condal se dirige al archivo religioso donde un chico, Gabriel (Manu Fullola), se ofrece para tra-ducirle documentos. Con su ayuda, descubren que la monja desa-pareci&amp;oacute; misteriosamente del internado en 1987. Eva se apresura a reunirse con el resto de las mujeres y encuentra a otra de las ami-gas crucificada en su casa. En el contestador autom&amp;aacute;tico hay un mensaje de sus compa&amp;ntilde;eras cit&amp;aacute;ndola directamente en el interna-do. Si quiere resolver el enigma, Eva deber&amp;aacute; ir al internado, el lugar en el que, seg&amp;uacute;n ellas, todo empez&amp;oacute;. Lo que ellos no saben es que all&amp;iacute; deber&amp;aacute;n enfrentarse a una amenaza sobrenatural e incomprensi-ble. Para intentar salvar a sus amigos, Eva descubrir&amp;aacute; que es la &amp;uacute;nica que puede acabar con ese ominoso ser y sus brutales actos, pues la raz&amp;oacute;n de esa presencia fantasmal est&amp;aacute; &amp;iacute;ntimamente ligada a su propia existencia.\n","torrent":{"xt":"urn:btih:fb5342435b607b0f5f8b6a08cf3437d4a6ddbae0","amp;dn":"La+monja+%5BXvid%5D%5BTS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5342435b607b0f5f8b6a08cf3437d4a6ddbae0","infoHashBuffer":{"type":"Buffer","data":[251,83,66,67,91,96,123,15,95,139,106,8,207,52,55,212,166,221,186,224]},"announce":[],"urlList":[]}}