{"title":"Goal! 2005","uid":3411595,"size":723396608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fba7937fdad7c35390dbf1a6812d02647191f064&amp;dn=Goal%21+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jonkybonky","files":1,"time":1132502746,"description":"Goal!\n\n\n      \n    Regi: Danny Cannon\nFoto: Michael Barrett\nManus: Dick Clement, Ian La Frenais\nGenre: Drama\nSkuespillere: Kuno Becker, Stephen Dillane, Alessandro Nivola, Anna Friel, Marcel Iures, Sean Pertwee, Lee Ross, Stephen Graham, Kevin Knapman, Kieran O'Brien, Cassandra Bell, Tony Plana, Miriam Colon, David Beckham, Ra&amp;uacute;l, Alan Shearer, Zin&amp;eacute;dine Zidane \nNasjonalitet: England\nSpr&amp;aring;k: Engelsk\nProdusent: Mike Jefferies, Matt Barrelle\nProduksjonsselskap: Milkshake Films, Buena Vista Pictures International\nMusikk: Graeme Revell\nFormat: Cinemascope\nLengde: 1 t. 58 min.\nDistribusjon: Buena Vista International\nProduksjons&amp;aring;r: 2005\n\n\n\n\nHANDLINGEN:\n\n Som alle andre barn har Santiago Munez en stor dr&amp;oslash;m. Men i motsetning til de fleste andre barn har han f&amp;aring;tt en enest&amp;aring;ende mulighet til &amp;aring; realisere dr&amp;oslash;mmen - hvis han er villig til &amp;aring; legge alt det han frykter til siden, reise tusenvis av mil hjemmefra og klare seg blant noen av de beste i verden. Det intense presset og personlige forsakelser skal vise seg &amp;aring; bli kostbart for Santiago p&amp;aring; hans vei - men vil det v&amp;aelig;re nok til &amp;aring; hindre denne begavede, m&amp;aring;lbevisste unge mannen og nybakte helten i &amp;aring; n&amp;aring; sitt endelige &quot;goal&quot;?\n\nDramaet om det t&amp;oslash;ffe livet p&amp;aring; og utenfor banen i en av verdens beste fotballigaer, er i regi av Danny Cannon, mannen bak den suksessfulle tv-serien &quot;C.S.I.&quot;. Hovedrollen i GOAL! spilles av mexicanske Kuno Becker, som enn s&amp;aring; lenge er et rimelig ubeskrevet blad innen langfilm. Noen av de mest popul&amp;aelig;re profilene fra fotballverden dukker ogs&amp;aring; opp i filmen, inkludert David Beckham, Zin&amp;eacute;dine Zidane, Ra&amp;uacute;l og Newcastles kaptein Alan Shearer.\n\n\nDa Santiago (Kuno Becker) kom fra Mexico til USA som 10-&amp;aring;ring, hadde han to ting med seg: fotballen sin og et fillete bilde av pokalen fra verdensmesterskapet i fotball. Under oppveksten i Los Angeles som for det meste besto av mange d&amp;aring;rlig betalte jobber, var Santiagos store lidenskap &amp;aring; spille fotball. &amp;Aring; overbevise faren sin at han kunne bli en internasjonal fotballstjerne var en annen sak: &quot;Det finnes to typer mennesker i denne verden. Folk i flotte hus, og folk som oss, som klipper plenen og vasker bilene deres&quot;, proklamerer eldre Munez (Tony Plana).\n\nMen n&amp;aring;r briten Glen Foy (Stephen Dillane), en tidligere fotballspiller og tidvis talentspeider, f&amp;aring;r &amp;oslash;ye p&amp;aring; Santiago i en lokal kamp i Los Angeles, oppdager han en dyktig, kjapp og modig fotballspiller - et type talent som den engelske Premier League-klubben Newcastle United er p&amp;aring; utkikk etter.\n\nN&amp;aring;r han s&amp;aring; blir kastet inn i et fremmed land hvor fotball er religion og Newcastles hjemmebane St. James' Park kirken, m&amp;aring; denne unge amerikaneren bevise at han har mot og ferdigheter til &amp;aring; f&amp;aring; en kontrakt med en av de mest renommerte fotballklubbene i verden. Gj&amp;oslash;rmete baner, kald vind og knusende taklinger fra lagkameratene - for ikke &amp;aring; snakke om personlig sorg, skader og livets s&amp;oslash;te fristelser - er bare noen av de mange hindringene Santiago m&amp;aring; overvinne for &amp;aring; triumfere i den t&amp;oslash;ffe, berusende verden som internasjonal fotball er. \n","torrent":{"xt":"urn:btih:fba7937fdad7c35390dbf1a6812d02647191f064","amp;dn":"Goal%21+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fba7937fdad7c35390dbf1a6812d02647191f064","infoHashBuffer":{"type":"Buffer","data":[251,167,147,127,218,215,195,83,144,219,241,166,129,45,2,100,113,145,240,100]},"announce":[],"urlList":[]}}