{"title":"Collectorz.com.Movie.Collector.Pro.v4.10.5","uid":3505873,"size":4754753,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd55c4a1d20fff1cf048b86c7d5cea61b3e8c69b&amp;dn=Collectorz.com.Movie.Collector.Pro.v4.10.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"somicv2","files":2,"time":1153537842,"description":"Movie Collector is a program that helps you catalog your\n        collection of DVDs, VHS tapes, laserdiscs, etc... This organizer\n        software runs on Windows 95, 98, NT4, ME, XP and 2000. \n\n\n        Catalog your movie collection\n        Adding items to the movie database is quick and easy, just type\n        the movie title or scan the DVD barcode with your barcode\n        scanner. Movie Collector will automatically download all data\n        (director, producer, genre, studio, etc... including an actor\n        list and the cover images). The information is retrieved from\n        various movie database sites on the internet (like the Internet\n        Movie Database, the Amazon DVD catalog or DVD Empire). \n\n        View and search the movie database\n        Once you have added a number of DVDs to the inventory, you can\n        view it on the main screen. It is possible to show a simple list\n        of all movies, but you can also organize your collection by\n        genre, director or actor, etc.. using the automatic folder\n        feature. All lists can be sorted instantly, just by clicking the\n        column headers or by using the Sort Order screen. You can sort on\n        any field, e.g. alphabetically on title or label, or sorted on\n        release date or purchase date. Use the Quick Search feature to\n        find all movies that contain the word you type, or use the\n        Advanced Filter command to search in specific fields, even\n        multiple fields at once. \n\n        Print lists\n        Lists of your movies can be printed in any way you want. The\n        Print feature lets you choose which movies to print, which fields\n        to show and in what order to list them. Printed lists are ideal\n        for insurance purposes, or to take with you to the store. The Pro\n        edition of this program also includes a number of templates for\n        other nicely formatted print-outs. The flexible XML/XSL-based\n        template system lets you create your own layouts too (requires\n        XSL programming skills). Visit our Templates page to download\n        templates created by other users. \n\n        Export your movie catalog (Pro edition only)\n        Using the Export to HTML feature you can generate HTML pages of\n        your movie inventory, for use on your homepage or website. You\n        can create one index page listing all movies (with one row per\n        movie), optionally linked to detail pages with one page per DVD. \n        If you want to be able to use your movie data in other programs,\n        use the Export to XML or Export to Text functions. A special\n        export feature is included to export your database for use in the\n        ListPro software on your PDA (PocketPC or Palm). \n\n        Integrated Loan Manager (Pro edition only)\n        The built-in Loan Management system allows you to keep track of\n        DVDs you loan to friends, family, etc... Just log which DVD you\n        loaned and to whom and you will always know where your missing\n        DVDs are. \n\n\n        Use Movie Collector to:\n\n        ? Catalog DVDs without typing\n        All data is downloaded to your movie database automatically\n\n        ? Instantly sort your lists\n        On any field, e.g. alphabetically by title, director or genre, or\n        by year\n\n        ? View DVD cover thumbnails\n        Download cover images or use the built-in TWAIN scanner support\n\n        ? Search your movie database\n        E.g. find a movie by title or all movies that Arnie plays in\n\n        ? Print movie lists\n        Ideal for insurance purposes. Print any field selection and in\n        any order\n\n        ? Export data to HTML lists\n        Place your movie database on a website, including cover images\n\n        ? Track your loans\n        Track who borrowed your DVDs, loan dates and due dates\n\n\n        Whats New In v4.10.5?:\n\n        Fixed:\n        - Automatic version update failed if another Collectorz.com\n          application also updated automatically recently\n        - Error message &quot;Not a valid integer&quot; when sorting text fields\n          with very large numbers (e.g. barcodes)\n\n\n\n        For More Info On Collectorz.com Movie Collector Pro Visit:\n       &lt;a href=&quot; http://www.collectorz.com/movie/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.collectorz.com/movie/&lt;/a&gt;","torrent":{"xt":"urn:btih:fd55c4a1d20fff1cf048b86c7d5cea61b3e8c69b","amp;dn":"Collectorz.com.Movie.Collector.Pro.v4.10.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd55c4a1d20fff1cf048b86c7d5cea61b3e8c69b","infoHashBuffer":{"type":"Buffer","data":[253,85,196,161,210,15,255,28,240,72,184,108,125,92,234,97,179,232,198,155]},"announce":[],"urlList":[]}}