{"title":"Maltese Double Cross.wmv","uid":3393632,"size":293549755,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdf99fded136b50db6da69f983a260a39088fff6&amp;dn=Maltese+Double+Cross.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"net3431","files":1,"time":1128744968,"description":"An investigation into the crash of Pan Am Flight 103 over Lockerbie, Scotland.\nThe famous film by Allan Francovich.\n\nShowings of the film in Britain were canceled under threat of lawsuits, and venues burglarized or attacked with arson. When Channel 4 agreed to show the film, the Scottish Crown Office and the U.S. Embassy in London sent press packs to the media, labeling the film &quot;blatant propaganda,&quot; and attacking some of the film's interviewees, including Coleman and Aviv. Additionally, Francovich said he had learned that five CIA operatives had been sent to London and Cyprus to discredit the film while it was being made, that his office phones were tapped, and staff cars sabotaged, and that one of his researchers narrowly escaped an attempt to force his vehicle into the path of an oncoming truck. \n  \nLockerbie investigators went so far as to ask the FBI to investigate the film. The Bureau later issued a highly derogatory opinion of it. \n  \nThe film's detractors made much of the fact that the film was initially funded jointly by a U.K. company (two-thirds) and a Libyan government investment concern (one-third). Francovich said that he was fully aware of this and had taken pains to negotiate a guarantee of independence from any interference. \n  \nOn April 17, 1997, Allan Francovich suddenly died of a heart attack at age 56, upon arrival at Houston Airport.38 His film has had almost no showings in the United States.\n","torrent":{"xt":"urn:btih:fdf99fded136b50db6da69f983a260a39088fff6","amp;dn":"Maltese+Double+Cross.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdf99fded136b50db6da69f983a260a39088fff6","infoHashBuffer":{"type":"Buffer","data":[253,249,159,222,209,54,181,13,182,218,105,249,131,162,96,163,144,136,255,246]},"announce":[],"urlList":[]}}