{"title":"dj deejay edit remixes 115 songs mp3s","uid":3492559,"size":848618642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff874eada79c50bb87860f74f873b9aa3265f8f8&amp;dn=dj+deejay+edit+remixes+115+songs+mp3s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loveaknot","files":115,"time":1149486553,"description":"adam freeland - supernatural things (dj deejay edit remix)\nadam freeland - we want your soul (dj deejay edit remix)\nalexei sayle - didnt you kill my brother (dj deejay edit remix)\nAnanda Project N.Hitchcock - Can You Find The Heart (dj deejay edit remix)\nAnnie - Chewing Gum (dj deejay edit remix)\narmin van buuren - another day (dj deejay edit remix)\narmin van buuren ft. justine suissa - burned with desire (dj deejay edit remix)\nArt Of Trance - Love Washes Over (dj deejay edit remix)\nAstral - Now and forever (dj deejay edit remix)\nATB - I Dont Wanna Stop (dj deejay edit mix)\nATB - Long Way Home (dj deejay edit remix)\nAubrey - I&amp;#039;m Waiting (dj deejay edit remix)\nAurora - Sleeping Satellite (dj deejay edit remix)\nBecky Baeling - getaway (dj deejay edit remix)\nblank &amp; jones - Desire (dj deejay edit mix)\nBlue Man Group - I Feel Love (dj deejay edit remix)\nBoogie Pimps - Somebody To Love (dj deejay edit remix)\nBoomkat - What U Do 2 Me (dj deejay edit remix)\nbritney spears- toxic (dj deejay edit remix)\nBT - Somnambulist (dj deejay edit mix)\nBT feat. jc chasez - the force of gravity (dj deejay total remix)\nChristina Aguilera - Beautiful (dj deejay edit remix)\nchristina milian - whatever you want (dj deejay total remix)\nColdplay - Clocks (dj deejay edit remix)\ncolourful kharma - for the music (dj deejay edit remix)\nCooler Kids - Morning Star (dj deejay edit remix)\nDa Buzz - Wanna Be With Me (dj deejay edit remix)\nDaniel Bedingfield - If You&amp;#039;re Not The One (dj deejay edit remix)\nDannii Minogue - I Begin To Wonder (dj deejay edit remix)\nDavid Guetta - Just a Little More Love (dj deejay edit remix)\ndavid morales ft. lea lorien - how would you feel (dj deejay total remix)\nDeepest Blue - Deepest Blue (dj deejay edit remix)\ndejure - sanctuary (dj deejay edit remix)\nDelerium - truly (dj deejay edit remix)\nDelerium ft Jael - After All (dj deejay edit mix)\nDirt Devils - Music Is Life (dj deejay edit remix)\nDirty Vegas - Days Go By (dj deejay edit remix)\nDJ Errik - Fast cars and Bitches (dj deejay edit remix)\nDJ Murphy Brown - Axel F 2003 (dj deejay edit remix)\nDJ Sammy - Sunlight (dj deejay edit remix)\nDJ Sammy feat. Bryan Adams - Heaven (dj deejay edit remix)\nDJ Tomcraft - Overdose (dj deejay edit remix)\nDT8 Feat. Roxanne Wilde - Destination (dj deejay edit remix)\nDub Pistols - Problem Is (dj deejay edit remix)\nEamon - Fuck It (uncensored dj deejay remix)\nFerry Corsten - Rock Your Body Rock (dj deejay edit remix)\nFinley Quaye And William Orbit Feat. Beth Orton - Dice (dj deejay edit remix)\nFuture Breeze - Ocean of eternity (dj deejay edit remix)\nGardeweg - All I Want (dj deejay edit remix)\ngeorgie Porgie - I Love I Love (dj deejay edit remix)\ngwen stefani - what you waiting for (dj deejay edit remix)\nHex Hector Pres.Kim Sozzi - We Get Together (dj deejay edit remix)\niio - At The End (dj deejay edit remix)\niio- smooth vs runaway (dj deejay edit remix)\nInformation Society - Pure Energy (dj deejay edit remix)\ninner city - good life (dj deejay edit remix)\njahkey b feat. satta - heartattack (dj deejay total remix)\nJaimeson - Complete (dj deejay edit remix)\nJakatta - One Fine Day (dj deejay edit remix)\nJames Holden - A break in the clouds (dj deejay edit remix)\nJason Nevins feat. HJ - I&amp;#039;m In Heaven (dj deejay edit remix)\nJennifer Lopez - I&amp;#039;m Glad (dj deejay edit remix)\nJethro Tull - Thick As a Brick (dj deejay all acoustic edit mix)\nkevin aviance - give it up (dj deejay edit remix)\nKid Alex - Young Love Topless (dj deejay edit remix)\nKings2 of Tomorrow - Dreams 2003 (dj deejay edit remix)\nKosheen - All In My Head (dj deejay edit remix)\nKreo - Burn For You (dj deejay edit remix)\nKylie Minogue - Slow (dj deejay edit remix)\nLC Anderson vs Psycho Radio - Right Stuff (dj deejay edit remix)\nLFO - Freak (dj deejay edit remix)\nLiquid People vs Talk Talk - It&amp;#039;s My Life (dj deejay edit remix)\nLove Committee - Love Rules (dj deejay edit remix)\nManijama feat. Mukuya - No no no (dj deejay edit remix)\nMartin Solveig - Rocking Music (dj deejay edit remix)\nMilk And Sugar - Let The Sunshine In (dj deejay dub remix)\nmilk and sugar - let the sunshine in (dj deejay edit remix)\nMoguai - Get On (dj deejay edit remix)\nmoloko - forever more (dj deejay edit remix)\nMotorcycle - As The Rush Comes (dj deejay edit remix)\nMurk - Alright (dj deejay edit remix)\nMurk - Believe (dj deejay edit remix)\nOceanlab - Sky Falls Down (dj deejay edit remix)\norielle - all i know (dj deejay edit remix)\norigene - sanctuary (dj deejay total remix)\nOverseer - Horndog (dj deejay remix)\nPaul Van Dyk - Nothing But You (dj deejay edit remix)\npet shop boys - miracles (dj deejay edit remix)\nPlummet - Damaged (dj deejay edit remix)\nplump djs - Morning Sun (dj deejay edit remix)\nPlump DJ&amp;#039;s Gary Numan - Pray For You (dj deejay edit remix)\nPuretone - Stuck In A Groove (dj deejay edit mix)\nrenaissance - a song for all seasons (dj deejay edit remix)\nSaffron Hill - My Love Is Always There (dj deejay edit remix)\nseal - Waiting For You (dj deejay edit remix)\nStacie Orrico - Stuck (dj deejay edit remix)\nsteppenwolf - magic carpet ride (dj deejay edit remix)\nSugababes - In The Middle (dj deejay edit remix)\nSyntax - bliss (dj deejay edit remix)\nTelepopmusik - Breathe (dj deejay edit remix)\nThe Bitch Hotel - Do U Wanna Dance (dj deejay edit remix)\nThe Roc Project feat. Tina Arena - Never (dj deejay edit remix)\nThe Scumfrog - Music revolution (dj deejay remix)\nThrillseekers - Dreaming Of You (dj deejay edit remix)\nTim Deluxe feat. Sam Obernik - It Just Won&amp;#039;t Do (dj deejay edit remix)\nTina Ann - I Do (dj deejay edit remix)\nTommy Vee ft Diane Charlemange - You make Me Wanna (dj deejay edit remix)\nTurin Brakes - Pain Killer (dj deejay remix)\nUltrabeat - Pretty Green Eyes (dj deejay edit mix)\nutada hikaru - devil inside (dj deejay edit remix)\nWay Out West - Muthafucka (dj deejay edit remix)\nWildlife - I Don&amp;#039;t Want You (dj deejay edit remix)\nwill to power - fading away (dj deejay edit remix)\nwill to power - fading away (dj deejay re-edit remix)\nzz top - Gimme All Your Loving (dj deejay edit remix)","torrent":{"xt":"urn:btih:ff874eada79c50bb87860f74f873b9aa3265f8f8","amp;dn":"dj+deejay+edit+remixes+115+songs+mp3s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff874eada79c50bb87860f74f873b9aa3265f8f8","infoHashBuffer":{"type":"Buffer","data":[255,135,78,173,167,156,80,187,135,134,15,116,248,115,185,170,50,101,248,248]},"announce":[],"urlList":[]}}