{"title":"StyleXP v3 Complete Package Male Female and Update","uid":3290895,"size":31103375,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ffde9ae756c530bc9a96d4e44a34e958ca14a9ce&amp;dn=StyleXP+v3+Complete+Package+Male+Female+and+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sirithanan","files":1,"time":1108570459,"description":"What is Style XP?\nStyle XP is not a skinning engine. It uses Microsoft's built-in visual style engine, but enhances it by providing many useful tools. Style XP can import, select, rotate, and manage themes, visual styles, wallpapers,  logons, bootscreens, icons, and explorer bar. Future versions may support sounds, cursors, screensavers, and packages of all the above. How does it work? Instead of lines and gradients, the XP user interface natively supports the use of skinned bitmap controls (a visual style). This is Microsoft's own innovation. Style XP includes its own visual styles.\n\n\nZero-Footprint Operation\nChoose to have Style XP run in the system tray for easy management and selection of new styles, or turn Style XP off for zero-footprint operation. No additional memory will be utilized unless you desire it.\n\nNative\n\n\nStyle XP skins are zero-footprint because they use the same Visual Style Source that is built into XP. XP's Visual Style Engine will load and draw our start button with the exact code used to load and draw the infamous green start buttons of the original Blue, Olive Green, and Silver skins.\n\nThis is done by performing an in memory patch to XP's Visual Style Engine. Style XP does not use SetWindowsHookEx, which can noticeably slow system performance. Nor does it hook the &amp;quot;Appearance&amp;quot; tab on the Display Properties property sheet.\n\n\nNew Visual Styles, Wallpapers, Logons, and Themes\nTry out our new &amp;quot;CoughDrop&amp;quot; visual style and color schemes. &amp;quot;Toothpaste&amp;quot; and a community skin pack are also included. You can download more visual styles for free from ThemeXP.\n\nAccessibility &amp;amp; High-Resolution Functionality\n\n\nDoes your monitor operate at 1600x1200? How about 2048 x 1536? Perhaps you have a new LCD display.\n\nAt these finer pixel resolutions, the display can exceed 100 DPI. StyleBuilder is designed to build skins which support the higher DPI resolutions so that window controls are easier to see.\n\nSince Style XP skins are native source styles, this useful XP functionality is present in its original and familiar form.\n\nApplication Compatibility\n\n\n\nOur native design allows us to enjoy the thousands of hours of work put in by Microsoft's UI team to ensure application compatibility.\n\nThere is no list of incompatible applications to keep track of.\n\nFont Sizes\n\n\nLike the original Microsoft Blue, Olive Green, and Silver Visual Styles, StyleBuilder &amp;amp; Style XP skins support three font sizes Normal, Large, and Extra Large.\n\nThese larger font sizes are important, because they are used by the elderly and visually impaired.","torrent":{"xt":"urn:btih:ffde9ae756c530bc9a96d4e44a34e958ca14a9ce","amp;dn":"StyleXP+v3+Complete+Package+Male+Female+and+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffde9ae756c530bc9a96d4e44a34e958ca14a9ce","infoHashBuffer":{"type":"Buffer","data":[255,222,154,231,86,197,48,188,154,150,212,228,74,52,233,88,202,20,169,206]},"announce":[],"urlList":[]}}