{"title":"Saints (3 albums)","uid":3431682,"size":267560559,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ffff09c997fc46eaedc7729fbe5e16ba7c712621&amp;dn=Saints+%283+albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stefh","files":55,"time":1137198126,"description":"Roaring out of Brisbane, Australia, in 1977 with the punk-era classic &quot;(I'm) Stranded,&quot; the Saints, despite going through numerous incarnations, were a part of rock &amp; roll for more than 20 years, thanks mainly to their indefatigable leader (and founder) Chris Bailey. Although they didn't play anything that passes for punk rock after about 1978, and despite extended dormant periods, the Saints never officially broke up, and Bailey always seemed to have another version of the band and record ready to release. Saints fans fall into two distinct camps: the punk-era fans (up to about 1980) and the mature pop fans, which for American audiences begins with the release of All Fools Day in 1987. I will here admit my biases and tell you that I am more of a fan of the punk era than of the mature pop era. This has nothing to do with the overall quality of the music; Bailey recorded two fine records with the late-'80s incarnation of the band. It's simply that the feral assault of their first three records (when co-founder Ed Kuepper was in the band) is more interesting and exciting. After Kuepper left in 1979 and the band became Bailey's show, the twists and turns he took them through (horns, folk/blues arrangements, as well his numerous solo excursions) produced some good music, but it was mostly too scattershot and lacked focus. It was simply too difficult to wade through the mediocre material.","torrent":{"xt":"urn:btih:ffff09c997fc46eaedc7729fbe5e16ba7c712621","amp;dn":"Saints+%283+albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffff09c997fc46eaedc7729fbe5e16ba7c712621","infoHashBuffer":{"type":"Buffer","data":[255,255,9,201,151,252,70,234,237,199,114,159,190,94,22,186,124,113,38,33]},"announce":[],"urlList":[]}}